Show / Hide Table of Contents
Class RobotTarget
Robot Target class, defines robot target data. The robt target data is used to define the position of the robot and external axes.
Inheritance
System.Object
Action
RobotTarget
Implements
ITarget
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Actions
Assembly: RobotComponents.dll
Syntax
public class RobotTarget : Action, ITarget
Constructors
RobotTarget()
Defines an empty Robot Target object.
Declaration
public RobotTarget()
RobotTarget(RobotTarget)
Creates a new target by duplicating an existing target. This creates a deep copy of the existing target.
Declaration
public RobotTarget(RobotTarget target)
Parameters
 Type |  Name |  Description
 RobotTarget |  target
The target that should be duplicated.
RobotTarget(String, Plane)
Defines a robot target with default axis configuration.
Declaration
public RobotTarget(string name, Plane plane)
Parameters
 Type |  Name |  Description
 System.String |  name
Robot target name, must be unique.
 Rhino.Geometry.Plane |  plane
Robot target plane.
RobotTarget(String, Plane, Plane, Int32)
Defines a robot target that will be re-oriented from the reference coordinate system to the global coordinate system.
Declaration
public RobotTarget(string name, Plane plane, Plane referencePlane, int axisConfig)
Parameters
 Type |  Name |  Description
 System.String |  name
Robot target name, must be unique.
 Rhino.Geometry.Plane |  plane
Robot target plane.
 Rhino.Geometry.Plane |  referencePlane
Reference plane. Target planes will be reoriented from this plane to the origon (WorldXY).
 System.Int32 |  axisConfig
Robot axis configuration as a number (0-7).
RobotTarget(String, Plane, Plane, Int32, ExternalJointPosition)
Defines a robot target with a user defined external joint position. Target planes will be re-oriented from the reference coordinate system to the global coordinate system.
Declaration
public RobotTarget(string name, Plane plane, Plane referencePlane, int axisConfig, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 System.String |  name
Robot target name, must be unique.
 Rhino.Geometry.Plane |  plane
Robot target plane.
 Rhino.Geometry.Plane |  referencePlane
Reference plane. Target planes will be reoriented from this plane to the origon (WorldXY).
 System.Int32 |  axisConfig
Robot target axis configuration as a number (0-7).
 ExternalJointPosition |  externalJointPosition
The user defined external joint position.
RobotTarget(String, Plane, Plane, Int32, List<Double>)
Defines a robot target with user defined (override) external axis values. Target planes will be re-oriented from the reference coordinate system to the global coordinate system.
Declaration
public RobotTarget(string name, Plane plane, Plane referencePlane, int axisConfig, List<double> Eax)
Parameters
 Type |  Name |  Description
 System.String |  name
Robot target name, must be unique.
 Rhino.Geometry.Plane |  plane
Robot target plane.
 Rhino.Geometry.Plane |  referencePlane
Reference plane. Target planes will be reoriented from this plane to the origon (WorldXY).
 System.Int32 |  axisConfig
Robot target axis configuration as a number (0-7).
 System.Collections.Generic.List<System.Double> |  Eax
The user defined external axis values as a list.
RobotTarget(String, Plane, Plane, Int32, Double, Double, Double, Double, Double, Double)
Defines a robot target with user defined (override) external axis values.
Declaration
public RobotTarget(string name, Plane plane, Plane referencePlane, int axisConfig, double Eax_a, double Eax_b = 9000000000, double Eax_c = 9000000000, double Eax_d = 9000000000, double Eax_e = 9000000000, double Eax_f = 9000000000)
Parameters
 Type |  Name |  Description
 System.String |  name
Robot target name, must be unique.
 Rhino.Geometry.Plane |  plane
Robot target plane.
 Rhino.Geometry.Plane |  referencePlane
Reference plane. Target planes will be reoriented from this plane to the origin (WorldXY).
 System.Int32 |  axisConfig
Robot axis configuration as a number (0-7).
 System.Double |  Eax_a
The position of the external logical axis “a” expressed in degrees or mm.
 System.Double |  Eax_b
The position of the external logical axis “b” expressed in degrees or mm.
 System.Double |  Eax_c
The position of the external logical axis “c” expressed in degrees or mm.
 System.Double |  Eax_d
The position of the external logical axis “d” expressed in degrees or mm.
 System.Double |  Eax_e
The position of the external logical axis “e” expressed in degrees or mm.
 System.Double |  Eax_f
The position of the external logical axis “f” expressed in degrees or mm.
RobotTarget(String, Plane, Plane, Int32, Double[])
Defines a robot target with user defined (override) external axis values. Target planes will be re-oriented from the reference coordinate system to the global coordinate system.
Declaration
public RobotTarget(string name, Plane plane, Plane referencePlane, int axisConfig, double[] Eax)
Parameters
 Type |  Name |  Description
 System.String |  name
Robot target name, must be unique.
 Rhino.Geometry.Plane |  plane
Robot target plane.
 Rhino.Geometry.Plane |  referencePlane
Reference plane. Target planes will be reoriented from this plane to the origon (WorldXY).
 System.Int32 |  axisConfig
Robot target axis configuration as a number (0-7).
 System.Double[] |  Eax
The user defined external axis values as an array.
RobotTarget(String, Plane, Int32)
Defines a robot target with a user defined axis configuration.
Declaration
public RobotTarget(string name, Plane plane, int axisConfig)
Parameters
 Type |  Name |  Description
 System.String |  name
Robot target name, must be unique.
 Rhino.Geometry.Plane |  plane
Robot target plane.
 System.Int32 |  axisConfig
Robot axis configuration as a number (0-7).
RobotTarget(String, Plane, Int32, ExternalJointPosition)
Defines a robot target with a user defined external joint position.
Declaration
public RobotTarget(string name, Plane plane, int axisConfig, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 System.String |  name
Robot target name, must be unique.
 Rhino.Geometry.Plane |  plane
Robot target plane.
 System.Int32 |  axisConfig
Robot target axis configuration as a number (0-7).
 ExternalJointPosition |  externalJointPosition
The user defined external joint position.
RobotTarget(String, Plane, Int32, List<Double>)
Defines a robot target with user defined (override) external axis values.
Declaration
public RobotTarget(string name, Plane plane, int axisConfig, List<double> Eax)
Parameters
 Type |  Name |  Description
 System.String |  name
Robot target name, must be unique.
 Rhino.Geometry.Plane |  plane
Robot target plane.
 System.Int32 |  axisConfig
Robot target axis configuration as a number (0-7).
 System.Collections.Generic.List<System.Double> |  Eax
The user defined external joint positions as a list with axis values.
Properties
AxisConfig
The axis configuration of the robot (0-7).
Declaration
public int AxisConfig { get; set; }
Property Value
 Type |  Description
 System.Int32
ExternalJointPosition
Defines the External Joint Position
Declaration
public ExternalJointPosition ExternalJointPosition { get; set; }
Property Value
 Type |  Description
 ExternalJointPosition
IsValid
A boolean that indicuate if the Robot Target object is valid.
Declaration
public override bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
Overrides
Action.IsValid
Name
The robot target variable name, must be unique.
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Plane
The position and orientation of the tool center as a plane.
Declaration
public Plane Plane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Quat
The orientation of the tool, expressed in the form of a quaternion (q1, q2, q3, and q4).
Declaration
public Quaternion Quat { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Quaternion
Methods
Duplicate()
Method to duplicate the Target object.
Declaration
public RobotTarget Duplicate()
Returns
 Type |  Description
 RobotTarget
Returns a deep copy of the Target object.
DuplicateAction()
A method to duplicate the Target object to an Action object.
Declaration
public override Action DuplicateAction()
Returns
 Type |  Description
 Action
Returns a deep copy of the Target object as an Action object.
Overrides
Action.DuplicateAction()
DuplicateTarget()
A method to duplicate the Robot Target object to an ITarget object.
Declaration
public ITarget DuplicateTarget()
Returns
 Type |  Description
 ITarget
Returns a deep copy of the Robot Target object as an ITarget object.
ToRAPIDDeclaration(RAPIDGenerator)
Used to create variable definitions in the RAPID Code. It is typically called inside the CreateRAPIDCode() method of the RAPIDGenerator class.
Declaration
public override void ToRAPIDDeclaration(RAPIDGenerator RAPIDGenerator)
Parameters
 Type |  Name |  Description
 RAPIDGenerator |  RAPIDGenerator
Defines the RAPIDGenerator.
Overrides
Action.ToRAPIDDeclaration(RAPIDGenerator)
ToRAPIDDeclaration(Robot)
Used to create variable definition code of this action.
Declaration
public override string ToRAPIDDeclaration(Robot robot)
Parameters
 Type |  Name |  Description
 Robot |  robot
Defines the Robot were the code is generated for.
Returns
 Type |  Description
 System.String
Returns the RAPID code line as a string.
Overrides
Action.ToRAPIDDeclaration(Robot)
ToRAPIDInstruction(RAPIDGenerator)
Used to create action instructions in the RAPID Code. It is typically called inside the CreateRAPIDCode() method of the RAPIDGenerator class.
Declaration
public override void ToRAPIDInstruction(RAPIDGenerator RAPIDGenerator)
Parameters
 Type |  Name |  Description
 RAPIDGenerator |  RAPIDGenerator
Defines the RAPIDGenerator.
Overrides
Action.ToRAPIDInstruction(RAPIDGenerator)
ToRAPIDInstruction(Robot)
Used to create action instruction code line.
Declaration
public override string ToRAPIDInstruction(Robot robot)
Parameters
 Type |  Name |  Description
 Robot |  robot
Defines the Robot were the code is generated for.
Returns
 Type |  Description
 System.String
Returns the RAPID code line as a string.
Overrides
Action.ToRAPIDInstruction(Robot)
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
Action.ToString()
Implements
 ITarget