Show / Hide Table of Contents
Class ForwardKinematics
Forward Kinematics class
Inheritance
System.Object
ForwardKinematics
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Kinematics
Assembly: RobotComponents.dll
Syntax
public class ForwardKinematics
Constructors
ForwardKinematics()
Defines a empty ForwardKinematic Object.
Declaration
public ForwardKinematics()
ForwardKinematics(Robot, JointTarget, Boolean)
Defines a Forward Kinematic object from a Joint Target.
Declaration
public ForwardKinematics(Robot robotInfo, JointTarget jointTarget, bool hideMesh = false)
Parameters
 Type |  Name |  Description
 Robot |  robotInfo
Robot Information the FK should be calculated for.
 JointTarget |  jointTarget
The internal and external axis values defined as a Joint Target.
 System.Boolean |  hideMesh
Boolean that indicates if the mesh will be supressed.
ForwardKinematics(Robot, RobotJointPosition, ExternalJointPosition, Boolean)
Defines a Forward Kinematic Object for certain axis values.
Declaration
public ForwardKinematics(Robot robotInfo, RobotJointPosition robotJointPosition, ExternalJointPosition externalJointPosition, bool hideMesh = false)
Parameters
 Type |  Name |  Description
 Robot |  robotInfo
Robot Information the FK should be calculated for.
 RobotJointPosition |  robotJointPosition
The internal axis values as a Robot Joint Position.
 ExternalJointPosition |  externalJointPosition
The external axis values as an External Joint Position.
 System.Boolean |  hideMesh
Boolean that indicates if the mesh will be supressed.
ForwardKinematics(Robot, Boolean)
Defines a Forward Kinematic object.
Declaration
public ForwardKinematics(Robot robotInfo, bool hideMesh = false)
Parameters
 Type |  Name |  Description
 Robot |  robotInfo
Robot Information the FK should be calculated for.
 System.Boolean |  hideMesh
Boolean that indicates if the mesh will be supressed.
ForwardKinematics(Robot, List<Double>, List<Double>, Boolean)
Defines a Forward Kinematic Object for certain axis values.
Declaration
public ForwardKinematics(Robot robotInfo, List<double> internalAxisValues, List<double> externalAxisValues, bool hideMesh = false)
Parameters
 Type |  Name |  Description
 Robot |  robotInfo
Robot Information the FK should be calculated for.
 System.Collections.Generic.List<System.Double> |  internalAxisValues
List of internal axis values. The length of the list should be equal to 6.
 System.Collections.Generic.List<System.Double> |  externalAxisValues
List of external axis values. The length of the list should be (for now) equal to 1.
 System.Boolean |  hideMesh
Boolean that indicates if the mesh will be supressed.
ForwardKinematics(ForwardKinematics)
Creates a new forward kinematics by duplicating an existing forward kinematics. This creates a deep copy of the existing forward kinematics.
Declaration
public ForwardKinematics(ForwardKinematics forwardKinematics)
Parameters
 Type |  Name |  Description
 ForwardKinematics |  forwardKinematics
The forward kinematics that should be duplicated.
Properties
ErrorText
List of strings with collected error messages.
Declaration
public List<string> ErrorText { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.String>
ExternalJointPosition
Defines the External Joint Position
Declaration
public ExternalJointPosition ExternalJointPosition { get; set; }
Property Value
 Type |  Description
 ExternalJointPosition
HideMesh
A boolean that indicates if the posed mesh is or will be calculated
Declaration
public bool HideMesh { get; set; }
Property Value
 Type |  Description
 System.Boolean
InLimits
Bool that indicates if the internal and external values are within their limits
Declaration
public bool InLimits { get; }
Property Value
 Type |  Description
 System.Boolean
IsValid
A boolean that indicates if the Forward Kinematics object is valid.
Declaration
public bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
PosedExternalAxisMeshes
A List of meshes in pose for the external axis.
Declaration
public List<List<Mesh>> PosedExternalAxisMeshes { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Collections.Generic.List<Rhino.Geometry.Mesh>>
PosedExternalAxisPlanes
Array of external axis planes.
Declaration
public Plane[] PosedExternalAxisPlanes { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane[]
PosedInternalAxisMeshes
Calcualte robot pose meshes
Declaration
public List<Mesh> PosedInternalAxisMeshes { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
RobotInfo
RobotInformation the FK should be calculated for.
Declaration
public Robot RobotInfo { get; set; }
Property Value
 Type |  Description
 Robot
RobotJointPosition
Defines the Robot Joint Position
Declaration
public RobotJointPosition RobotJointPosition { get; set; }
Property Value
 Type |  Description
 RobotJointPosition
TCPPlane
Calculated posed TCP plane of the robot tool.
Declaration
public Plane TCPPlane { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Methods
Calculate()
Calculates Forward Kinematics based on the internal and external axis values.
Declaration
public void Calculate()
Calculate(RobotJointPosition, ExternalJointPosition)
Sets new axis values and calculates the new solution.
Declaration
public void Calculate(RobotJointPosition robotJointPosition, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 RobotJointPosition |  robotJointPosition
The internal axis values as a Robot Joint Position.
 ExternalJointPosition |  externalJointPosition
The external axis values as an External Joint Position.
Calculate(List<Double>, List<Double>)
Sets new axis values and calculates the new solution.
Declaration
public void Calculate(List<double> internalAxisValues, List<double> externalAxisValues)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.List<System.Double> |  internalAxisValues
List of internal axis values in degree. The length of the list should be equal to 6.
 System.Collections.Generic.List<System.Double> |  externalAxisValues
List of external axis values in meter. The length of the list should be (for now) equal to 1.
Clear()
Clears the current solution
Declaration
public void Clear()
Duplicate()
A method to duplicate the Forward Kinematics object.
Declaration
public ForwardKinematics Duplicate()
Returns
 Type |  Description
 ForwardKinematics
Returns a deep copy of the Forward Kinematics object.
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
System.Object.ToString()