Show / Hide Table of Contents
Class ForwardKinematics
Represent the Forward Kinematics for a 6-axis spherical Robot and its attached external axes.
Inheritance
System.Object
ForwardKinematics
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Kinematics
Assembly: RobotComponents.dll
Syntax
public class ForwardKinematics
Constructors
ForwardKinematics()
Initializes an empty instance of the Forward Kinematics class.
Declaration
public ForwardKinematics()
ForwardKinematics(Robot, JointTarget, Boolean)
Defines a Forward Kinematic object from a Joint Target with defined Joint Positions obtained from a Joint Target.
Declaration
public ForwardKinematics(Robot robot, JointTarget jointTarget, bool hideMesh = false)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot.
 JointTarget |  jointTarget
The Joint Target.
 System.Boolean |  hideMesh
Specifies whether the mesh will be supressed.
ForwardKinematics(Robot, RobotJointPosition, ExternalJointPosition, Boolean)
Initializes a new instance of the Forward Kinematics class with defined Joint Positions.
Declaration
public ForwardKinematics(Robot robot, RobotJointPosition robotJointPosition, ExternalJointPosition externalJointPosition, bool hideMesh = false)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot.
 RobotJointPosition |  robotJointPosition
The Robot Joint Position.
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
 System.Boolean |  hideMesh
Specifies whether the mesh will be supressed.
ForwardKinematics(Robot, Boolean)
Initializes a new instance of the Forward Kinematics class.
Declaration
public ForwardKinematics(Robot robot, bool hideMesh = false)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot.
 System.Boolean |  hideMesh
Specifies whether the mesh will be supressed.
ForwardKinematics(ForwardKinematics)
Initializes a new instance of the Forward Kinematics class by duplicating an existing Forward Kinematics instance.
Declaration
public ForwardKinematics(ForwardKinematics forwardKinematics)
Parameters
 Type |  Name |  Description
 ForwardKinematics |  forwardKinematics
The Forward Kinematics instance to duplicate.
Properties
ErrorText
Gets the collected error messages.
Declaration
public List<string> ErrorText { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.String>
ExternalJointPosition
Gets or sets the External Joint Position.
Declaration
public ExternalJointPosition ExternalJointPosition { get; set; }
Property Value
 Type |  Description
 ExternalJointPosition
HideMesh
Gets or sets a value indicating whether the posed meshed wil be calculated.
Declaration
public bool HideMesh { get; set; }
Property Value
 Type |  Description
 System.Boolean
InLimits
Gets a value indicating whether or not the internal and external values are within their limits.
Declaration
public bool InLimits { get; }
Property Value
 Type |  Description
 System.Boolean
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
PosedExternalAxisMeshes
Gets the latest calculated posed external axis meshes.
Declaration
public List<List<Mesh>> PosedExternalAxisMeshes { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Collections.Generic.List<Rhino.Geometry.Mesh>>
PosedExternalAxisPlanes
Gets the latest calculated posed external axis planes.
Declaration
public Plane[] PosedExternalAxisPlanes { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane[]
PosedInternalAxisMeshes
Gets the latest calculated posed internal axis meshes.
Declaration
public List<Mesh> PosedInternalAxisMeshes { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
Robot
Gets or sets the Robot.
Declaration
public Robot Robot { get; set; }
Property Value
 Type |  Description
 Robot
RobotJointPosition
Gets or sets the Robot Joint Position.
Declaration
public RobotJointPosition RobotJointPosition { get; set; }
Property Value
 Type |  Description
 RobotJointPosition
TCPPlane
Gets the latest calculated posed TCP plane of the robot tool.
Declaration
public Plane TCPPlane { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Methods
Calculate()
Calculates the forward kinematics solution with the Joint Positions stored inside this Forward Kinematics instance.
Declaration
public void Calculate()
Calculate(RobotJointPosition)
Calculates the forward kinematics solution with the given Robot Joint Positions and a default External Joint Position (9e9).
Declaration
public void Calculate(RobotJointPosition robotJointPosition)
Parameters
 Type |  Name |  Description
 RobotJointPosition |  robotJointPosition
The Robot Joint Position.
Calculate(RobotJointPosition, ExternalJointPosition)
Calculates the forward kinematics solution with the given Joint Positions.
Declaration
public void Calculate(RobotJointPosition robotJointPosition, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 RobotJointPosition |  robotJointPosition
The Robot Joint Position.
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Clear()
Clears the current solution.
Declaration
public void Clear()
Duplicate()
Returns an exact duplicate of this Forward Kinematics instance.
Declaration
public ForwardKinematics Duplicate()
Returns
 Type |  Description
 ForwardKinematics
A deep copy of the Forward Kinematics instance.
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
System.Object.ToString()