Show / Hide Table of Contents
Class Factory
Represents the presets factory.
Inheritance
object
Factory
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Namespace: RobotComponents.ABB.Presets
Assembly: RobotComponents.ABB.Presets.dll
Syntax
public static class Factory
Methods
GetRobotPreset(RobotPreset, Plane, RobotTool, IList<ExternalAxis>)
Returns a predefined ABB Robot preset.
Declaration
public static Robot GetRobotPreset(RobotPreset preset, Plane positionPlane, RobotTool tool, IList<ExternalAxis> externalAxes = null)
Parameters
 Type |  Name |  Description
 RobotPreset |  preset
The Robot preset type.
 Plane |  positionPlane
The position and orientation of the Robot in world coordinate space.
 RobotTool |  tool
The Robot Tool.
 IList<ExternalAxis> |  externalAxes
The external axes attached to the Robot.
Returns
 Type |  Description
 Robot