Show / Hide Table of Contents
Class ExternalRotationalAxis
Represents an External Rotational Axis.
Inheritance
object
ExternalAxis
ExternalRotationalAxis
Implements
ISerializable
IMechanicalUnit
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Namespace: RobotComponents.ABB.Definitions
Assembly: RobotComponents.ABB.dll
Syntax
public class ExternalRotationalAxis : ExternalAxis, ISerializable, IMechanicalUnit
Constructors
ExternalRotationalAxis()
Initializes an empty instance of the External Rotational Axis class.
Declaration
public ExternalRotationalAxis()
ExternalRotationalAxis(Plane, Interval)
Initializes a new instance of the External Rotational Axis class with empty meshes.
Declaration
public ExternalRotationalAxis(Plane axisPlane, Interval axisLimits)
Parameters
 Type |  Name |  Description
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation center.
 Interval |  axisLimits
The motion limits.
ExternalRotationalAxis(Plane, Interval, Mesh, Mesh)
Initializes a new instance of the External Rotational Axis class.
Declaration
public ExternalRotationalAxis(Plane axisPlane, Interval axisLimits, Mesh baseMesh, Mesh linkMesh)
Parameters
 Type |  Name |  Description
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation center.
 Interval |  axisLimits
The motion limits.
 Mesh |  baseMesh
The base mesh.
 Mesh |  linkMesh
The link mesh posed for an external axis value set to 0.
ExternalRotationalAxis(Plane, Interval, Mesh, Mesh, int, bool)
Initializes a new instance of the External Rotational Axis class.
Declaration
public ExternalRotationalAxis(Plane axisPlane, Interval axisLimits, Mesh baseMesh, Mesh linkMesh, int axisLogic, bool movesRobot = false)
Parameters
 Type |  Name |  Description
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation center.
 Interval |  axisLimits
The motion limits.
 Mesh |  baseMesh
The base mesh.
 Mesh |  linkMesh
The link mesh posed for an external axis value set to 0.
 int |  axisLogic
The axis logic number.
 bool |  movesRobot
Specifies whether the external axis moves a robot.
ExternalRotationalAxis(Plane, Interval, Mesh, Mesh, string, bool)
Initializes a new instance of the External Rotational Axis class.
Declaration
public ExternalRotationalAxis(Plane axisPlane, Interval axisLimits, Mesh baseMesh, Mesh linkMesh, string axisLogic, bool movesRobot = false)
Parameters
 Type |  Name |  Description
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation center.
 Interval |  axisLimits
The motion limits.
 Mesh |  baseMesh
The base mesh.
 Mesh |  linkMesh
The link mesh posed for an external axis value set to 0.
 string |  axisLogic
The axis logic number.
 bool |  movesRobot
Specifies whether the external axis moves a robot.
ExternalRotationalAxis(Plane, Interval, int, bool)
Initializes a new instance of the External Rotational Axis class with empty meshes.
Declaration
public ExternalRotationalAxis(Plane axisPlane, Interval axisLimits, int axisLogic, bool movesRobot = false)
Parameters
 Type |  Name |  Description
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation center.
 Interval |  axisLimits
The motion limits.
 int |  axisLogic
The axis logic number.
 bool |  movesRobot
Specifies whether the external axis moves a robot.
ExternalRotationalAxis(Plane, Interval, string, bool)
Initializes a new instance of the External Rotational Axis class with empty meshes.
Declaration
public ExternalRotationalAxis(Plane axisPlane, Interval axisLimits, string axisLogic, bool movesRobot = false)
Parameters
 Type |  Name |  Description
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation center.
 Interval |  axisLimits
The motion limits.
 string |  axisLogic
The axis logic number.
 bool |  movesRobot
Specifies whether the external axis moves a robot.
ExternalRotationalAxis(ExternalRotationalAxis, bool)
Initializes a new instance of the External Rotational Axis class by duplicating an existing External Rotational Axis instance.
Declaration
public ExternalRotationalAxis(ExternalRotationalAxis externalRotationalAxis, bool duplicateMesh = true)
Parameters
 Type |  Name |  Description
 ExternalRotationalAxis |  externalRotationalAxis
The External Rotational Axis instance to duplicate.
 bool |  duplicateMesh
Specifies whether the meshes should be duplicated.
ExternalRotationalAxis(SerializationInfo, StreamingContext)
Protected constructor needed for deserialization of the object.
Declaration
protected ExternalRotationalAxis(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 SerializationInfo |  info
The SerializationInfo to extract the data from.
 StreamingContext |  context
The context of this deserialization.
ExternalRotationalAxis(string, Plane, Interval, Mesh, Mesh)
Initializes a new instance of the External Rotational Axis class.
Declaration
public ExternalRotationalAxis(string name, Plane axisPlane, Interval axisLimits, Mesh baseMesh, Mesh linkMesh)
Parameters
 Type |  Name |  Description
 string |  name
The axis name.
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation center.
 Interval |  axisLimits
The motion limits.
 Mesh |  baseMesh
The base mesh.
 Mesh |  linkMesh
The link mesh posed for an external axis value set to 0.
ExternalRotationalAxis(string, Plane, Interval, Mesh, Mesh, int, bool)
Initializes a new instance of the External Rotational Axis class.
Declaration
public ExternalRotationalAxis(string name, Plane axisPlane, Interval axisLimits, Mesh baseMesh, Mesh linkMesh, int axisLogic, bool movesRobot = false)
Parameters
 Type |  Name |  Description
 string |  name
The axis name.
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation center.
 Interval |  axisLimits
The motion limits.
 Mesh |  baseMesh
The base mesh.
 Mesh |  linkMesh
The link mesh posed for an external axis value set to 0.
 int |  axisLogic
The axis logic number.
 bool |  movesRobot
Specifies whether the external axis moves a robot.
ExternalRotationalAxis(string, Plane, Interval, Mesh, Mesh, string, bool)
Initializes a new instance of the External Rotational Axis class.
Declaration
public ExternalRotationalAxis(string name, Plane axisPlane, Interval axisLimits, Mesh baseMesh, Mesh linkMesh, string axisLogic, bool movesRobot = false)
Parameters
 Type |  Name |  Description
 string |  name
The axis name.
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation center.
 Interval |  axisLimits
The motion limits.
 Mesh |  baseMesh
The base mesh.
 Mesh |  linkMesh
The link mesh posed for an external axis value set to 0.
 string |  axisLogic
The axis logic number.
 bool |  movesRobot
Specifies whether the external axis moves a robot.
ExternalRotationalAxis(string, Plane, Interval, IList<Mesh>, IList<Mesh>)
Initializes a new instance of the External Rotational Axis class.
Declaration
public ExternalRotationalAxis(string name, Plane axisPlane, Interval axisLimits, IList<Mesh> baseMeshes, IList<Mesh> linkMeshes)
Parameters
 Type |  Name |  Description
 string |  name
The axis name.
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation vector.
 Interval |  axisLimits
The motion limits.
 IList<Mesh> |  baseMeshes
The base mesh.
 IList<Mesh> |  linkMeshes
The link mesh posed for an external axis value set to 0.
ExternalRotationalAxis(string, Plane, Interval, IList<Mesh>, IList<Mesh>, int, bool)
Initializes a new instance of the External Rotational Axis class.
Declaration
public ExternalRotationalAxis(string name, Plane axisPlane, Interval axisLimits, IList<Mesh> baseMeshes, IList<Mesh> linkMeshes, int axisLogic, bool movesRobot = false)
Parameters
 Type |  Name |  Description
 string |  name
The axis name.
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation vector.
 Interval |  axisLimits
The motion limits.
 IList<Mesh> |  baseMeshes
The base mesh.
 IList<Mesh> |  linkMeshes
The link mesh posed for an external axis value set to 0.
 int |  axisLogic
The axis logic number.
 bool |  movesRobot
Specifies whether the external axis moves a robot.
ExternalRotationalAxis(string, Plane, Interval, IList<Mesh>, IList<Mesh>, string, bool)
Initializes a new instance of the External Rotational Axis class.
Declaration
public ExternalRotationalAxis(string name, Plane axisPlane, Interval axisLimits, IList<Mesh> baseMeshes, IList<Mesh> linkMeshes, string axisLogic, bool movesRobot = false)
Parameters
 Type |  Name |  Description
 string |  name
The axis name.
 Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation vector.
 Interval |  axisLimits
The motion limits.
 IList<Mesh> |  baseMeshes
The base mesh.
 IList<Mesh> |  linkMeshes
The link mesh posed for an external axis value set to 0.
 string |  axisLogic
The axis logic number.
 bool |  movesRobot
Specifies whether the external axis moves a robot.
Properties
AttachmentPlane
Gets or sets the attachment plane to attach a robot or work object.
Declaration
public override Plane AttachmentPlane { get; set; }
Property Value
 Type |  Description
 Plane
Overrides
ExternalAxis.AttachmentPlane
AxisLimits
Gets or sets the axis limits in degrees.
Declaration
public override Interval AxisLimits { get; set; }
Property Value
 Type |  Description
 Interval
Overrides
ExternalAxis.AxisLimits
AxisLogic
Gets the axis logic as a char (-, A, B, C, D, E, F).
Declaration
public override char AxisLogic { get; set; }
Property Value
 Type |  Description
 char
Overrides
ExternalAxis.AxisLogic
AxisNumber
Gets or sets the axis logic as a number (-1, 0, 1, 2, 3, 4, 5).
Declaration
public override int AxisNumber { get; set; }
Property Value
 Type |  Description
 int
Overrides
ExternalAxis.AxisNumber
AxisPlane
Gets or sets the axis plane.
Declaration
public override Plane AxisPlane { get; set; }
Property Value
 Type |  Description
 Plane
Overrides
ExternalAxis.AxisPlane
AxisType
Gets the Axis Type.
Declaration
public override AxisType AxisType { get; }
Property Value
 Type |  Description
 AxisType
Overrides
ExternalAxis.AxisType
BaseMesh
Gets or sets the fixed base mesh of the external axis.
Declaration
public override Mesh BaseMesh { get; set; }
Property Value
 Type |  Description
 Mesh
Overrides
ExternalAxis.BaseMesh
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public override bool IsValid { get; }
Property Value
 Type |  Description
 bool
Overrides
ExternalAxis.IsValid
LinkMesh
Gets or sets the movable link mesh of the external axis posed for external axis value set to 0.
Declaration
public override Mesh LinkMesh { get; set; }
Property Value
 Type |  Description
 Mesh
Overrides
ExternalAxis.LinkMesh
MovesRobot
Gets or sets a value indicating whether or not this External Rotational Axis moves the Robot.
Declaration
public override bool MovesRobot { get; set; }
Property Value
 Type |  Description
 bool
Overrides
ExternalAxis.MovesRobot
Name
Gets or sets the external axis name.
Declaration
public override string Name { get; set; }
Property Value
 Type |  Description
 string
Overrides
ExternalAxis.Name
NumberOfAxes
Gets the number of axes for the mechanical unit.
Declaration
public override int NumberOfAxes { get; }
Property Value
 Type |  Description
 int
Overrides
ExternalAxis.NumberOfAxes
PosedMeshes
Gets latest calculated posed axis meshes.
Declaration
public override List<Mesh> PosedMeshes { get; }
Property Value
 Type |  Description
 List<Mesh>
Overrides
ExternalAxis.PosedMeshes
Methods
CalculatePosition(ExternalJointPosition, out bool)
Returns the position of the attachment plane for a given External Joint Position. This calculation does not take into account the axis limits.
Declaration
public override Plane CalculatePosition(ExternalJointPosition externalJointPosition, out bool inLimits)
Parameters
 Type |  Name |  Description
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
 bool |  inLimits
Specifies whether the External Joint Position is inside its limits.
Returns
 Type |  Description
 Plane
The posed attachement plane.
Overrides
ExternalAxis.CalculatePosition(ExternalJointPosition, out bool)
CalculatePositionSave(ExternalJointPosition)
Returns the position of the attachment plane for a given External Joint Position. This calculations takes into account the external axis limits. If the defined External Joint Posiiton is outside its limits the closest valid external axis value will be used.
Declaration
public override Plane CalculatePositionSave(ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Returns
 Type |  Description
 Plane
The posed attachement plane.
Overrides
ExternalAxis.CalculatePositionSave(ExternalJointPosition)
CalculateTransformationMatrix(ExternalJointPosition, out bool)
Returns the the transformation matrix for a given External Joint Position. This calculation does not take into account the axis limits.
Declaration
public override Transform CalculateTransformationMatrix(ExternalJointPosition externalJointPosition, out bool inLimits)
Parameters
 Type |  Name |  Description
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
 bool |  inLimits
Specifies whether the External Joint Position is inside its limits.
Returns
 Type |  Description
 Transform
The transformation matrix.
Overrides
ExternalAxis.CalculateTransformationMatrix(ExternalJointPosition, out bool)
CalculateTransformationMatrixSave(ExternalJointPosition)
Returns the the transformation matrix for a given External Joint Position. This calculations takes into account the external axis limits. If the defined External Joint Posiiton is outside its limits the closest valid external axis value will be used.
Declaration
public override Transform CalculateTransformationMatrixSave(ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Returns
 Type |  Description
 Transform
The transformation matrix.
Overrides
ExternalAxis.CalculateTransformationMatrixSave(ExternalJointPosition)
Duplicate()
Returns an exact duplicate of this External Rotational Axis instance.
Declaration
public ExternalRotationalAxis Duplicate()
Returns
 Type |  Description
 ExternalRotationalAxis
A deep copy of the External Rotational Axis instance.
DuplicateExternalAxis()
Returns an exact duplicate of this External Rotational Axis instance as an External Axis.
Declaration
public override ExternalAxis DuplicateExternalAxis()
Returns
 Type |  Description
 ExternalAxis
A deep copy of the External Rotational Axis instance as an External Axis.
Overrides
ExternalAxis.DuplicateExternalAxis()
DuplicateExternalAxisWithoutMesh()
Returns an exact duplicate of this External Rotational Axis instance as an External Axis without meshes.
Declaration
public override ExternalAxis DuplicateExternalAxisWithoutMesh()
Returns
 Type |  Description
 ExternalAxis
A deep copy of the External Rotational Axis instance as an External Axis without meshes.
Overrides
ExternalAxis.DuplicateExternalAxisWithoutMesh()
DuplicateMechanicalUnit()
Returns an exact duplicate of this External Rotational Axis as a Mechanical Unit.
Declaration
public override IMechanicalUnit DuplicateMechanicalUnit()
Returns
 Type |  Description
 IMechanicalUnit
A deep copy of the Mechanical Unit.
Overrides
ExternalAxis.DuplicateMechanicalUnit()
DuplicateMechanicalUnitWithoutMesh()
Returns an exact duplicate of this External Rotational Axis as Mechanical Unit without meshes.
Declaration
public override IMechanicalUnit DuplicateMechanicalUnitWithoutMesh()
Returns
 Type |  Description
 IMechanicalUnit
A deep copy of the Mechanical Unit without meshes.
Overrides
ExternalAxis.DuplicateMechanicalUnitWithoutMesh()
DuplicateWithoutMesh()
Returns an exact duplicate of this External Rotational Axis instance without meshes.
Declaration
public ExternalRotationalAxis DuplicateWithoutMesh()
Returns
 Type |  Description
 ExternalRotationalAxis
A deep copy of the External Rotational Axis instance without meshes.
GetBoundingBox(bool)
Returns the Bounding Box of the object.
Declaration
public override BoundingBox GetBoundingBox(bool accurate)
Parameters
 Type |  Name |  Description
 bool |  accurate
If true, a physically accurate bounding box will be computed. If not, a bounding box estimate will be computed.
Returns
 Type |  Description
 BoundingBox
The Bounding Box.
Overrides
ExternalAxis.GetBoundingBox(bool)
GetObjectData(SerializationInfo, StreamingContext)
Populates a SerializationInfo with the data needed to serialize the object.
Declaration
public void GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 SerializationInfo |  info
The SerializationInfo to populate with data.
 StreamingContext |  context
The destination for this serialization.
PoseMeshes(ExternalJointPosition)
Calculates and returns the position of the external axis meshes for a given External Joint Position.
Declaration
public override List<Mesh> PoseMeshes(ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Returns
 Type |  Description
 List<Mesh>
The posed meshes.
Overrides
ExternalAxis.PoseMeshes(ExternalJointPosition)
PoseMeshes(JointTarget)
Calculates and returns the position of the meshes for a given Joint Target.
Declaration
public override List<Mesh> PoseMeshes(JointTarget jointTarget)
Parameters
 Type |  Name |  Description
 JointTarget |  jointTarget
The Joint Target.
Returns
 Type |  Description
 List<Mesh>
The posed meshes.
Overrides
ExternalAxis.PoseMeshes(JointTarget)
ReInitialize()
Reinitializes the fields and properties to construct a valid External Rotational Axis instance.
Declaration
public override void ReInitialize()
Overrides
ExternalAxis.ReInitialize()
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 string
A string that represents the current object.
Overrides
ExternalAxis.ToString()
Transform(Transform)
Transforms the external rotational axis spatial properties (planes and meshes).
Declaration
public override void Transform(Transform xform)
Parameters
 Type |  Name |  Description
 Transform |  xform
Spatial deform.
Overrides
ExternalAxis.Transform(Transform)
Implements
 System.Runtime.Serialization.ISerializable
 IMechanicalUnit