Show / Hide Table of Contents
Interface IMechanicalUnit
Represent the interface of mechanical units
Namespace: RobotComponents.ABB.Definitions
Assembly: RobotComponents.ABB.dll
Syntax
public interface IMechanicalUnit
Properties
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
bool IsValid { get; }
Property Value
 Type |  Description
 bool
Name
Gets or sets the external axis name.
Declaration
string Name { get; set; }
Property Value
 Type |  Description
 string
NumberOfAxes
Gets the number of axes for the mechanical unit.
Declaration
int NumberOfAxes { get; }
Property Value
 Type |  Description
 int
Methods
DuplicateMechanicalUnit()
Returns an exact duplicate of this Mechanical Unit.
Declaration
IMechanicalUnit DuplicateMechanicalUnit()
Returns
 Type |  Description
 IMechanicalUnit
A deep copy of the Mechanical Unit.
DuplicateMechanicalUnitWithoutMesh()
Returns an exact duplicate of this Mechanical Unit without meshes.
Declaration
IMechanicalUnit DuplicateMechanicalUnitWithoutMesh()
Returns
 Type |  Description
 IMechanicalUnit
A deep copy of the Mechanical Unit without meshes.
GetBoundingBox(bool)
Returns the Bounding Box of the object.
Declaration
BoundingBox GetBoundingBox(bool accurate)
Parameters
 Type |  Name |  Description
 bool |  accurate
If true, a physically accurate bounding box will be computed. If not, a bounding box estimate will be computed.
Returns
 Type |  Description
 BoundingBox
The Bounding Box.
PoseMeshes(JointTarget)
Calculates and returns the position of the meshes for a given Joint Target.
Declaration
List<Mesh> PoseMeshes(JointTarget jointTarget)
Parameters
 Type |  Name |  Description
 JointTarget |  jointTarget
The Joint Target.
Returns
 Type |  Description
 List<Mesh>
The posed meshes.
ToString()
Returns a string that represents the current object.
Declaration
string ToString()
Returns
 Type |  Description
 string
A string that represents the current object.
Transform(Transform)
Transforms the external axis spatial properties (planes and meshes).
Declaration
void Transform(Transform xform)
Parameters
 Type |  Name |  Description
 Transform |  xform
The spatial deform.