Show / Hide Table of Contents
Class MeshPreperation
Represents serialization methods
Inheritance
object
MeshPreperation
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Namespace: RobotComponents.Utils
Assembly: RobotComponents.dll
Syntax
public static class MeshPreperation
Methods
Reduce(Mesh, int)
Returns a reduced mesh.
Declaration
public static Mesh Reduce(Mesh mesh, int count = 5000)
Parameters
 Type |  Name |  Description
 Mesh |  mesh
The mesh.
 int |  count
The desired polygon count.
Returns
 Type |  Description
 Mesh
The reduced mesh.
Remarks
Used for constructing robot and external axis meshes.
Repair(Mesh, double, bool)
Returns a repaired mesh. Makes a duplicate of the orignal mesh. Heals the naked edges, culls degenerate faces and unifies the normals.  Used for repairing robot and external axes meshes.
Declaration
public static Mesh Repair(Mesh mesh, double tolerance = 0.25, bool duplicate = false)
Parameters
 Type |  Name |  Description
 Mesh |  mesh
The mesh to repair.
 double |  tolerance
The tolerance for the naked edges.
 bool |  duplicate
Indicates whether or not, the mesh should be duplicated first.
Returns
 Type |  Description
 Mesh
The repaired mesh.