Show / Hide Table of Contents
Class Robot
Represents a 6-axis spherical Robot.
Inheritance
System.Object
Robot
Implements
System.Runtime.Serialization.ISerializable
IMechanicalUnit
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions
Assembly: RobotComponents.dll
Syntax
public class Robot : ISerializable, IMechanicalUnit
Constructors
Robot()
Initializes an empty instance of the Robot class.
Declaration
public Robot()
Robot(Robot, Boolean)
Initializes a new instance of the Robot class by duplicating an existing Robot instance.
Declaration
public Robot(Robot robot, bool duplicateMesh = true)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot instance to duplicate.
 System.Boolean |  duplicateMesh
Specifies whether the meshes should be duplicated.
Robot(SerializationInfo, StreamingContext)
Protected constructor needed for deserialization of the object.
Declaration
protected Robot(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 System.Runtime.Serialization.SerializationInfo |  info
The SerializationInfo to extract the data from.
 System.Runtime.Serialization.StreamingContext |  context
The context of this deserialization.
Robot(String, IList<Mesh>, IList<Plane>, IList<Interval>, Plane, Plane, RobotTool)
Initializes a new instance of the Robot class without attached external axes.
Declaration
public Robot(string name, IList<Mesh> meshes, IList<Plane> internalAxisPlanes, IList<Interval> internalAxisLimits, Plane basePlane, Plane mountingFrame, RobotTool tool)
Parameters
 Type |  Name |  Description
 System.String |  name
The name.
 System.Collections.Generic.IList<Rhino.Geometry.Mesh> |  meshes
The base and links meshes defined in the world coorindate space.
 System.Collections.Generic.IList<Rhino.Geometry.Plane> |  internalAxisPlanes
The internal axes planes defined in the world coorindate space.
 System.Collections.Generic.IList<Rhino.Geometry.Interval> |  internalAxisLimits
The internal axes limit.
 Rhino.Geometry.Plane |  basePlane
The position and orientation of the robot base in the world coordinate space.
 Rhino.Geometry.Plane |  mountingFrame
The tool mounting frame definied in the world coordinate space.
 RobotTool |  tool
The Robot Tool.
Robot(String, IList<Mesh>, IList<Plane>, IList<Interval>, Plane, Plane, RobotTool, IList<ExternalAxis>)
Initializes a new instance of the Robot class with attached external axes.
Declaration
public Robot(string name, IList<Mesh> meshes, IList<Plane> internalAxisPlanes, IList<Interval> internalAxisLimits, Plane basePlane, Plane mountingFrame, RobotTool tool, IList<ExternalAxis> externalAxes)
Parameters
 Type |  Name |  Description
 System.String |  name
The name.
 System.Collections.Generic.IList<Rhino.Geometry.Mesh> |  meshes
The base and links meshes defined in the world coorindate space.
 System.Collections.Generic.IList<Rhino.Geometry.Plane> |  internalAxisPlanes
The internal axes planes defined in the world coorindate space.
 System.Collections.Generic.IList<Rhino.Geometry.Interval> |  internalAxisLimits
The internal axes limit.
 Rhino.Geometry.Plane |  basePlane
The position and orientation of the robot base in the world coordinate space.
 Rhino.Geometry.Plane |  mountingFrame
The tool mounting frame definied in the world coordinate space.
 RobotTool |  tool
The Robot Tool.
 System.Collections.Generic.IList<ExternalAxis> |  externalAxes
The attached external axes.
Properties
BasePlane
Gets or sets the position and orientation of the robot in world coordinate space.
Declaration
public Plane BasePlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
ExternalAxes
Gets or sets the attached external axes.
Declaration
public List<ExternalAxis> ExternalAxes { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ExternalAxis>
ExternalAxisLimits
Gets the external axis limits.
Declaration
public List<Interval> ExternalAxisLimits { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Interval>
ExternalAxisPlanes
Gets the external axis planes.
Declaration
public List<Plane> ExternalAxisPlanes { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Plane>
ForwardKinematics
Gets the Forward Kinimatics of this Robot.
Declaration
public ForwardKinematics ForwardKinematics { get; }
Property Value
 Type |  Description
 ForwardKinematics
InternalAxisLimits
Gets or sets the axis limits in degrees.
Declaration
public List<Interval> InternalAxisLimits { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Interval>
InternalAxisPlanes
Gets or sets the internal axis planes. The Z-axes of the planes define the rotation centers.
Declaration
public List<Plane> InternalAxisPlanes { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Plane>
InverseKinematics
Gets the Inverse Kinematics of this Robot.
Declaration
public InverseKinematics InverseKinematics { get; }
Property Value
 Type |  Description
 InverseKinematics
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
Meshes
Gets the Robot meshes including the mesh of the attached tool.
Declaration
public List<Mesh> Meshes { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
MountingFrame
Gets or sets the tool mounting frame in world coordinate space.
Declaration
public Plane MountingFrame { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Name
Gets or sets the name of the Robot.
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
NumberOfAxes
Gets the number of axes for the mechanical unit.
Declaration
public int NumberOfAxes { get; }
Property Value
 Type |  Description
 System.Int32
Tool
Gets or sets the Robot Tool.
Declaration
public RobotTool Tool { get; set; }
Property Value
 Type |  Description
 RobotTool
ToolPlane
Gets the TCP plane in world coordinate space.
Declaration
public Plane ToolPlane { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Methods
CalculateAttachedToolPlane()
Calculates and returns the TCP plane of the attached Robot Tool in robot coordinate space.
Declaration
public Plane CalculateAttachedToolPlane()
Returns
 Type |  Description
 Rhino.Geometry.Plane
The TCP plane in robot coordinate space.
Duplicate()
Returns an exact duplicate of this Robot instance.
Declaration
public Robot Duplicate()
Returns
 Type |  Description
 Robot
A deep copy of the Robot instance.
DuplicateMechanicalUnit()
Returns an exact duplicate of this Robot as a Mechanical Unit.
Declaration
public IMechanicalUnit DuplicateMechanicalUnit()
Returns
 Type |  Description
 IMechanicalUnit
A deep copy of the Mechanical Unit.
DuplicateMechanicalUnitWithoutMesh()
Returns an exact duplicate of this Robot as Mechanical Unit without meshes.
Declaration
public IMechanicalUnit DuplicateMechanicalUnitWithoutMesh()
Returns
 Type |  Description
 IMechanicalUnit
A deep copy of the Mechanical Unit without meshes.
GetAttachedToolMesh()
Returns the attached Robot Tool mesh in robot coordinate space.
Declaration
public Mesh GetAttachedToolMesh()
Returns
 Type |  Description
 Rhino.Geometry.Mesh
The tool mesh in the robot coordinate space.
GetBoundingBox(Boolean)
Returns the Bounding Box of the object.
Declaration
public BoundingBox GetBoundingBox(bool accurate)
Parameters
 Type |  Name |  Description
 System.Boolean |  accurate
If true, a physically accurate bounding box will be computed. If not, a bounding box estimate will be computed.
Returns
 Type |  Description
 Rhino.Geometry.BoundingBox
The Bounding Box.
GetObjectData(SerializationInfo, StreamingContext)
Populates a SerializationInfo with the data needed to serialize the object.
Declaration
public void GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 System.Runtime.Serialization.SerializationInfo |  info
The SerializationInfo to populate with data.
 System.Runtime.Serialization.StreamingContext |  context
The destination for this serialization.
GetRobotPreset(RobotPreset, Plane, RobotTool, IList<ExternalAxis>)
Returns a predefined ABB Robot preset.
Declaration
public static Robot GetRobotPreset(RobotPreset preset, Plane positionPlane, RobotTool tool, IList<ExternalAxis> externalAxes = null)
Parameters
 Type |  Name |  Description
 RobotPreset |  preset
The Robot preset type.
 Rhino.Geometry.Plane |  positionPlane
The position and orientation of the Robot in world coordinate space.
 RobotTool |  tool
The Robot Tool.
 System.Collections.Generic.IList<ExternalAxis> |  externalAxes
The external axes attached to the Robot.
Returns
 Type |  Description
 Robot
PoseMeshes(JointTarget)
Calculates and returns the position of the meshes for a given Joint Target.
Declaration
public List<Mesh> PoseMeshes(JointTarget jointTarget)
Parameters
 Type |  Name |  Description
 JointTarget |  jointTarget
The Joint Target.
Returns
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
The posed meshes.
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
System.Object.ToString()
Transfom(Transform)
Transforms the robot spatial properties (planes and meshes). NOTE: The attached external axes will not be transformed.
Declaration
[Obsolete("This method is OBSOLETE and will be removed in version 2.", false)]
public void Transfom(Transform xform)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Transform |  xform
Spatial deform.
Transform(Transform)
Transforms the robot spatial properties (planes and meshes). NOTE: The attached external axes will not be transformed.
Declaration
public void Transform(Transform xform)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Transform |  xform
Spatial deform.
Implements
 System.Runtime.Serialization.ISerializable
 IMechanicalUnit