Show / Hide Table of Contents
Class IRB1300_11_090
Represents a collection of methods to get the IRB1300-11/0.90 Robot instance.
Inheritance
object
IRB1300_11_090
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Namespace: RobotComponents.ABB.Presets.Robots
Assembly: RobotComponents.ABB.Presets.dll
Syntax
public static class IRB1300_11_090
Methods
GetAxisLimits()
Returns the list with axis limits.
Declaration
public static List<Interval> GetAxisLimits()
Returns
 Type |  Description
 List<Interval>
The list with axis limits.
GetAxisPlanes()
Returns the list with the axis planes in robot coordinate space.
Declaration
public static List<Plane> GetAxisPlanes()
Returns
 Type |  Description
 List<Plane>
The list with axis planes.
GetMeshes()
Returns the list with the base and link meshes of the robot in robot coordinate space.
Declaration
public static List<Mesh> GetMeshes()
Returns
 Type |  Description
 List<Mesh>
The list with robot meshes.
GetRobot(Plane, RobotTool, IList<IExternalAxis>)
Returns a new IRB1300-11/0.90 Robot instance.
Declaration
public static Robot GetRobot(Plane positionPlane, RobotTool tool = null, IList<IExternalAxis> externalAxes = null)
Parameters
 Type |  Name |  Description
 Plane |  positionPlane
The position and orientation of the Robot in world coordinate space.
 RobotTool |  tool
The Robot Tool.
 IList<IExternalAxis> |  externalAxes
The external axes attached to the Robot.
Returns
 Type |  Description
 Robot
The Robot preset.
GetToolMountingFrame()
Returns the tool mounting frame in robot coordinate space.
Declaration
public static Plane GetToolMountingFrame()
Returns
 Type |  Description
 Plane
The tool mounting frame.