Show / Hide Table of Contents
Class Robot
Represents a 6-axis spherical Robot.
Inheritance
object
Robot
Implements
ISerializable
IMechanicalUnit
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Namespace: RobotComponents.ABB.Definitions
Assembly: RobotComponents.ABB.dll
Syntax
public class Robot : ISerializable, IMechanicalUnit
Constructors
Robot()
Initializes an empty instance of the Robot class.
Declaration
public Robot()
Robot(Robot, bool)
Initializes a new instance of the Robot class by duplicating an existing Robot instance.
Declaration
public Robot(Robot robot, bool duplicateMesh = true)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot instance to duplicate.
 bool |  duplicateMesh
Specifies whether the meshes should be duplicated.
Robot(SerializationInfo, StreamingContext)
Protected constructor needed for deserialization of the object.
Declaration
protected Robot(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 SerializationInfo |  info
The SerializationInfo to extract the data from.
 StreamingContext |  context
The context of this deserialization.
Robot(string, IList<Mesh>, IList<Plane>, IList<Interval>, Plane, Plane, RobotTool)
Initializes a new instance of the Robot class without attached external axes.
Declaration
public Robot(string name, IList<Mesh> meshes, IList<Plane> internalAxisPlanes, IList<Interval> internalAxisLimits, Plane basePlane, Plane mountingFrame, RobotTool tool)
Parameters
 Type |  Name |  Description
 string |  name
The name.
 IList<Mesh> |  meshes
The base and links meshes defined in the world coorindate space.
 IList<Plane> |  internalAxisPlanes
The internal axes planes defined in the world coorindate space.
 IList<Interval> |  internalAxisLimits
The internal axes limit.
 Plane |  basePlane
The position and orientation of the robot base in the world coordinate space.
 Plane |  mountingFrame
The tool mounting frame definied in the world coordinate space.
 RobotTool |  tool
The Robot Tool.
Robot(string, IList<Mesh>, IList<Plane>, IList<Interval>, Plane, Plane, RobotTool, IList<ExternalAxis>)
Initializes a new instance of the Robot class with attached external axes.
Declaration
public Robot(string name, IList<Mesh> meshes, IList<Plane> internalAxisPlanes, IList<Interval> internalAxisLimits, Plane basePlane, Plane mountingFrame, RobotTool tool, IList<ExternalAxis> externalAxes)
Parameters
 Type |  Name |  Description
 string |  name
The name.
 IList<Mesh> |  meshes
The base and links meshes defined in the world coorindate space.
 IList<Plane> |  internalAxisPlanes
The internal axes planes defined in the world coorindate space.
 IList<Interval> |  internalAxisLimits
The internal axes limit.
 Plane |  basePlane
The position and orientation of the robot base in the world coordinate space.
 Plane |  mountingFrame
The tool mounting frame definied in the world coordinate space.
 RobotTool |  tool
The Robot Tool.
 IList<ExternalAxis> |  externalAxes
The attached external axes.
Properties
A1
Gets the OPW kinematics parameter A1.
Declaration
public double A1 { get; }
Property Value
 Type |  Description
 double
A2
Gets the OPW kinematics parameter A2.
Declaration
public double A2 { get; }
Property Value
 Type |  Description
 double
B
Gets the OPW kinematics parameter B.
Declaration
public double B { get; }
Property Value
 Type |  Description
 double
BasePlane
Gets or sets the position and orientation of the robot in world coordinate space.
Declaration
public Plane BasePlane { get; set; }
Property Value
 Type |  Description
 Plane
C1
Gets the OPW kinematics parameter C1.
Declaration
public double C1 { get; }
Property Value
 Type |  Description
 double
C2
Gets the OPW kinematics parameter C2.
Declaration
public double C2 { get; }
Property Value
 Type |  Description
 double
C3
Gets the OPW kinematics parameter C3.
Declaration
public double C3 { get; }
Property Value
 Type |  Description
 double
C4
Gets the OPW kinematics parameter C4.
Declaration
public double C4 { get; }
Property Value
 Type |  Description
 double
ElbowLength
Gets the total length of the elbow.
Declaration
public double ElbowLength { get; }
Property Value
 Type |  Description
 double
ExternalAxes
Gets or sets the attached external axes.
Declaration
public List<ExternalAxis> ExternalAxes { get; set; }
Property Value
 Type |  Description
 List<ExternalAxis>
ExternalAxisLimits
Gets the external axis limits.
Declaration
public List<Interval> ExternalAxisLimits { get; }
Property Value
 Type |  Description
 List<Interval>
ExternalAxisPlanes
Gets the external axis planes.
Declaration
public List<Plane> ExternalAxisPlanes { get; }
Property Value
 Type |  Description
 List<Plane>
ForwardKinematics
Gets the Forward Kinimatics of this Robot.
Declaration
public ForwardKinematics ForwardKinematics { get; }
Property Value
 Type |  Description
 ForwardKinematics
InternalAxisLimits
Gets or sets the axis limits in degrees.
Declaration
public List<Interval> InternalAxisLimits { get; set; }
Property Value
 Type |  Description
 List<Interval>
InternalAxisPlanes
Gets or sets the internal axis planes.
Declaration
public List<Plane> InternalAxisPlanes { get; set; }
Property Value
 Type |  Description
 List<Plane>
Remarks
The Z-axes of the planes define the rotation centers.
InverseKinematics
Gets the Inverse Kinematics of this Robot.
Declaration
public InverseKinematics InverseKinematics { get; }
Property Value
 Type |  Description
 InverseKinematics
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public bool IsValid { get; }
Property Value
 Type |  Description
 bool
LowerArmLength
Gets the length of the lower arm.
Declaration
public double LowerArmLength { get; }
Property Value
 Type |  Description
 double
The length of the lower arm.
Meshes
Gets the Robot meshes including the mesh of the attached tool.
Declaration
public List<Mesh> Meshes { get; }
Property Value
 Type |  Description
 List<Mesh>
MountingFrame
Gets or sets the tool mounting frame in world coordinate space.
Declaration
public Plane MountingFrame { get; set; }
Property Value
 Type |  Description
 Plane
Name
Gets or sets the name of the Robot.
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 string
NumberOfAxes
Gets the number of axes for the mechanical unit.
Declaration
public int NumberOfAxes { get; }
Property Value
 Type |  Description
 int
Tool
Gets or sets the Robot Tool.
Declaration
public RobotTool Tool { get; set; }
Property Value
 Type |  Description
 RobotTool
ToolPlane
Gets the TCP plane in world coordinate space.
Declaration
public Plane ToolPlane { get; }
Property Value
 Type |  Description
 Plane
UpperArmLength
Gets the length of the upper arm.
Declaration
public double UpperArmLength { get; }
Property Value
 Type |  Description
 double
The length of the upper arm.
WristOffset
Gets the wrist offset.
Declaration
public Point3d WristOffset { get; }
Property Value
 Type |  Description
 Point3d
Methods
CalculateAttachedToolPlane()
Calculates and returns the TCP plane of the attached Robot Tool in robot coordinate space.
Declaration
public Plane CalculateAttachedToolPlane()
Returns
 Type |  Description
 Plane
The TCP plane in robot coordinate space.
Duplicate()
Returns an exact duplicate of this Robot instance.
Declaration
public Robot Duplicate()
Returns
 Type |  Description
 Robot
A deep copy of the Robot instance.
DuplicateMechanicalUnit()
Returns an exact duplicate of this Robot as a Mechanical Unit.
Declaration
public IMechanicalUnit DuplicateMechanicalUnit()
Returns
 Type |  Description
 IMechanicalUnit
A deep copy of the Mechanical Unit.
DuplicateMechanicalUnitWithoutMesh()
Returns an exact duplicate of this Robot as Mechanical Unit without meshes.
Declaration
public IMechanicalUnit DuplicateMechanicalUnitWithoutMesh()
Returns
 Type |  Description
 IMechanicalUnit
A deep copy of the Mechanical Unit without meshes.
GetAttachedToolMesh()
Returns the attached Robot Tool mesh in robot coordinate space.
Declaration
public Mesh GetAttachedToolMesh()
Returns
 Type |  Description
 Mesh
The tool mesh in the robot coordinate space.
GetBoundingBox(bool)
Returns the Bounding Box of the object.
Declaration
public BoundingBox GetBoundingBox(bool accurate)
Parameters
 Type |  Name |  Description
 bool |  accurate
If true, a physically accurate bounding box will be computed. If not, a bounding box estimate will be computed.
Returns
 Type |  Description
 BoundingBox
The Bounding Box.
GetObjectData(SerializationInfo, StreamingContext)
Populates a SerializationInfo with the data needed to serialize the object.
Declaration
public void GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 SerializationInfo |  info
The SerializationInfo to populate with data.
 StreamingContext |  context
The destination for this serialization.
PoseMeshes(JointTarget)
Calculates and returns the position of the meshes for a given Joint Target.
Declaration
public List<Mesh> PoseMeshes(JointTarget jointTarget)
Parameters
 Type |  Name |  Description
 JointTarget |  jointTarget
The Joint Target.
Returns
 Type |  Description
 List<Mesh>
The posed meshes.
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 string
A string that represents the current object.
Overrides
object.ToString()
Transform(Transform)
Transforms the robot spatial properties (planes and meshes).
Declaration
public void Transform(Transform xform)
Parameters
 Type |  Name |  Description
 Transform |  xform
Spatial deform.
Remarks
The attached external axes will not be transformed.
Implements
 System.Runtime.Serialization.ISerializable
 IMechanicalUnit