Show / Hide Table of Contents
Class RobotTarget
Represents the Robot Target declaration.
Inheritance
object
Action
RobotTarget
Implements
ITarget
IDeclaration
ISerializable
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Namespace: RobotComponents.ABB.Actions.Declarations
Assembly: RobotComponents.ABB.dll
Syntax
public class RobotTarget : Action, ITarget, IDeclaration, ISerializable
Remarks
This action is used to define the pose of the robot and the external axes.
Constructors
RobotTarget()
Initializes an empty instance of the Robot Target class.
Declaration
public RobotTarget()
RobotTarget(Plane)
Initializes a new instance of the Robot Target class with an axis conguration set to zero and an undefined External Joint Position.
Declaration
public RobotTarget(Plane plane)
Parameters
 Type |  Name |  Description
 Plane |  plane
The target plane.
RobotTarget(Plane, Plane, int)
Initializes a new instance of the Robot Target class with an undefined Extenal Joint Position.
Declaration
[Obsolete("This constructor is obsolete and will be removed in v3.", false)]
public RobotTarget(Plane plane, Plane referencePlane, int axisConfig)
Parameters
 Type |  Name |  Description
 Plane |  plane
The target plane.
 Plane |  referencePlane
The reference plane.
 int |  axisConfig
The axis configuration as a number (0-7).
Remarks
The target plane will be reoriented from the reference plane to the world xy-plane.
RobotTarget(Plane, Plane, int, ExternalJointPosition)
Initializes a new instance of the Robot Target class.
Declaration
[Obsolete("This constructor is obsolete and will be removed in v3.", false)]
public RobotTarget(Plane plane, Plane referencePlane, int axisConfig, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 Plane |  plane
The target plane.
 Plane |  referencePlane
The Reference plane.
 int |  axisConfig
The axis configuration as a number (0-7).
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Remarks
The target plane will be reoriented from the reference plane to the world xy-plane.
RobotTarget(Plane, int)
Initializes a new instance of the Robot Target class with an undefined External Joint Position.
Declaration
[Obsolete("This constructor is obsolete and will be removed in v3.", false)]
public RobotTarget(Plane plane, int axisConfig)
Parameters
 Type |  Name |  Description
 Plane |  plane
Thr target plane.
 int |  axisConfig
The axis configuration as a number (0-7).
RobotTarget(Plane, int, ExternalJointPosition)
Initializes a new instance of the Robot Target class.
Declaration
[Obsolete("This constructor is obsolete and will be removed in v3.", false)]
public RobotTarget(Plane plane, int axisConfig, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 Plane |  plane
The target plane.
 int |  axisConfig
The axis configuration as a number (0-7).
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
RobotTarget(RobotTarget)
Initializes a new instance of the Robot Target class by duplicating an existing Robot Target instance.
Declaration
public RobotTarget(RobotTarget target)
Parameters
 Type |  Name |  Description
 RobotTarget |  target
The Robot Target instance to duplicate.
RobotTarget(SerializationInfo, StreamingContext)
Protected constructor needed for deserialization of the object.
Declaration
protected RobotTarget(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 SerializationInfo |  info
The SerializationInfo to extract the data from.
 StreamingContext |  context
The context of this deserialization.
RobotTarget(string, Plane)
Initializes a new instance of the Robot Target class with an axis conguration set to zero and an undefined External Joint Position.
Declaration
public RobotTarget(string name, Plane plane)
Parameters
 Type |  Name |  Description
 string |  name
The target name, must be unique.
 Plane |  plane
The target plane.
RobotTarget(string, Plane, Plane, ConfigurationData, ExternalJointPosition)
Initializes a new instance of the Robot Target class.
Declaration
public RobotTarget(string name, Plane plane, Plane referencePlane, ConfigurationData configurationData, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 string |  name
The target name, must be unique.
 Plane |  plane
The target plane.
 Plane |  referencePlane
The Reference plane.
 ConfigurationData |  configurationData
The Configuration Data.
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Remarks
The target plane will be reoriented from the reference plane to the world xy-plane.
RobotTarget(string, Plane, Plane, int)
Initializes a new instance of the Robot Target class with an undefined Extenal Joint Position..
Declaration
[Obsolete("This constructor is obsolete and will be removed in v3.", false)]
public RobotTarget(string name, Plane plane, Plane referencePlane, int axisConfig)
Parameters
 Type |  Name |  Description
 string |  name
The target name, must be unique.
 Plane |  plane
The target plane.
 Plane |  referencePlane
The reference plane.
 int |  axisConfig
The axis configuration as a number (0-7).
Remarks
The target plane will be reoriented from the reference plane to the world xy-plane.
RobotTarget(string, Plane, Plane, int, ExternalJointPosition)
Initializes a new instance of the Robot Target class.
Declaration
[Obsolete("This constructor is obsolete and will be removed in v3.", false)]
public RobotTarget(string name, Plane plane, Plane referencePlane, int axisConfig, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 string |  name
The target name, must be unique.
 Plane |  plane
The target plane.
 Plane |  referencePlane
The Reference plane.
 int |  axisConfig
The axis configuration as a number (0-7).
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Remarks
The target plane will be reoriented from the reference plane to the world xy-plane.
RobotTarget(string, Plane, ConfigurationData, ExternalJointPosition)
Initializes a new instance of the Robot Target class.
Declaration
public RobotTarget(string name, Plane plane, ConfigurationData configurationData, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 string |  name
The target name, must be unique.
 Plane |  plane
The target plane.
 ConfigurationData |  configurationData
The Configuration Data.
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
RobotTarget(string, Plane, int)
Initializes a new instance of the Robot Target class with an undefined External Joint Position.
Declaration
[Obsolete("This constructor is obsolete and will be removed in v3.", false)]
public RobotTarget(string name, Plane plane, int axisConfig)
Parameters
 Type |  Name |  Description
 string |  name
The target name, must be unique.
 Plane |  plane
Thr target plane.
 int |  axisConfig
The axis configuration as a number (0-7).
RobotTarget(string, Plane, int, ExternalJointPosition)
Initializes a new instance of the Robot Target class.
Declaration
[Obsolete("This constructor is obsolete and will be removed in v3.", false)]
public RobotTarget(string name, Plane plane, int axisConfig, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 string |  name
The target name, must be unique.
 Plane |  plane
The target plane.
 int |  axisConfig
The axis configuration as a number (0-7).
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Properties
AxisConfig
Gets or set the axis configuration.
Declaration
[Obsolete("This property is obsolete and will be removed in v3. Use ConfigurationData instead.", false)]
public int AxisConfig { get; set; }
Property Value
 Type |  Description
 int
Remarks
Min. value 0. Max. value 7.
ConfigurationData
Gets or sets the configuration data.
Declaration
public ConfigurationData ConfigurationData { get; set; }
Property Value
 Type |  Description
 ConfigurationData
Datatype
Gets the RAPID datatype.
Declaration
public string Datatype { get; }
Property Value
 Type |  Description
 string
ExternalJointPosition
Gets or sets the External Joint Position.
Declaration
public ExternalJointPosition ExternalJointPosition { get; set; }
Property Value
 Type |  Description
 ExternalJointPosition
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public override bool IsValid { get; }
Property Value
 Type |  Description
 bool
Overrides
Action.IsValid
Name
Gets or sets the Robot Target variable name.
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 string
Remarks
Each variable name has to be unique.
Plane
Gets or sets the desired position and orientation of the tool center point.
Declaration
public Plane Plane { get; set; }
Property Value
 Type |  Description
 Plane
Quat
Gets or sets the desired orientation of the tool center point.
Declaration
public Quaternion Quat { get; set; }
Property Value
 Type |  Description
 Quaternion
Scope
Gets or sets the scope.
Declaration
public Scope Scope { get; set; }
Property Value
 Type |  Description
 Scope
VariableType
Gets or sets the variable type.
Declaration
public VariableType VariableType { get; set; }
Property Value
 Type |  Description
 VariableType
Methods
Duplicate()
Returns an exact duplicate of this Robot Target instance.
Declaration
public RobotTarget Duplicate()
Returns
 Type |  Description
 RobotTarget
A deep copy of the Robot Target instance.
DuplicateAction()
Returns an exact duplicate of this Robot Target instance as an Action.
Declaration
public override Action DuplicateAction()
Returns
 Type |  Description
 Action
A deep copy of the Robot Target instance as an Action.
Overrides
Action.DuplicateAction()
DuplicateDeclaration()
Returns an exact duplicate of this Robot Target instance as an IDeclaration.
Declaration
public IDeclaration DuplicateDeclaration()
Returns
 Type |  Description
 IDeclaration
A deep copy of the Robot Target instance as an IDeclaration.
DuplicateTarget()
Returns an exact duplicate of this Robot Target instance as an ITarget.
Declaration
public ITarget DuplicateTarget()
Returns
 Type |  Description
 ITarget
A deep copy of the Robot Target instance as an ITarget.
GetObjectData(SerializationInfo, StreamingContext)
Populates a SerializationInfo with the data needed to serialize the object.
Declaration
public void GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 SerializationInfo |  info
The SerializationInfo to populate with data.
 StreamingContext |  context
The destination for this serialization.
Parse(string)
Returns a Robot Target instance constructed from a RAPID data string.
Declaration
public static RobotTarget Parse(string rapidData)
Parameters
 Type |  Name |  Description
 string |  rapidData
The RAPID data string. s
Returns
 Type |  Description
 RobotTarget
ToRAPID()
Returns the Robot Target in RAPID code format.
Declaration
public string ToRAPID()
Returns
 Type |  Description
 string
The string with robot target values.
Remarks
Example output are "[[300, 600, 250], [1, 0, 0, 0], [0, 0, 0, 1], [1000, 9E9, 9E9, 9E9, 9E9, 9E9]]", "[[300, 600, 250], [1, 0, 0, 0], [0, 0, 0, 1], extjoint1]" and "[[300, 600, 250], [1, 0, 0, 0], confdata1, extjoint1]".
ToRAPIDDeclaration(RAPIDGenerator)
Creates declarations in the RAPID program module inside the RAPID Generator.
Declaration
public override void ToRAPIDDeclaration(RAPIDGenerator RAPIDGenerator)
Parameters
 Type |  Name |  Description
 RAPIDGenerator |  RAPIDGenerator
The RAPID Generator.
Overrides
Action.ToRAPIDDeclaration(RAPIDGenerator)
Remarks
This method is called inside the RAPID generator.
ToRAPIDDeclaration(Robot)
Returns the RAPID declaration code line of the this action.
Declaration
public override string ToRAPIDDeclaration(Robot robot)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot were the code is generated for.
Returns
 Type |  Description
 string
The RAPID code line in case a variable name is defined.
Overrides
Action.ToRAPIDDeclaration(Robot)
ToRAPIDInstruction(RAPIDGenerator)
Creates instructions in the RAPID program module inside the RAPID Generator.
Declaration
public override void ToRAPIDInstruction(RAPIDGenerator RAPIDGenerator)
Parameters
 Type |  Name |  Description
 RAPIDGenerator |  RAPIDGenerator
The RAPID Generator.
Overrides
Action.ToRAPIDInstruction(RAPIDGenerator)
Remarks
This method is called inside the RAPID generator.
ToRAPIDInstruction(Robot)
Returns the RAPID instruction code line of the this action.
Declaration
public override string ToRAPIDInstruction(Robot robot)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot were the code is generated for.
Returns
 Type |  Description
 string
An emptry string.
Overrides
Action.ToRAPIDInstruction(Robot)
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 string
A string that represents the current object.
Overrides
Action.ToString()
TryParse(string, out RobotTarget)
Attempts to parse a RAPID data string into a Robot Target instance.
Declaration
public static bool TryParse(string rapidData, out RobotTarget robotTarget)
Parameters
 Type |  Name |  Description
 string |  rapidData
The RAPID data string.
 RobotTarget |  robotTarget
The Robot Target intance.
Returns
 Type |  Description
 bool
True on success, false on failure.
Implements
 ITarget
 IDeclaration
 System.Runtime.Serialization.ISerializable
Extension Methods
 HelperMethods.SetDataFromString(IDeclaration, string, out string[])