Show / Hide Table of Contents
Class WorkObject
Represents a Work Object.
Inheritance
System.Object
WorkObject
Implements
System.Runtime.Serialization.ISerializable
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions
Assembly: RobotComponents.dll
Syntax
public class WorkObject : ISerializable
Constructors
WorkObject()
Initializes a new instance of the Work Object class with the default work object wobj0.
Declaration
public WorkObject()
WorkObject(WorkObject, Boolean)
Initializes a new instance of the Work Object class by duplicating an existing Work Object instance.
Declaration
public WorkObject(WorkObject workObject, bool duplicateMesh = true)
Parameters
 Type |  Name |  Description
 WorkObject |  workObject
The Work Object instance to duplicate.
 System.Boolean |  duplicateMesh
Specifies whether the meshes should be duplicated.
WorkObject(SerializationInfo, StreamingContext)
Protected constructor needed for deserialization of the object.
Declaration
protected WorkObject(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 System.Runtime.Serialization.SerializationInfo |  info
The SerializationInfo to extract the data from.
 System.Runtime.Serialization.StreamingContext |  context
The context of this deserialization.
WorkObject(String, Plane)
Initializes a new instance of the Work Object class with a fixed work object.
Declaration
public WorkObject(string name, Plane plane)
Parameters
 Type |  Name |  Description
 System.String |  name
The work object name, must be unique.
 Rhino.Geometry.Plane |  plane
The work object coordinate system.
WorkObject(String, Plane, ExternalAxis)
Initializes a new instance of the Work Object class with a movable work object.
Declaration
public WorkObject(string name, Plane plane, ExternalAxis externalAxis)
Parameters
 Type |  Name |  Description
 System.String |  name
The work object name, must be unique.
 Rhino.Geometry.Plane |  plane
The work object coordinate system.
 ExternalAxis |  externalAxis
The coupled external axis (mechanical unit) that moves the work object.
Properties
ExternalAxis
Gets or sets the external axis (mechanical unit) with which the robot movements are coordinated. Only specified in the case of movable user coordinate systems.
Declaration
public ExternalAxis ExternalAxis { get; set; }
Property Value
 Type |  Description
 ExternalAxis
FixedFrame
Gets a value indicating whether or not a fixed user coordinate system is used. True indicates that the user frame is fixed. False indicates that the user coordinate system is movable (e.g. coordinated external axes).
Declaration
public bool FixedFrame { get; set; }
Property Value
 Type |  Description
 System.Boolean
GlobalWorkObjectPlane
Gets the global work object plane.
Declaration
public Plane GlobalWorkObjectPlane { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
Name
Gets or sets the name of the workobject.
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Orientation
Gets the Quaternion orientation of the work object coordinate system.
Declaration
public Quaternion Orientation { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Quaternion
Plane
Gets or set the work object coordinate system as a plane (e.g. the position of the current work object). The object coordinate system is defined in the user coordinate system.
Declaration
public Plane Plane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
ReferenceType
Gets or sets the Reference Type.
Declaration
public ReferenceType ReferenceType { get; set; }
Property Value
 Type |  Description
 ReferenceType
RobotHold
Gets a value indicating whether or not the robot is holding the work object.
Declaration
public bool RobotHold { get; set; }
Property Value
 Type |  Description
 System.Boolean
UserFrame
Gets or sets the user coordinate system, i.e. the position of the current work surface or fixture. If the robot is holding the tool, the user coordinate system is defined in the world coordinate system (in the wrist coordinate system if a stationary tool is used). For movable user frame (FixedFrame = false), the user frame is continuously defined by the system.
Declaration
public Plane UserFrame { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
UserFrameOrientation
Gets the Quaternion orientation of the user frame coordinate system.
Declaration
public Quaternion UserFrameOrientation { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Quaternion
Methods
CalculateGlobalWorkObjectPlane()
Calculates and returns the global work object plane.
Declaration
public Plane CalculateGlobalWorkObjectPlane()
Returns
 Type |  Description
 Rhino.Geometry.Plane
The global work object plane.
CalculateOrientation()
Calculates and returns the quaternion orientation of the work object coordinate system.
Declaration
public Quaternion CalculateOrientation()
Returns
 Type |  Description
 Rhino.Geometry.Quaternion
The quaternion orientation of the work object.
CalculateUserFrameOrientation()
Calculates and returns the quaternion orientation of the user frame coordinate system.
Declaration
public Quaternion CalculateUserFrameOrientation()
Returns
 Type |  Description
 Rhino.Geometry.Quaternion
The quaternion orientation of the user frame.
Duplicate()
Returns an exact duplicate of this Work Object instance.
Declaration
public WorkObject Duplicate()
Returns
 Type |  Description
 WorkObject
A deep copy of the Work Object instance.
DuplicateWithoutMesh()
Returns an exact duplicate of this Work Object instance without meshes.
Declaration
public WorkObject DuplicateWithoutMesh()
Returns
 Type |  Description
 WorkObject
A deep copy of the Work Object instance without meshes.
GetObjectData(SerializationInfo, StreamingContext)
Populates a SerializationInfo with the data needed to serialize the object.
Declaration
public void GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 System.Runtime.Serialization.SerializationInfo |  info
The SerializationInfo to populate with data.
 System.Runtime.Serialization.StreamingContext |  context
The destination for this serialization.
ReInitialize()
Reinitializes the fields and properties to construct a valid Work Object instance.
Declaration
public void ReInitialize()
ToRAPIDDeclaration()
Returns the RAPID declaration code line of the this Work Object.
Declaration
public string ToRAPIDDeclaration()
Returns
 Type |  Description
 System.String
The RAPID code line.
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
System.Object.ToString()
Implements
 System.Runtime.Serialization.ISerializable