Show / Hide Table of Contents
Class IRB120_3_058
Represents a collection of methods to get the IRB120-3/0.58 Robot instance.
Inheritance
System.Object
IRB120_3_058
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions.Presets
Assembly: RobotComponents.dll
Syntax
public static class IRB120_3_058
Methods
GetAxisLimits()
Returns the list with axis limits.
Declaration
public static List<Interval> GetAxisLimits()
Returns
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Interval>
The list with axis limits.
GetAxisPlanes()
Returns the list with the axis planes in robot coordinate space.
Declaration
public static List<Plane> GetAxisPlanes()
Returns
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Plane>
The list with axis planes.
GetMeshes()
Returns the list with the base and link meshes of the robot in robot coordinate space.
Declaration
public static List<Mesh> GetMeshes()
Returns
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
The list with robot meshes.
GetRobot(String, Plane, RobotTool, List<ExternalAxis>)
Returns a new IRB120-3/0.58 Robot instance.
Declaration
public static Robot GetRobot(string name, Plane positionPlane, RobotTool tool, List<ExternalAxis> externalAxes = null)
Parameters
 Type |  Name |  Description
 System.String |  name
The name of the Robot.
 Rhino.Geometry.Plane |  positionPlane
The position and orientation of the Robot in world coordinate space.
 RobotTool |  tool
The Robot Tool.
 System.Collections.Generic.List<ExternalAxis> |  externalAxes
The external axes attached to the Robot.
Returns
 Type |  Description
 Robot
The Robot preset.
GetToolMountingFrame()
Returns the tool mounting frame in robot coordinate space.
Declaration
public static Plane GetToolMountingFrame()
Returns
 Type |  Description
 Rhino.Geometry.Plane
The tool mounting frame.