Show / Hide Table of Contents
Class IRB6700_235_265
Represents a collection of methods to get the IRB6700-235/2.65 Robot instance.
Inheritance
Object
IRB6700_235_265
Inherited Members
 Object.ToString()
 Object.Equals(Object)
 Object.Equals(Object, Object)
 Object.ReferenceEquals(Object, Object)
 Object.GetHashCode()
 Object.GetType()
 Object.MemberwiseClone()
Namespace: RobotComponents.Definitions.Presets
Assembly: RobotComponents.dll
Syntax
public static class IRB6700_235_265
Methods
GetAxisLimits()
Returns the list with axis limits.
Declaration
public static List<Interval> GetAxisLimits()
Returns
 Type |  Description
 List<Interval>
The list with axis limits.
GetAxisPlanes()
Returns the list with the axis planes in robot coordinate space.
Declaration
public static List<Plane> GetAxisPlanes()
Returns
 Type |  Description
 List<Plane>
Returns a list with planes.
GetMeshes()
Defines the base and link meshes in robot coordinate space.
Declaration
public static List<Mesh> GetMeshes()
Returns
 Type |  Description
 List<Mesh>
The list with robot meshes.
GetRobot(Plane, RobotTool, IList<ExternalAxis>)
Returns a new IRB6700-235/2.65 Robot instance.
Declaration
public static Robot GetRobot(Plane positionPlane, RobotTool tool, IList<ExternalAxis> externalAxes = null)
Parameters
 Type |  Name |  Description
 Plane |  positionPlane
The position and orientation of the Robot in world coordinate space.
 RobotTool |  tool
The Robot Tool.
 IList<ExternalAxis> |  externalAxes
The external axes attached to the Robot.
Returns
 Type |  Description
 Robot
The Robot preset.
GetToolMountingFrame()
Returns the tool mounting frame in robot coordinate space.
Declaration
public static Plane GetToolMountingFrame()
Returns
 Type |  Description
 Plane
The tool mounting frame.