Show / Hide Table of Contents
Class RobotTarget
Represents the Robot Target declaration. This action is used to define the pose of the robot and the external axes.
Inheritance
System.Object
Action
RobotTarget
Implements
ITarget
IDeclaration
System.Runtime.Serialization.ISerializable
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Actions
Assembly: RobotComponents.dll
Syntax
public class RobotTarget : Action, ITarget, IDeclaration, ISerializable
Constructors
RobotTarget()
Initializes an empty instance of the Robot Target class.
Declaration
public RobotTarget()
RobotTarget(RobotTarget)
Initializes a new instance of the Robot Target class by duplicating an existing Robot Target instance.
Declaration
public RobotTarget(RobotTarget target)
Parameters
 Type |  Name |  Description
 RobotTarget |  target
The Robot Target instance to duplicate.
RobotTarget(SerializationInfo, StreamingContext)
Protected constructor needed for deserialization of the object.
Declaration
protected RobotTarget(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 System.Runtime.Serialization.SerializationInfo |  info
The SerializationInfo to extract the data from.
 System.Runtime.Serialization.StreamingContext |  context
The context of this deserialization.
RobotTarget(String, Plane)
Initializes a new instance of the Robot Target class with an axis conguration set to zero and an undefined External Joint Position.
Declaration
public RobotTarget(string name, Plane plane)
Parameters
 Type |  Name |  Description
 System.String |  name
The target name, must be unique.
 Rhino.Geometry.Plane |  plane
The target plane.
RobotTarget(String, Plane, Plane, Int32)
Initializes a new instance of the Robot Target class with an undefined Extenal Joint Position. The target planes will be reoriented from the reference plane to the world xy-plane.
Declaration
public RobotTarget(string name, Plane plane, Plane referencePlane, int axisConfig)
Parameters
 Type |  Name |  Description
 System.String |  name
The target name, must be unique.
 Rhino.Geometry.Plane |  plane
The target plane.
 Rhino.Geometry.Plane |  referencePlane
The reference plane.
 System.Int32 |  axisConfig
The axis configuration as a number (0-7).
RobotTarget(String, Plane, Plane, Int32, ExternalJointPosition)
Initializes a new instance of the Robot Target class. The target planes will be reoriented from the reference plane to the world xy-plane.
Declaration
public RobotTarget(string name, Plane plane, Plane referencePlane, int axisConfig, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 System.String |  name
The target name, must be unique.
 Rhino.Geometry.Plane |  plane
The target plane.
 Rhino.Geometry.Plane |  referencePlane
The Reference plane.
 System.Int32 |  axisConfig
The axis configuration as a number (0-7).
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
RobotTarget(String, Plane, Int32)
Initializes a new instance of the Robot Target class with an undefined External Joint Position.
Declaration
public RobotTarget(string name, Plane plane, int axisConfig)
Parameters
 Type |  Name |  Description
 System.String |  name
The target name, must be unique.
 Rhino.Geometry.Plane |  plane
Thr target plane.
 System.Int32 |  axisConfig
The axis configuration as a number (0-7).
RobotTarget(String, Plane, Int32, ExternalJointPosition)
Initializes a new instance of the Robot Target class.
Declaration
public RobotTarget(string name, Plane plane, int axisConfig, ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 System.String |  name
The target name, must be unique.
 Rhino.Geometry.Plane |  plane
The target plane.
 System.Int32 |  axisConfig
The axis configuration as a number (0-7).
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Properties
AxisConfig
Gets or set the axis configuration. Min. value 0. Max. value 7.
Declaration
public int AxisConfig { get; set; }
Property Value
 Type |  Description
 System.Int32
ExternalJointPosition
Gets or sets the External Joint Position.
Declaration
public ExternalJointPosition ExternalJointPosition { get; set; }
Property Value
 Type |  Description
 ExternalJointPosition
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public override bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
Overrides
Action.IsValid
Name
Gets or sets the Robot Target variable name. Each Target variable name has to be unique.
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Plane
Gets or sets the desired position and orientation of the tool center point.
Declaration
public Plane Plane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Quat
Gets or sets the desired orientation of the tool center point.
Declaration
public Quaternion Quat { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Quaternion
ReferenceType
Gets or sets the Reference Type.
Declaration
public ReferenceType ReferenceType { get; set; }
Property Value
 Type |  Description
 ReferenceType
Methods
Duplicate()
Returns an exact duplicate of this Robot Target instance.
Declaration
public RobotTarget Duplicate()
Returns
 Type |  Description
 RobotTarget
A deep copy of the Robot Target instance.
DuplicateAction()
Returns an exact duplicate of this Robot Target instance as an Action.
Declaration
public override Action DuplicateAction()
Returns
 Type |  Description
 Action
A deep copy of the Robot Target instance as an Action.
Overrides
Action.DuplicateAction()
DuplicateDeclaration()
Returns an exact duplicate of this Robot Target instance as an IDeclaration.
Declaration
public IDeclaration DuplicateDeclaration()
Returns
 Type |  Description
 IDeclaration
A deep copy of the Robot Target instance as an IDeclaration.
DuplicateTarget()
Returns an exact duplicate of this Robot Target instance as an ITarget.
Declaration
public ITarget DuplicateTarget()
Returns
 Type |  Description
 ITarget
A deep copy of the Robot Target instance as an ITarget.
GetObjectData(SerializationInfo, StreamingContext)
Populates a SerializationInfo with the data needed to serialize the object.
Declaration
public void GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 System.Runtime.Serialization.SerializationInfo |  info
The SerializationInfo to populate with data.
 System.Runtime.Serialization.StreamingContext |  context
The destination for this serialization.
ToRAPIDDeclaration(RAPIDGenerator)
Creates declarations in the RAPID program module inside the RAPID Generator. This method is called inside the RAPID generator.
Declaration
public override void ToRAPIDDeclaration(RAPIDGenerator RAPIDGenerator)
Parameters
 Type |  Name |  Description
 RAPIDGenerator |  RAPIDGenerator
The RAPID Generator.
Overrides
Action.ToRAPIDDeclaration(RAPIDGenerator)
ToRAPIDDeclaration(Robot)
Returns the RAPID declaration code line of the this action.
Declaration
public override string ToRAPIDDeclaration(Robot robot)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot were the code is generated for.
Returns
 Type |  Description
 System.String
The RAPID code line.
Overrides
Action.ToRAPIDDeclaration(Robot)
ToRAPIDInstruction(RAPIDGenerator)
Creates instructions in the RAPID program module inside the RAPID Generator. This method is called inside the RAPID generator.
Declaration
public override void ToRAPIDInstruction(RAPIDGenerator RAPIDGenerator)
Parameters
 Type |  Name |  Description
 RAPIDGenerator |  RAPIDGenerator
The RAPID Generator.
Overrides
Action.ToRAPIDInstruction(RAPIDGenerator)
ToRAPIDInstruction(Robot)
Returns the RAPID instruction code line of the this action.
Declaration
public override string ToRAPIDInstruction(Robot robot)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot were the code is generated for.
Returns
 Type |  Description
 System.String
An emptry string.
Overrides
Action.ToRAPIDInstruction(Robot)
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
Action.ToString()
Implements
 ITarget
 IDeclaration
 System.Runtime.Serialization.ISerializable