Show / Hide Table of Contents
Class IRB2600ID_15_185
Represents a collection of methods to get the IRB2600ID-15/1.85 Robot instance.
Inheritance
object
IRB2600ID_15_185
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Namespace: RobotComponents.ABB.Presets.Robots
Assembly: RobotComponents.ABB.Presets.dll
Syntax
public static class IRB2600ID_15_185
Methods
GetAxisLimits()
Returns the list with axis limits.
Declaration
public static List<Interval> GetAxisLimits()
Returns
 Type |  Description
 List<Interval>
The list with axis limits.
GetAxisPlanes()
Returns the list with the axis planes in robot coordinate space.
Declaration
public static List<Plane> GetAxisPlanes()
Returns
 Type |  Description
 List<Plane>
Returns a list with planes.
GetMeshes()
Returns the list with the base and link meshes of the robot in robot coordinate space.
Declaration
public static List<Mesh> GetMeshes()
Returns
 Type |  Description
 List<Mesh>
The list with robot meshes.
GetRobot(Plane, RobotTool, IList<ExternalAxis>)
Returns a new IRB2600ID-15/1.85 Robot instance.
Declaration
public static Robot GetRobot(Plane positionPlane, RobotTool tool, IList<ExternalAxis> externalAxes = null)
Parameters
 Type |  Name |  Description
 Plane |  positionPlane
The position and orientation of the Robot in world coordinate space.
 RobotTool |  tool
The Robot Tool.
 IList<ExternalAxis> |  externalAxes
The external axes attached to the Robot.
Returns
 Type |  Description
 Robot
The Robot preset.
GetToolMountingFrame()
Returns the tool mounting frame in robot coordinate space.
Declaration
public static Plane GetToolMountingFrame()
Returns
 Type |  Description
 Plane
The tool mounting frame.