Show / Hide Table of Contents
Class RobotTool
Represents a Robot Tool.
Inheritance
System.Object
RobotTool
Implements
System.Runtime.Serialization.ISerializable
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions
Assembly: RobotComponents.dll
Syntax
public class RobotTool : ISerializable
Constructors
RobotTool()
Initializes a new instance of the Robot Tool class with the default tool tool0.
Declaration
public RobotTool()
RobotTool(RobotTool, Boolean)
Initializes a new instance of the Robot Tool class by duplicating an existing Robot Tool instance.
Declaration
public RobotTool(RobotTool robotTool, bool duplicateMesh = true)
Parameters
 Type |  Name |  Description
 RobotTool |  robotTool
The Robot Tool instance to duplicate.
 System.Boolean |  duplicateMesh
Specifies whether the meshes should be duplicated.
RobotTool(SerializationInfo, StreamingContext)
Protected constructor needed for deserialization of the object.
Declaration
protected RobotTool(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 System.Runtime.Serialization.SerializationInfo |  info
The SerializationInfo to extract the data from.
 System.Runtime.Serialization.StreamingContext |  context
The context of this deserialization.
RobotTool(String, Mesh, Plane, Plane)
Initializes a new instance of the Robot Tool class from planes. Sets the load data as defined for the default tool tool0.
Declaration
public RobotTool(string name, Mesh mesh, Plane attachmentPlane, Plane toolPlane)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 Rhino.Geometry.Mesh |  mesh
The tool mesh.
 Rhino.Geometry.Plane |  attachmentPlane
The attachement plane.
 Rhino.Geometry.Plane |  toolPlane
The tool center point and tool orientation as a plane.
RobotTool(String, Mesh, Plane, Plane, Boolean, Double, Plane, Vector3d)
Initializes a new instance of the Robot Tool class.
Declaration
public RobotTool(string name, Mesh mesh, Plane attachmentPlane, Plane toolPlane, bool robotHold, double mass, Plane centerOfGravity, Vector3d inertia)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 Rhino.Geometry.Mesh |  mesh
The tool mesh.
 Rhino.Geometry.Plane |  attachmentPlane
The attachement plane.
 Rhino.Geometry.Plane |  toolPlane
The tool center point and tool orientation.
 System.Boolean |  robotHold
Specifies whether the robot is holding the tool.
 System.Double |  mass
The weight of the tool in kg.
 Rhino.Geometry.Plane |  centerOfGravity
The position and orientation of the center of gravity of the tool load.
 Rhino.Geometry.Vector3d |  inertia
The moment of inertia of the load in kgm2.
RobotTool(String, Mesh, Plane, Plane, Boolean, Double, Point3d, Quaternion, Vector3d)
Initializes a new instance of the Robot Tool class.
Declaration
public RobotTool(string name, Mesh mesh, Plane attachmentPlane, Plane toolPlane, bool robotHold, double mass, Point3d centerOfGravityPosition, Quaternion centerOfGravityOrientation, Vector3d inertia)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 Rhino.Geometry.Mesh |  mesh
The tool mesh.
 Rhino.Geometry.Plane |  attachmentPlane
The attachement plane.
 Rhino.Geometry.Plane |  toolPlane
The tool center point and tool orientation.
 System.Boolean |  robotHold
Specifies whether the robot is holding the tool.
 System.Double |  mass
The weight of the tool in kg.
 Rhino.Geometry.Point3d |  centerOfGravityPosition
The position of the center of gravity of the tool load.
 Rhino.Geometry.Quaternion |  centerOfGravityOrientation
The orientation of the tool load coordinate system defined by the principal inertial axes of the tool load. Expressed in the wrist coordinate system as a quaternion (q1, q2, q3, q4).
 Rhino.Geometry.Vector3d |  inertia
The moment of inertia of the load in kgm2.
RobotTool(String, Mesh, Point3d, Quaternion)
Initializes a new instance of the Robot Tool class from a point and a quarternion. Sets the attachtment plane equal to the world xy-plane. Sets the load data as defined for the default tool tool0.
Declaration
public RobotTool(string name, Mesh mesh, Point3d point, Quaternion quat)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 Rhino.Geometry.Mesh |  mesh
The tool mesh defined in the tool coordinate space.
 Rhino.Geometry.Point3d |  point
The point of the TCP point.
 Rhino.Geometry.Quaternion |  quat
The orientation of TCP point.
RobotTool(String, Mesh, Double, Double, Double, Double, Double, Double)
Initializes a new instance of the Robot Tool class from Euler data. Sets the attachtment plane equal to the world xy-plane. Sets the load data as defined for the default tool tool0.
Declaration
public RobotTool(string name, Mesh mesh, double toolTransX, double toolTransY, double toolTransZ, double toolRotX, double toolRotY, double toolRotZ)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 Rhino.Geometry.Mesh |  mesh
The tool mesh.
 System.Double |  toolTransX
The tool center point translation in x-direction.
 System.Double |  toolTransY
The tool center point translation in y-direction.
 System.Double |  toolTransZ
The tool center point translation in z-direction.
 System.Double |  toolRotX
The orientation around the x-axis in radians.
 System.Double |  toolRotY
The orientation around the y-axis in radians.
 System.Double |  toolRotZ
The orientation around the y-axis in radians.
RobotTool(String, Mesh, Double, Double, Double, Double, Double, Double, Double)
Initializes a new instance of the Robot Tool class from the x, y and z coordinate and the four quarternion values of the TCP point. Sets the attachtment plane equal to the world xy-plane. Sets the load data as defined for the default tool tool0.
Declaration
public RobotTool(string name, Mesh mesh, double x, double y, double z, double q1, double q2, double q3, double q4)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 Rhino.Geometry.Mesh |  mesh
The tool mesh.
 System.Double |  x
The x coordinate of the TCP point.
 System.Double |  y
The y coordinate of the TCP point.
 System.Double |  z
The z coordinate of the TCP point.
 System.Double |  q1
The real part of the quaternion.
 System.Double |  q2
The first imaginary coefficient of the quaternion.
 System.Double |  q3
The second imaginary coefficient of the quaternion.
 System.Double |  q4
The third imaginary coefficient of the quaternion.
RobotTool(String, IList<Mesh>, Plane, Plane)
Initializes a new instance of the Robot Tool class from planes. Sets the load data as defined for the default tool tool0.
Declaration
public RobotTool(string name, IList<Mesh> meshes, Plane attachmentPlane, Plane toolPlane)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 System.Collections.Generic.IList<Rhino.Geometry.Mesh> |  meshes
The tool mesh as The list with robot meshes.
 Rhino.Geometry.Plane |  attachmentPlane
The attachement plane.
 Rhino.Geometry.Plane |  toolPlane
The tool center point and tool orientation as a plane.
RobotTool(String, IList<Mesh>, Plane, Plane, Boolean, Double, Plane, Vector3d)
Initializes a new instance of the Robot Tool class.
Declaration
public RobotTool(string name, IList<Mesh> meshes, Plane attachmentPlane, Plane toolPlane, bool robotHold, double mass, Plane centerOfGravity, Vector3d inertia)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 System.Collections.Generic.IList<Rhino.Geometry.Mesh> |  meshes
The tool mesh.
 Rhino.Geometry.Plane |  attachmentPlane
The attachement plane.
 Rhino.Geometry.Plane |  toolPlane
The tool center point and tool orientation.
 System.Boolean |  robotHold
Specifies whether the robot is holding the tool.
 System.Double |  mass
The weight of the tool in kg.
 Rhino.Geometry.Plane |  centerOfGravity
The position and orientation of the center of gravity of the tool load.
 Rhino.Geometry.Vector3d |  inertia
The moment of inertia of the load in kgm2.
RobotTool(String, IList<Mesh>, Plane, Plane, Boolean, Double, Point3d, Quaternion, Vector3d)
Initializes a new instance of the Robot Tool class.
Declaration
public RobotTool(string name, IList<Mesh> meshes, Plane attachmentPlane, Plane toolPlane, bool robotHold, double mass, Point3d centerOfGravityPosition, Quaternion centerOfGravityOrientation, Vector3d inertia)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 System.Collections.Generic.IList<Rhino.Geometry.Mesh> |  meshes
The tool mesh.
 Rhino.Geometry.Plane |  attachmentPlane
The attachement plane.
 Rhino.Geometry.Plane |  toolPlane
The tool center point and tool orientation.
 System.Boolean |  robotHold
Specifies whether the robot is holding the tool.
 System.Double |  mass
The weight of the tool in kg.
 Rhino.Geometry.Point3d |  centerOfGravityPosition
The position of the center of gravity of the tool load.
 Rhino.Geometry.Quaternion |  centerOfGravityOrientation
The orientation of the tool load coordinate system defined by the principal inertial axes of the tool load. Expressed in the wrist coordinate system as a quaternion (q1, q2, q3, q4).
 Rhino.Geometry.Vector3d |  inertia
The moment of inertia of the load in kgm2.
RobotTool(String, IList<Mesh>, Plane, Double, Double, Double, Double, Double, Double, Double)
Initializes a new instance of the Robot Tool class from the x, y and z coordinate and the four quarternion values of the TCP point. Sets the load data as defined for the default tool tool0.
Declaration
public RobotTool(string name, IList<Mesh> meshes, Plane attachmentPlane, double x, double y, double z, double q1, double q2, double q3, double q4)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 System.Collections.Generic.IList<Rhino.Geometry.Mesh> |  meshes
The tool mesh.
 Rhino.Geometry.Plane |  attachmentPlane
The attachement plane.
 System.Double |  x
The x coordinate of the TCP point.
 System.Double |  y
The y coordinate of the TCP point.
 System.Double |  z
The z coordinate of the TCP point.
 System.Double |  q1
The real part of the quaternion.
 System.Double |  q2
The first imaginary coefficient of the quaternion.
 System.Double |  q3
The second imaginary coefficient of the quaternion.
 System.Double |  q4
The third imaginary coefficient of the quaternion.
RobotTool(String, IList<Mesh>, Double, Double, Double, Double, Double, Double)
Initializes a new instance of the Robot Tool class from Euler data. Sets the attachtment plane equal to the world xy-plane. Sets the load data as defined for the default tool tool0.
Declaration
public RobotTool(string name, IList<Mesh> meshes, double toolTransX, double toolTransY, double toolTransZ, double toolRotX, double toolRotY, double toolRotZ)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 System.Collections.Generic.IList<Rhino.Geometry.Mesh> |  meshes
The tool mesh.
 System.Double |  toolTransX
The tool center point translation in x-direction.
 System.Double |  toolTransY
The tool center point translation in y-direction.
 System.Double |  toolTransZ
The tool center point translation in z-direction.
 System.Double |  toolRotX
The orientation around the x-axis in radians.
 System.Double |  toolRotY
The orientation around the y-axis in radians.
 System.Double |  toolRotZ
The orientation around the y-axis in radians.
RobotTool(String, IList<Mesh>, Double, Double, Double, Double, Double, Double, Double)
Initializes a new instance of the Robot Tool class from the x, y and z coordinate and the four quarternion values of the TCP point. Sets the attachtment plane equal to the world xy-plane. Sets the load data as defined for the default tool tool0.
Declaration
public RobotTool(string name, IList<Mesh> meshes, double x, double y, double z, double q1, double q2, double q3, double q4)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 System.Collections.Generic.IList<Rhino.Geometry.Mesh> |  meshes
The tool mesh.
 System.Double |  x
The x coordinate of the TCP point.
 System.Double |  y
The y coordinate of the TCP point.
 System.Double |  z
The z coordinate of the TCP point.
 System.Double |  q1
The real part of the quaternion.
 System.Double |  q2
The first imaginary coefficient of the quaternion.
 System.Double |  q3
The second imaginary coefficient of the quaternion.
 System.Double |  q4
The third imaginary coefficient of the quaternion.
Properties
AttachmentPlane
Gets or sets the tool attachment plane.
Declaration
public Plane AttachmentPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
CenterOfGravity
Gets or sets the position and orientation of the center of gravity of the tool load as a plane.
Declaration
public Plane CenterOfGravity { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
CenterOfGravityOrientation
Gets the orientation of the tool load coordinate system defined by the principal inertial axes of the tool load. Expressed in the wrist coordinate system as a quaternion (q1, q2, q3, q4).
Declaration
public Quaternion CenterOfGravityOrientation { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Quaternion
CenterOfGravityPosition
Gets the position of the center of gravity of the tool load.
Declaration
public Point3d CenterOfGravityPosition { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Point3d
Inertia
Gets or set the moment of inertia of the load in kgm2.
Declaration
public Vector3d Inertia { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Vector3d
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
Mass
Gets or sets the weight of the load in kg.
Declaration
public double Mass { get; set; }
Property Value
 Type |  Description
 System.Double
Mesh
Gets or sets the mesh.
Declaration
public Mesh Mesh { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Mesh
Name
Gets or sets the tool name. Each tool name has to be unique.
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Orientation
Gets the orientation of the tool center point as a Quaternion.
Declaration
public Quaternion Orientation { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Quaternion
Position
Gets the position of the the tool center point which is the offset between the tool center plane and the attachment plane.
Declaration
public Point3d Position { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Point3d
ReferenceType
Gets or sets the Reference Type.
Declaration
public ReferenceType ReferenceType { get; set; }
Property Value
 Type |  Description
 ReferenceType
RobotHold
Gets or sets a value indicating whether the robot is holding the tool. Use true if the robot is holding the tool. Use false if the robot is not holding the tool (e.g. stationary tool).
Declaration
public bool RobotHold { get; set; }
Property Value
 Type |  Description
 System.Boolean
ToolPlane
Gets or sets the position and orientaton of the tool center point.
Declaration
public Plane ToolPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Methods
CalculateCenterOfGravityOrientation()
Calculates and returns the tool center of gravity orientation relative to the defined attachment plane.
Declaration
public Quaternion CalculateCenterOfGravityOrientation()
Returns
 Type |  Description
 Rhino.Geometry.Quaternion
The quaternion orientation of the tool center of gravity.
CalculateCenterOfGravityPosition()
Calculates and returns the tool center of gravity relative to the defined attachment plane.
Declaration
public Point3d CalculateCenterOfGravityPosition()
Returns
 Type |  Description
 Rhino.Geometry.Point3d
The center of gravity point.
CalculateToolOrientation()
Calculates and returns the tool center orientation relative to the defined attachment plane.
Declaration
public Quaternion CalculateToolOrientation()
Returns
 Type |  Description
 Rhino.Geometry.Quaternion
The quaternion orientation of the tool center plane.
CalculateToolPosition()
Calculates and returns the tool center point relative to the defined attachment plane.
Declaration
public Point3d CalculateToolPosition()
Returns
 Type |  Description
 Rhino.Geometry.Point3d
The tool center point.
Duplicate()
Returns an exact duplicate of this Robot Tool instance.
Declaration
public RobotTool Duplicate()
Returns
 Type |  Description
 RobotTool
A deep copy of the Robot Tool instance.
DuplicateWithoutMesh()
Returns an exact duplicate of this Robot Tool instance without meshes.
Declaration
public RobotTool DuplicateWithoutMesh()
Returns
 Type |  Description
 RobotTool
A deep copy of the Robot Tool instance without meshes.
GetBoundingBox(Boolean)
Returns the Bounding Box of the object.
Declaration
public BoundingBox GetBoundingBox(bool accurate)
Parameters
 Type |  Name |  Description
 System.Boolean |  accurate
If true, a physically accurate bounding box will be computed. If not, a bounding box estimate will be computed.
Returns
 Type |  Description
 Rhino.Geometry.BoundingBox
The Bounding Box.
GetEmptyRobotTool()
Returns an empty Robot Tool instance.
Declaration
public static RobotTool GetEmptyRobotTool()
Returns
 Type |  Description
 RobotTool
The empty Robot Tool.
GetObjectData(SerializationInfo, StreamingContext)
Populates a SerializationInfo with the data needed to serialize the object.
Declaration
public void GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 System.Runtime.Serialization.SerializationInfo |  info
The SerializationInfo to populate with data.
 System.Runtime.Serialization.StreamingContext |  context
The destination for this serialization.
ReInitialize()
Reinitializes the fields and properties to construct a valid Robot Tool instance.
Declaration
public void ReInitialize()
ToRAPIDDeclaration()
Returns the RAPID declaration code line of the this Robot Tool.
Declaration
public string ToRAPIDDeclaration()
Returns
 Type |  Description
 System.String
The RAPID code line.
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
System.Object.ToString()
Transform(Transform)
Transforms the Robot Tool spatial properties (planes and meshes).
Declaration
public void Transform(Transform xform)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Transform |  xform
The spatial deform.
Implements
 System.Runtime.Serialization.ISerializable