Show / Hide Table of Contents
Class HelperMethods
Represents general helper methods
Inheritance
object
HelperMethods
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Namespace: RobotComponents.ABB.Utils
Assembly: RobotComponents.ABB.dll
Syntax
public static class HelperMethods
Methods
FlipPlaneX(Plane)
Flips a plane normal to the oposite direction by setting it's x-axis negative.
Declaration
public static Plane FlipPlaneX(Plane plane)
Parameters
 Type |  Name |  Description
 Plane |  plane
The plane that needs to be flipped.
Returns
 Type |  Description
 Plane
Tshe flipped plane.
FlipPlaneY(Plane)
Flips a plane normal to the oposite direction by setting it's y-axis negative.
Declaration
public static Plane FlipPlaneY(Plane plane)
Parameters
 Type |  Name |  Description
 Plane |  plane
The plane that needs to be flipped.
Returns
 Type |  Description
 Plane
The flipped plane.
PlaneToQuaternion(Plane)
Transforms a plane to a quarternion with as reference plane WorldXY.
Declaration
public static Quaternion PlaneToQuaternion(Plane plane)
Parameters
 Type |  Name |  Description
 Plane |  plane
The plane to should be transformed.
Returns
 Type |  Description
 Quaternion
The quaternion.
PlaneToQuaternion(Plane, Plane)
Transforms a plane to a quarternion.
Declaration
public static Quaternion PlaneToQuaternion(Plane refPlane, Plane plane)
Parameters
 Type |  Name |  Description
 Plane |  refPlane
The reference plane.
 Plane |  plane
The plane that should be transformed.
Returns
 Type |  Description
 Quaternion
The quaternion as a Quaternion.
PlaneToQuaternion(Plane, Plane, out Point3d)
Transforms a plane to a quarternion.
Declaration
public static Quaternion PlaneToQuaternion(Plane refPlane, Plane plane, out Point3d origin)
Parameters
 Type |  Name |  Description
 Plane |  refPlane
The reference plane.
 Plane |  plane
The plane that should be transformed.
 Point3d |  origin
The origin of the plane oriented based on the reference plane.
Returns
 Type |  Description
 Quaternion
The quaternion as a Quaternion.
QuaternionToPlane(Plane, Point3d, Quaternion)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(Plane refPlane, Point3d origin, Quaternion quat)
Parameters
 Type |  Name |  Description
 Plane |  refPlane
The reference plane.
 Point3d |  origin
The origin of the new plane.
 Quaternion |  quat
The quarternion.
Returns
 Type |  Description
 Plane
The plane obtained with the orientation defined by the quarternion values.
QuaternionToPlane(Plane, Point3d, double, double, double, double)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(Plane refPlane, Point3d origin, double A, double B, double C, double D)
Parameters
 Type |  Name |  Description
 Plane |  refPlane
The reference plane.
 Point3d |  origin
The origin of the plane.
 double |  A
The real part of the quaternion.
 double |  B
The first imaginary coefficient of the quaternion.
 double |  C
The second imaginary coefficient of the quaternion.
 double |  D
The third imaginary coefficient of the quaternion.
Returns
 Type |  Description
 Plane
The plane obtained with the orientation defined by the quarternion values.
QuaternionToPlane(Plane, double, double, double, double, double, double, double)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(Plane refPlane, double x, double y, double z, double A, double B, double C, double D)
Parameters
 Type |  Name |  Description
 Plane |  refPlane
The reference plane.
 double |  x
The x coordinate of the plane origin.
 double |  y
The y coordinate of the plane origin.
 double |  z
The z coordinate of the plane origin.
 double |  A
The real part of the quaternion.
 double |  B
The first imaginary coefficient of the quaternion.
 double |  C
The second imaginary coefficient of the quaternion.
 double |  D
The third imaginary coefficient of the quaternion.
Returns
 Type |  Description
 Plane
The plane obtained with the orientation defined by the quarternion values.
QuaternionToPlane(Point3d, Quaternion)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(Point3d origin, Quaternion quat)
Parameters
 Type |  Name |  Description
 Point3d |  origin
The origin of the plane.
 Quaternion |  quat
The quarternion.
Returns
 Type |  Description
 Plane
The plane obtained with the orientation defined by the quarternion values.
QuaternionToPlane(Point3d, double, double, double, double)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(Point3d origin, double A, double B, double C, double D)
Parameters
 Type |  Name |  Description
 Point3d |  origin
The origin of the plane.
 double |  A
The real part of the quaternion.
 double |  B
The first imaginary coefficient of the quaternion.
 double |  C
The second imaginary coefficient of the quaternion.
 double |  D
The third imaginary coefficient of the quaternion.
Returns
 Type |  Description
 Plane
The plane obtained with the orientation defined by the quarternion values.
QuaternionToPlane(double, double, double, double, double, double, double)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(double x, double y, double z, double A, double B, double C, double D)
Parameters
 Type |  Name |  Description
 double |  x
The x coordinate of the plane origin.
 double |  y
The y coordinate of the plane origin.
 double |  z
The z coordinate of the plane origin.
 double |  A
The real part of the quaternion.
 double |  B
The first imaginary coefficient of the quaternion.
 double |  C
The second imaginary coefficient of the quaternion.
 double |  D
The third imaginary coefficient of the quaternion.
Returns
 Type |  Description
 Plane
The plane obtained with the orientation defined by the quarternion values.
ReplaceFirst(string, string, string)
Replaces the first occurence in a string with a new text.
Declaration
public static string ReplaceFirst(this string text, string search, string replace)
Parameters
 Type |  Name |  Description
 string |  text
The text the search and replace in.
 string |  search
The text to search for.
 string |  replace
The new text.
Returns
 Type |  Description
 string
Returns a new string with replaced text.