Show / Hide Table of Contents
Class OPWKinematics
Represents the OPW Kinematics class.
Inheritance
object
OPWKinematics
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Namespace: RobotComponents.Generic.Kinematics
Assembly: RobotComponents.dll
Syntax
[Obsolete("BETA: This class is under development and might heavily change within the current major release.", false)]
public class OPWKinematics
Remarks
Based on the paper 'An Analytical Solution of the Inverse Kinematics Problem of Industrial Serial Manipulators with an Ortho-parallel Basis and a Spherical Wrist' by Mathias Brandstötter, Arthur Angerer, and Michael Hofbaur.
Constructors
OPWKinematics()
Initializes an empty instance of the OPW Kinematics class
Declaration
public OPWKinematics()
Properties
A1
Gets or sets the OPW kinematics parameter A1.
Declaration
public double A1 { get; set; }
Property Value
 Type |  Description
 double
A2
Gets or sets the OPW kinematics parameter A2.
Declaration
public double A2 { get; set; }
Property Value
 Type |  Description
 double
B
Gets or sets the OPW kinematics parameter B.
Declaration
public double B { get; set; }
Property Value
 Type |  Description
 double
C1
Gets or sets the OPW kinematics parameter C1.
Declaration
public double C1 { get; set; }
Property Value
 Type |  Description
 double
C2
Gets or sets the OPW kinematics parameter C2.
Declaration
public double C2 { get; set; }
Property Value
 Type |  Description
 double
C3
Gets or sets the OPW kinematics parameter C3.
Declaration
public double C3 { get; set; }
Property Value
 Type |  Description
 double
C4
Gets or sets the OPW kinematics parameter C4.
Declaration
public double C4 { get; set; }
Property Value
 Type |  Description
 double
IsElbowSingularity
Gets a value indicating whether or not the solutions have an elbow singularity.
Declaration
public bool[] IsElbowSingularity { get; }
Property Value
 Type |  Description
 bool[]
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public bool IsValid { get; }
Property Value
 Type |  Description
 bool
IsWristSingularity
Gets a value indicating whether or not the solutions have a wrist singularity.
Declaration
public bool[] IsWristSingularity { get; }
Property Value
 Type |  Description
 bool[]
Offsets
Gets or sets the offset corrections.
Declaration
public double[] Offsets { get; set; }
Property Value
 Type |  Description
 double[]
Signs
Gets or sets the sign corrections.
Declaration
public int[] Signs { get; set; }
Property Value
 Type |  Description
 int[]
Solutions
Gets the inverse kinematics solutions.
Declaration
public double[][] Solutions { get; }
Property Value
 Type |  Description
 double[][]
Methods
Forward(IList<double>, out Point3d)
Calculates the end plane of joint 6 for a given pose.
Declaration
public Plane Forward(IList<double> pose, out Point3d wristPosition)
Parameters
 Type |  Name |  Description
 IList<double> |  pose
The pose as a collection with 6 rotations in radians.
 Point3d |  wristPosition
The wrist position for the given pose.
Returns
 Type |  Description
 Plane
The end plane of the 6th joint.
Inverse(Plane)
Calculates the inverse kinematic solutions.
Declaration
public void Inverse(Plane endPlane)
Parameters
 Type |  Name |  Description
 Plane |  endPlane
The end plane of joint 6.
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 string
A string that represents the current object.
Overrides
object.ToString()