Show / Hide Table of Contents
Class Movement
Represents several Move instructions (MoveAbsJ, MoveL, MoveJ, MoveLDO and MoveJDO).
Inheritance
object
Action
Movement
Implements
IInstruction
ISerializable
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Namespace: RobotComponents.ABB.Actions.Instructions
Assembly: RobotComponents.ABB.dll
Syntax
public class Movement : Action, IInstruction, ISerializable
Constructors
Movement()
Initializes an empty instance of the Movement class.
Declaration
public Movement()
Movement(Plane)
Initializes a new instance of the Movement class. This constructor is typically used to cast a Plane to a movement.
Declaration
public Movement(Plane plane)
Parameters
 Type |  Name |  Description
 Plane |  plane
The target plan.
Movement(Movement, bool)
Initializes a new instance of the Movement class by duplicating an existing Movement instance.
Declaration
public Movement(Movement movement, bool duplicateMesh = true)
Parameters
 Type |  Name |  Description
 Movement |  movement
The Movement instance to duplicate.
 bool |  duplicateMesh
Specifies whether the meshes should be duplicated.
Movement(ITarget)
Initializes a new instance of the Movement class. This constructor is typically used to cast a Robot Target to a movement.
Declaration
public Movement(ITarget target)
Parameters
 Type |  Name |  Description
 ITarget |  target
The Target.
Movement(MovementType, ITarget, SpeedData)
Initializes a new instance of the Movement class with an empty Robot Tool (no override), a default Work Object (wobj0) and an empty Digital Output.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The Movmement Type.
 ITarget |  target
The Target.
 SpeedData |  speedData
The Speed Data.
Movement(MovementType, ITarget, SpeedData, ZoneData)
Initializes a new instance of the Movement class with an empty Robot Tool (no override), a default Work Object (wobj0) and an empty Digital Output.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The Movement Type.
 ITarget |  target
The Target.
 SpeedData |  speedData
The Speed Data.
 ZoneData |  zoneData
The Zone Data.
Movement(MovementType, ITarget, SpeedData, ZoneData, DigitalOutput)
Initializes a new instance of the Movement class with an empty Robot Tool (no override) and a default Work Object (wobj0)
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, DigitalOutput digitalOutput)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The Movement Type.
 ITarget |  target
The Target.
 SpeedData |  speedData
The Speed Data.
 ZoneData |  zoneData
The Zone Data.
 DigitalOutput |  digitalOutput
The Digital Output. When set this will define a MoveLDO or a MoveJDO instruction.
Movement(MovementType, ITarget, SpeedData, ZoneData, RobotTool)
Initializes a new instance of the Movement class with a default Work object (wobj0) and an empty Digital Output.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, RobotTool robotTool)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The Movement Type.
 ITarget |  target
The Target.
 SpeedData |  speedData
The Speed Data.
 ZoneData |  zoneData
The Zone Data.
 RobotTool |  robotTool
The Robot Tool. This will override the set default tool.
Movement(MovementType, ITarget, SpeedData, ZoneData, RobotTool, DigitalOutput)
Initializes a new instance of the Movement class with a default Work Object (wobj0).
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, RobotTool robotTool, DigitalOutput digitalOutput)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The Movement Type.
 ITarget |  target
The Target.
 SpeedData |  speedData
The Speed Data.
 ZoneData |  zoneData
The Zone Data.
 RobotTool |  robotTool
The Robot Tool. This will override the set default tool.
 DigitalOutput |  digitalOutput
The Digital Output. When set this will define a MoveLDO or a MoveJDO instruction.
Movement(MovementType, ITarget, SpeedData, ZoneData, RobotTool, WorkObject)
Initializes a new instance of the Movement class with an empty Digital Output.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, RobotTool robotTool, WorkObject workObject)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The Movement Type.
 ITarget |  target
The Taret.
 SpeedData |  speedData
The Speed Data.
 ZoneData |  zoneData
The Zone Data.
 RobotTool |  robotTool
The Robot Tool. This will override the set default tool.
 WorkObject |  workObject
The Work Object.
Movement(MovementType, ITarget, SpeedData, ZoneData, RobotTool, WorkObject, DigitalOutput)
Initializes a new instance of the Movement class.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, RobotTool robotTool, WorkObject workObject, DigitalOutput digitalOutput)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The Movement Type.
 ITarget |  target
The Target.
 SpeedData |  speedData
The Speed Data.
 ZoneData |  zoneData
The Zone Data.
 RobotTool |  robotTool
The Robot Tool. This will override the set default tool.
 WorkObject |  workObject
The Work Object.
 DigitalOutput |  digitalOutput
The Digital Output. When set this will define a MoveLDO or a MoveJDO instruction.
Movement(MovementType, ITarget, SpeedData, ZoneData, WorkObject)
Initializes a new instance of the Movement class with an empty Robot Tool (no override) and an empty Digital Output.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, WorkObject workObject)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The Movement Type.
 ITarget |  target
The Target.
 SpeedData |  speedData
The Speed Data.
 ZoneData |  zoneData
The Zone Data.
 WorkObject |  workObject
The Work Object.
Movement(SerializationInfo, StreamingContext)
Protected constructor needed for deserialization of the object.
Declaration
protected Movement(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 SerializationInfo |  info
The SerializationInfo to extract the data from.
 StreamingContext |  context
The context of this deserialization.
Properties
DigitalOutput
Gets or set the Digital Output. If an empty or invalid Digital Output is set a normal movement will be set (MoveAbsJ, MoveL or MoveJ). If a valid Digital oOutput is combined movement will be created (MoveLDO or MoveJDO). If as Movement Type an MoveAbsJ is set an extra RAPID code line will be added that sets the Digital Output (SetDO).
Declaration
public DigitalOutput DigitalOutput { get; set; }
Property Value
 Type |  Description
 DigitalOutput
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public override bool IsValid { get; }
Property Value
 Type |  Description
 bool
Overrides
Action.IsValid
MovementType
Gets or sets the Movement Type.
Declaration
public MovementType MovementType { get; set; }
Property Value
 Type |  Description
 MovementType
RobotTool
Gets or sets the Robot Tool. If an empty or no Robot Tool is used, the Robot Tool set at the Robot will be used.
Declaration
public RobotTool RobotTool { get; set; }
Property Value
 Type |  Description
 RobotTool
SpeedData
Gets or sets the Speed Data.
Declaration
public SpeedData SpeedData { get; set; }
Property Value
 Type |  Description
 SpeedData
SyncID
Gets or sets the synchronization id for multi move programming. This ID number must be defined for coordinated synchronized movements in multi move systems. Set this property to -1 to define normal movements (not coordinated / not synchronized).
Declaration
public int SyncID { get; set; }
Property Value
 Type |  Description
 int
Target
Gets or sets the Target. Defines the destination target of the robot and external axes.
Declaration
public ITarget Target { get; set; }
Property Value
 Type |  Description
 ITarget
Time
Gets the the total time which the robot will move in seconds. This overwrites the defined speeddata value. Set this property to a negative value to not overwrite the speeddata value.
Declaration
public double Time { get; set; }
Property Value
 Type |  Description
 double
WorkObject
Gets or sets the Work Object.
Declaration
public WorkObject WorkObject { get; set; }
Property Value
 Type |  Description
 WorkObject
ZoneData
Gets or sets the Zone Data.
Declaration
public ZoneData ZoneData { get; set; }
Property Value
 Type |  Description
 ZoneData
Methods
Duplicate()
Returns an exact duplicate of this Movement instance.
Declaration
public Movement Duplicate()
Returns
 Type |  Description
 Movement
A deep copy of the Movement instance.
DuplicateAction()
Returns an exact duplicate of this Movement instance as an Action.
Declaration
public override Action DuplicateAction()
Returns
 Type |  Description
 Action
A deep copy of the Movement instance as an Action.
Overrides
Action.DuplicateAction()
DuplicateInstruction()
Returns an exact duplicate of this Movement instance as IInstruction.
Declaration
public IInstruction DuplicateInstruction()
Returns
 Type |  Description
 IInstruction
A deep copy of the Movement instance as an IInstruction.
DuplicateWithoutMesh()
Returns an exact duplicate of this Movement instance without meshes.
Declaration
public Movement DuplicateWithoutMesh()
Returns
 Type |  Description
 Movement
A deep copy of the Movement instance.
GetGlobalTargetPlane()
Calculates the position and the orientation of the target in world coordinate space. If an external axis is attached to the work object this method returns the pose of the target plane in the world coorinate space for axis values equal to zero.
Declaration
public Plane GetGlobalTargetPlane()
Returns
 Type |  Description
 Plane
The the target plane in world coordinate space.
GetObjectData(SerializationInfo, StreamingContext)
Populates a SerializationInfo with the data needed to serialize the object.
Declaration
public void GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 SerializationInfo |  info
The SerializationInfo to populate with data.
 StreamingContext |  context
The destination for this serialization.
GetPosedGlobalTargetPlane()
Calculates the posed target plane for the defined Robot with attached external axes in world coordinate space.
Declaration
public Plane GetPosedGlobalTargetPlane()
Returns
 Type |  Description
 Plane
The posed target plane in world coordinate space.
ToRAPIDDeclaration(RAPIDGenerator)
Creates declarations in the RAPID program module inside the RAPID Generator. This method is called inside the RAPID generator.
Declaration
public override void ToRAPIDDeclaration(RAPIDGenerator RAPIDGenerator)
Parameters
 Type |  Name |  Description
 RAPIDGenerator |  RAPIDGenerator
The RAPID Generator.
Overrides
Action.ToRAPIDDeclaration(RAPIDGenerator)
ToRAPIDDeclaration(Robot)
Returns the RAPID declaration code line of the this action.
Declaration
public override string ToRAPIDDeclaration(Robot robot)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot were the code is generated for.
Returns
 Type |  Description
 string
An empty string.
Overrides
Action.ToRAPIDDeclaration(Robot)
ToRAPIDInstruction(RAPIDGenerator)
Creates instructions in the RAPID program module inside the RAPID Generator. This method is called inside the RAPID generator.
Declaration
public override void ToRAPIDInstruction(RAPIDGenerator RAPIDGenerator)
Parameters
 Type |  Name |  Description
 RAPIDGenerator |  RAPIDGenerator
The RAPID Generator.
Overrides
Action.ToRAPIDInstruction(RAPIDGenerator)
ToRAPIDInstruction(Robot)
Returns the RAPID instruction code line of the this action.
Declaration
public override string ToRAPIDInstruction(Robot robot)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot were the code is generated for.
Returns
 Type |  Description
 string
The RAPID code line.
Overrides
Action.ToRAPIDInstruction(Robot)
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 string
A string that represents the current object.
Overrides
Action.ToString()
Implements
 IInstruction
 System.Runtime.Serialization.ISerializable