Show / Hide Table of Contents
Class RobotToolCalibration
Represents the Robot Tool Calibration class. This class uses Newton's method and numerical differentiation to calculate the TCP from given Joint Positions. If desired, the parameters for this optimization can be changed via the properties of this class.
Inheritance
System.Object
RobotToolCalibration
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Utils
Assembly: RobotComponents.dll
Syntax
public class RobotToolCalibration
Constructors
RobotToolCalibration()
Initializes an empty instance of the Robot Tool Calibration class.
Declaration
public RobotToolCalibration()
RobotToolCalibration(Robot, List<RobotJointPosition>)
Initializes a new instance of the Robot Tool Calibration class from given Robot Joint Positions. The External Joint Positions are set with default values (9e9).
Declaration
public RobotToolCalibration(Robot robot, List<RobotJointPosition> robotJointPositions)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot the Joint Positions are given for.
 System.Collections.Generic.List<RobotJointPosition> |  robotJointPositions
The Robot Joint Positions as a list.
RobotToolCalibration(Robot, List<RobotJointPosition>, List<ExternalJointPosition>)
Initializes a new instance of the Robot Tool Calibration class.
Declaration
public RobotToolCalibration(Robot robot, List<RobotJointPosition> robotJointPositions, List<ExternalJointPosition> externalJointPositions)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot the Joint Positions are given for.
 System.Collections.Generic.List<RobotJointPosition> |  robotJointPositions
The Robot Joint Positions as a list.
 System.Collections.Generic.List<ExternalJointPosition> |  externalJointPositions
The External Joint Positions as a list.
RobotToolCalibration(RobotToolCalibration)
Initializes a new instance of the Robot Tool Calibration class by duplicating an existing Robot Tool Calibration instance.
Declaration
public RobotToolCalibration(RobotToolCalibration calibration)
Parameters
 Type |  Name |  Description
 RobotToolCalibration |  calibration
The Robot Tool Calibration instance to duplicate.
Properties
Damping
Gets or sets the damping factor of the tool calibraton optimization.
Declaration
public double Damping { get; set; }
Property Value
 Type |  Description
 System.Double
Delta
Gets or sets the delta of the tool calibraton optimization.
Declaration
public double Delta { get; set; }
Property Value
 Type |  Description
 System.Double
ErrorsX
Gets the resulting errors in x-direction for each given Joint Position.
Declaration
public double[] ErrorsX { get; }
Property Value
 Type |  Description
 System.Double[]
ErrorsY
Gets the resulting errors in y-direction for each given Joint Position.
Declaration
public double[] ErrorsY { get; }
Property Value
 Type |  Description
 System.Double[]
ErrorsZ
Gets the resulting errors in z-direction for each given Joint Position.
Declaration
public double[] ErrorsZ { get; }
Property Value
 Type |  Description
 System.Double[]
ExternalJointPositions
Gets or sets the External Joint Positions to calculate the tool center point from.
Declaration
public List<ExternalJointPosition> ExternalJointPositions { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ExternalJointPosition>
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
Iterations
Gets or sets the maximum number of iterations of the tool calibation optimization.
Declaration
public int Iterations { get; set; }
Property Value
 Type |  Description
 System.Int32
MaximumError
Gets the maximum errors in the x, y and z direction as a vector.
Declaration
public Vector3d MaximumError { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Vector3d
Precision
Gets or sets the desired precision of the tool calibraton optimization.
Declaration
public double Precision { get; set; }
Property Value
 Type |  Description
 System.Double
Robot
Gets or sets the Robot that is used for the tool calibration.
Declaration
public Robot Robot { get; set; }
Property Value
 Type |  Description
 Robot
RobotJointPositions
Gets or sets the Robot Joint Positions to calculate the TCP from.
Declaration
public List<RobotJointPosition> RobotJointPositions { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<RobotJointPosition>
TargetPoint
Gets the target point in world coordinate space. This is the average point that is obtained from the given Robot Joint Positions and the calculated TCP.
Declaration
public Point3d TargetPoint { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Point3d
TcpPoint
Gets the tool center point.
Declaration
public Point3d TcpPoint { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Point3d
X
Gets the x-coordindate of the tool center point.
Declaration
public double X { get; }
Property Value
 Type |  Description
 System.Double
XInitial
Gets or sets the initial x-coordinate of the tool center point to start the optimization with.
Declaration
public double XInitial { get; set; }
Property Value
 Type |  Description
 System.Double
Y
Gets the y-coordindate of the tool center point.
Declaration
public double Y { get; }
Property Value
 Type |  Description
 System.Double
YInitial
Gets or sets the initial y-coordinate of the tool center point to start the optimization with.
Declaration
public double YInitial { get; set; }
Property Value
 Type |  Description
 System.Double
Z
Gets the z-coordindate of the tool center point.
Declaration
public double Z { get; }
Property Value
 Type |  Description
 System.Double
ZInitial
Gets or sets the initial z-coordinate of the tool center point to start the optimization with.
Declaration
public double ZInitial { get; set; }
Property Value
 Type |  Description
 System.Double
Methods
Calculate()
Calculates the Tool Center Point.
Declaration
public void Calculate()
CheckJointPositionsAxisLimits()
Checks if the given Joint Positions are within the axis limits of the robot.
Declaration
public List<string> CheckJointPositionsAxisLimits()
Returns
 Type |  Description
 System.Collections.Generic.List<System.String>
A list with erros messages. When the list is empty, all the joint positions are within the limits.
Duplicate()
Returns an exact duplicate of this Robot Tool Calibration instance.
Declaration
public RobotToolCalibration Duplicate()
Returns
 Type |  Description
 RobotToolCalibration
A deep copy of the Robot Tool Calibration instance.
ReInitialize()
Reinitializes the fields and properties to construct a valid Robot Tool Calibration instance.
Declaration
public void ReInitialize()