Show / Hide Table of Contents
Class ExternalAxis
Represents an abstract class for External Axes.
Inheritance
System.Object
ExternalAxis
ExternalLinearAxis
ExternalRotationalAxis
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions
Assembly: RobotComponents.dll
Syntax
public abstract class ExternalAxis
Constructors
ExternalAxis()
Initializes an empty instance of the External Axis class.
Declaration
public ExternalAxis()
Properties
AttachmentPlane
Gets or sets the attachment plane to attach a robot or work object.
Declaration
public abstract Plane AttachmentPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
AxisLimits
Gets or sets the axis limits.
Declaration
public abstract Interval AxisLimits { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Interval
AxisLogic
Gets the axis logic as a char (-, A, B, C, E, E, F).
Declaration
public abstract char AxisLogic { get; }
Property Value
 Type |  Description
 System.Char
AxisNumber
Gets or sets the axis logic as a number (-1, 0, 1, 2, 3, 4, 5).
Declaration
public abstract int AxisNumber { get; set; }
Property Value
 Type |  Description
 System.Int32
AxisPlane
Gets or sets the axis plane. In case of a rotational axis the z-axis of the plane defines the rotation center. In case of linear axis the z-axis of the plane defines the movement direction.
Declaration
public abstract Plane AxisPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
AxisType
Gets the Axis Type.
Declaration
public abstract AxisType AxisType { get; }
Property Value
 Type |  Description
 AxisType
BaseMesh
Gets or sets the fixed base mesh of the external axis.
Declaration
public abstract Mesh BaseMesh { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Mesh
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public abstract bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
LinkMesh
Gets or sets the movable link mesh of the external axis posed for external axis value set to 0.
Declaration
public abstract Mesh LinkMesh { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Mesh
MovesRobot
Gets a value indicating whether or not this External Axis moves the Robot.
Declaration
public abstract bool MovesRobot { get; set; }
Property Value
 Type |  Description
 System.Boolean
Name
Gets or sets the external axis name.
Declaration
public abstract string Name { get; set; }
Property Value
 Type |  Description
 System.String
PosedMeshes
Gets latest calculated posed axis meshes.
Declaration
public abstract List<Mesh> PosedMeshes { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
Methods
CalculatePosition(ExternalJointPosition, out Boolean)
Calculates the position of the attachment plane for a given External Joint Position. This calculation does not take into account the axis limits.
Declaration
public abstract Plane CalculatePosition(ExternalJointPosition externalJointPosition, out bool inLimits)
Parameters
 Type |  Name |  Description
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
 System.Boolean |  inLimits
Specifies whether the External Joint Position is inside its limits.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The posed attachement plane.
CalculatePositionSave(ExternalJointPosition)
Calculates the position of the attachment plane for a given External Joint Position. This calculations takes into account the external axis limits. If the defined External Joint Posiiton is outside its limits the closest valid external axis value will be used.
Declaration
public abstract Plane CalculatePositionSave(ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The posed attachement plane.
CalculateTransformationMatrix(ExternalJointPosition, out Boolean)
Calculates the the transformation matrix for a given External Joint Position. This calculation does not take into account the axis limits.
Declaration
public abstract Transform CalculateTransformationMatrix(ExternalJointPosition externalJointPosition, out bool inLimits)
Parameters
 Type |  Name |  Description
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
 System.Boolean |  inLimits
Specifies whether the External Joint Position is inside its limits.
Returns
 Type |  Description
 Rhino.Geometry.Transform
The transformation matrix.
CalculateTransformationMatrixSave(ExternalJointPosition)
Calculates the the transformation matrix for a given External Joint Position. This calculations takes into account the external axis limits. If the defined External Joint Posiiton is outside its limits the closest valid external axis value will be used.
Declaration
public abstract Transform CalculateTransformationMatrixSave(ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Returns
 Type |  Description
 Rhino.Geometry.Transform
The transformation matrix.
DuplicateExternalAxis()
Returns an exact duplicate of this External Axis.
Declaration
public abstract ExternalAxis DuplicateExternalAxis()
Returns
 Type |  Description
 ExternalAxis
A deep copy of the External Axis.
DuplicateExternalAxisWithoutMesh()
Returns an exact duplicate of this External Axis without meshes.
Declaration
public abstract ExternalAxis DuplicateExternalAxisWithoutMesh()
Returns
 Type |  Description
 ExternalAxis
A deep copy of the External Axis without meshes.
PoseMeshes(ExternalJointPosition)
Calculates the position of the external axis meshes for a given External Joint Position.
Declaration
public abstract List<Mesh> PoseMeshes(ExternalJointPosition externalJointPosition)
Parameters
 Type |  Name |  Description
 ExternalJointPosition |  externalJointPosition
The External Joint Position.
Returns
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
The posed meshes.
ReInitialize()
Reinitializes the fields and properties to construct valid External Axis instance.
Declaration
public abstract void ReInitialize()
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
System.Object.ToString()
Transform(Transform)
Transforms the external axis spatial properties (planes and meshes).
Declaration
public abstract void Transform(Transform xform)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Transform |  xform
The spatial deform.