Show / Hide Table of Contents
Class LoadData
Represent Load Data.
Inheritance
object
LoadData
Implements
ISerializable
IDeclaration
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Namespace: RobotComponents.ABB.Definitions
Assembly: RobotComponents.ABB.dll
Syntax
public class LoadData : ISerializable, IDeclaration
Constructors
LoadData()
Initializes a new instance of the Load Data class with the default load load0.
Declaration
public LoadData()
LoadData(LoadData)
Initializes a new instance of the Load Data class by duplicating an existing Load Data instance.
Declaration
public LoadData(LoadData loadData)
Parameters
 Type |  Name |  Description
 LoadData |  loadData
The Load Data instance to duplicate.
LoadData(SerializationInfo, StreamingContext)
Protected constructor needed for deserialization of the object.
Declaration
protected LoadData(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 SerializationInfo |  info
The SerializationInfo to extract the data from.
 StreamingContext |  context
The context of this deserialization.
LoadData(string, double, Point3d, Quaternion, Vector3d)
Initializes a new instance of the Load Data class.
Declaration
public LoadData(string name, double mass, Point3d centerOfGravity, Quaternion axesOfMoment, Vector3d inertialMoments)
Parameters
 Type |  Name |  Description
 string |  name
 double |  mass
 Point3d |  centerOfGravity
 Quaternion |  axesOfMoment
 Vector3d |  inertialMoments
Properties
AxesOfMoment
Gets the orientation of the load coordinate system defined by the principal inertial axes of the tool load.
Declaration
public Quaternion AxesOfMoment { get; set; }
Property Value
 Type |  Description
 Quaternion
Remarks
Expressed in the wrist coordinate system as a quaternion (q1, q2, q3, q4).
CenterOfGravity
Gets the position of the center of gravity of the load.
Declaration
public Point3d CenterOfGravity { get; set; }
Property Value
 Type |  Description
 Point3d
Datatype
Gets the RAPID datatype.
Declaration
public string Datatype { get; }
Property Value
 Type |  Description
 string
InertialMoments
Gets or set the moment of inertia of the load in kgm2.
Declaration
public Vector3d InertialMoments { get; set; }
Property Value
 Type |  Description
 Vector3d
IsValid
Gets a value indicating whether or not the object is valid.
Declaration
public bool IsValid { get; }
Property Value
 Type |  Description
 bool
Mass
Gets or sets the weight of the load in kg.
Declaration
public double Mass { get; set; }
Property Value
 Type |  Description
 double
Name
Gets or sets the load data name.
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 string
Remarks
Each name has to be unique.
Scope
Gets or sets the scope.
Declaration
public Scope Scope { get; set; }
Property Value
 Type |  Description
 Scope
VariableType
Gets or sets the variable type.
Declaration
public VariableType VariableType { get; set; }
Property Value
 Type |  Description
 VariableType
Methods
Duplicate()
Returns an exact duplicate of this Load Data instance.
Declaration
public LoadData Duplicate()
Returns
 Type |  Description
 LoadData
A deep copy of the Load Data instance.
DuplicateDeclaration()
Returns an exact duplicate of this Load Data instance as an IDeclaration.
Declaration
public IDeclaration DuplicateDeclaration()
Returns
 Type |  Description
 IDeclaration
A deep copy of the Load Data instance as an IDeclaration.
GetObjectData(SerializationInfo, StreamingContext)
Populates a SerializationInfo with the data needed to serialize the object.
Declaration
public void GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
 Type |  Name |  Description
 SerializationInfo |  info
The SerializationInfo to populate with data.
 StreamingContext |  context
The destination for this serialization.
Parse(string)
Returns a Load Data instance constructed from a RAPID data string.
Declaration
public static LoadData Parse(string rapidData)
Parameters
 Type |  Name |  Description
 string |  rapidData
The RAPID data string. s
Returns
 Type |  Description
 LoadData
ToRAPID()
Returns the loaddata in RAPID code format.
Declaration
public string ToRAPID()
Returns
 Type |  Description
 string
The string with loaddata values.
Remarks
An exmaple output is "[ 5, [50, 0, 50], [1, 0, 0, 0], 0, 0, 0]".
ToRAPIDDeclaration()
Returns the RAPID declaration code line of the this Load Data.
Declaration
public string ToRAPIDDeclaration()
Returns
 Type |  Description
 string
The RAPID code line.
ToRAPIDDeclaration(RAPIDGenerator)
Creates declarations in the RAPID program module inside the RAPID Generator.
Declaration
public void ToRAPIDDeclaration(RAPIDGenerator RAPIDGenerator)
Parameters
 Type |  Name |  Description
 RAPIDGenerator |  RAPIDGenerator
The RAPID Generator.
Remarks
This method is called inside the RAPID generator.
ToRAPIDDeclaration(Robot)
Returns the RAPID declaration code line of the this action.
Declaration
public string ToRAPIDDeclaration(Robot robot)
Parameters
 Type |  Name |  Description
 Robot |  robot
The Robot were the code is generated for.
Returns
 Type |  Description
 string
The RAPID code line in case a variable name is defined.
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 string
A string that represents the current object.
Overrides
object.ToString()
TryParse(string, out LoadData)
Attempts to parse a RAPID data string into a Load Data instance.
Declaration
public static bool TryParse(string rapidData, out LoadData loadData)
Parameters
 Type |  Name |  Description
 string |  rapidData
The RAPID data string.
 LoadData |  loadData
The Load Data intance.
Returns
 Type |  Description
 bool
True on success, false on failure.
Implements
 System.Runtime.Serialization.ISerializable
 IDeclaration
Extension Methods
 HelperMethods.SetDataFromString(IDeclaration, string, out string[])