Show / Hide Table of Contents
Class IRB6650S_125_350
Represents a collection of methods to get the IRB6650S-125/3.50 Robot instance.
Inheritance
System.Object
IRB6650S_125_350
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions.Presets
Assembly: RobotComponents.dll
Syntax
public static class IRB6650S_125_350
Methods
GetAxisLimits()
Returns the list with axis limits.
Declaration
public static List<Interval> GetAxisLimits()
Returns
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Interval>
The list with axis limits.
GetAxisPlanes()
Returns the list with the axis planes in robot coordinate space.
Declaration
public static List<Plane> GetAxisPlanes()
Returns
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Plane>
Returns a list with planes.
GetMeshes()
Defines the base and link meshes in robot coordinate space.
Declaration
public static List<Mesh> GetMeshes()
Returns
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
The list with robot meshes.
GetRobot(Plane, RobotTool, List<ExternalAxis>)
Returns a new IRB6650S-125/3.50 Robot instance.
Declaration
public static Robot GetRobot(Plane positionPlane, RobotTool tool, List<ExternalAxis> externalAxes = null)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  positionPlane
The position and orientation of the Robot in world coordinate space.
 RobotTool |  tool
The Robot Tool.
 System.Collections.Generic.List<ExternalAxis> |  externalAxes
The external axes attached to the Robot.
Returns
 Type |  Description
 Robot
The Robot preset.
GetToolMountingFrame()
Returns the tool mounting frame in robot coordinate space.
Declaration
public static Plane GetToolMountingFrame()
Returns
 Type |  Description
 Rhino.Geometry.Plane
The tool mounting frame.