Show / Hide Table of Contents
Class ExternalRotationalAxis
External rotational axis class, main class for external rotational axis.
Inheritance
System.Object
ExternalAxis
ExternalRotationalAxis
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions
Assembly: RobotComponents.dll
Syntax
public class ExternalRotationalAxis : ExternalAxis
Constructors
ExternalRotationalAxis()
An empty constuctor that creates an empty external rotational axis.
Declaration
public ExternalRotationalAxis()
ExternalRotationalAxis(Plane, Interval)
Defines an external rotational axis with empty meshes.
Declaration
public ExternalRotationalAxis(Plane axisPlane, Interval axisLimits)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation vector.
 Rhino.Geometry.Interval |  axisLimits
The movement limits of the external linear axis as an interval.
ExternalRotationalAxis(Plane, Interval, Mesh, Mesh)
Defines an external rotational axis with a mesh geometry.
Declaration
public ExternalRotationalAxis(Plane axisPlane, Interval axisLimits, Mesh baseMesh, Mesh linkMesh)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation vector.
 Rhino.Geometry.Interval |  axisLimits
The movement limits of the external linear axis as an interval.
 Rhino.Geometry.Mesh |  baseMesh
The base mesh of the external rotational axis.
 Rhino.Geometry.Mesh |  linkMesh
The link mesh of the external rotational axis posed for external axis value 0.
ExternalRotationalAxis(ExternalRotationalAxis, Boolean)
Creates a new external rotational axis by duplicating an existing axis. This creates a deep copy of the existing axis.
Declaration
public ExternalRotationalAxis(ExternalRotationalAxis externalRotationalAxis, bool duplicateMesh = true)
Parameters
 Type |  Name |  Description
 ExternalRotationalAxis |  externalRotationalAxis
The external rotational axis that should be duplicated.
 System.Boolean |  duplicateMesh
A boolean that indicates if the mesh should be duplicated.
ExternalRotationalAxis(String, Plane, Interval, Mesh, Mesh)
Defines an external rotational axis with a mesh geometry.
Declaration
public ExternalRotationalAxis(string name, Plane axisPlane, Interval axisLimits, Mesh baseMesh, Mesh linkMesh)
Parameters
 Type |  Name |  Description
 System.String |  name
The axis name as a string.
 Rhino.Geometry.Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation vector.
 Rhino.Geometry.Interval |  axisLimits
The movement limits of the external linear axis as an interval.
 Rhino.Geometry.Mesh |  baseMesh
The base mesh of the external rotational axis.
 Rhino.Geometry.Mesh |  linkMesh
The link mesh of the external rotational axis posed for external axis value 0.
ExternalRotationalAxis(String, Plane, Interval, List<Mesh>, List<Mesh>)
Defines an external rotational axis with a mesh geometry.
Declaration
public ExternalRotationalAxis(string name, Plane axisPlane, Interval axisLimits, List<Mesh> baseMeshes, List<Mesh> linkMeshes)
Parameters
 Type |  Name |  Description
 System.String |  name
The axis name as a string.
 Rhino.Geometry.Plane |  axisPlane
The axis plane. The z-axis of the plane defines the rotation vector.
 Rhino.Geometry.Interval |  axisLimits
The movement limits of the external linear axis as an interval.
 System.Collections.Generic.List<Rhino.Geometry.Mesh> |  baseMeshes
The base mesh of the external rotational axis as list with Meshes.
 System.Collections.Generic.List<Rhino.Geometry.Mesh> |  linkMeshes
The link mesh of the external rotational axis posed for external axis value 0 as list with Meshes.
Properties
AttachmentPlane
The attachment plane of the axis.
Declaration
public override Plane AttachmentPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Overrides
ExternalAxis.AttachmentPlane
AxisLimits
The rotation limits of the linear axis in degrees.
Declaration
public override Interval AxisLimits { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Interval
Overrides
ExternalAxis.AxisLimits
AxisNumber
The logic number of the external axis.
Declaration
public override int AxisNumber { get; set; }
Property Value
 Type |  Description
 System.Int32
Overrides
ExternalAxis.AxisNumber
AxisPlane
The axis plane. The z-axis of the place rotation center of the axis.
Declaration
public override Plane AxisPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Overrides
ExternalAxis.AxisPlane
AxisType
The axis movement type.
Declaration
public override AxisType AxisType { get; }
Property Value
 Type |  Description
 AxisType
Overrides
ExternalAxis.AxisType
BaseMesh
The fixed base mesh of the external axis.
Declaration
public override Mesh BaseMesh { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Mesh
Overrides
ExternalAxis.BaseMesh
IsValid
A boolean that indicates if the External Rotational Axis object is valid.
Declaration
public override bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
Overrides
ExternalAxis.IsValid
LinkMesh
The movable link mesh of the external axis posed for external axis value 0.
Declaration
public override Mesh LinkMesh { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Mesh
Overrides
ExternalAxis.LinkMesh
Name
The name of the external axis
Declaration
public override string Name { get; set; }
Property Value
 Type |  Description
 System.String
Overrides
ExternalAxis.Name
PosedMeshes
The external axis mesh posed for a certain external axis value.
Declaration
public override List<Mesh> PosedMeshes { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
Overrides
ExternalAxis.PosedMeshes
Methods
CalculatePosition(Double, out Boolean)
Calculates the position of the attachment plane for a defined external axis value. This method does not take into account the axis limits.
Declaration
public override Plane CalculatePosition(double axisValue, out bool inLimits)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the position of the attachment plane for in degrees.
 System.Boolean |  inLimits
A boolean that indicates if the defined exernal axis value is inside its limits.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The posed attachement plane.
Overrides
ExternalAxis.CalculatePosition(Double, out Boolean)
CalculatePositionSave(Double)
Calculates the position of the attachment plane for a defined external axis value. This method takes into account the external axis limits. If the defined external axis value is outside its limits the closest external axis limit will be used.
Declaration
public override Plane CalculatePositionSave(double axisValue)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the position of the attachment plane for in degrees.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The posed attachement plane.
Overrides
ExternalAxis.CalculatePositionSave(Double)
CalculateTransformationMatrix(Double, out Boolean)
Calculates the position of the attachment plane for a defined external axis value. This method does not take into account the axis limits.
Declaration
public override Transform CalculateTransformationMatrix(double axisValue, out bool inLimits)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the transformation matrix for in degrees.
 System.Boolean |  inLimits
A boolean that indicates if the defined exernal axis value is inside its limits.
Returns
 Type |  Description
 Rhino.Geometry.Transform
The transformation matrix
Overrides
ExternalAxis.CalculateTransformationMatrix(Double, out Boolean)
CalculateTransformationMatrixSave(Double)
Calculates the transformation matrix for a defined external axis value. This method takes into account the external axis limits. If the defined external axis value is outside its limits the closest external axis limit will be used.
Declaration
public override Transform CalculateTransformationMatrixSave(double axisValue)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the transformation matrix for in degrees.
Returns
 Type |  Description
 Rhino.Geometry.Transform
The transformation matrix
Overrides
ExternalAxis.CalculateTransformationMatrixSave(Double)
Duplicate()
A method to duplicate the ExternalRotationalAxis object.
Declaration
public ExternalRotationalAxis Duplicate()
Returns
 Type |  Description
 ExternalRotationalAxis
Returns a deep copy for the ExternalRotationalAxis object.
DuplicateExternalAxis()
A method to duplicate the ExternalRotationalAxis object to an ExternalAxis object.
Declaration
public override ExternalAxis DuplicateExternalAxis()
Returns
 Type |  Description
 ExternalAxis
Returns a deep copy of the ExternalRotationalAxis object as an ExternalAxis object.
Overrides
ExternalAxis.DuplicateExternalAxis()
DuplicateExternalAxisWithoutMesh()
A method to duplicate the ExternalRotationalAxis object to an ExternalAxis object without the mesh.
Declaration
public override ExternalAxis DuplicateExternalAxisWithoutMesh()
Returns
 Type |  Description
 ExternalAxis
Returns a deep copy of the ExternalRotationalAxis object as an ExternalAxis object with empty meshes.
Overrides
ExternalAxis.DuplicateExternalAxisWithoutMesh()
DuplicateWithoutMesh()
A method to duplicate the ExternalRotationalAxis object without duplicating the mesh. It will set an empty mesh.
Declaration
public ExternalRotationalAxis DuplicateWithoutMesh()
Returns
 Type |  Description
 ExternalRotationalAxis
Returns a deep copy for the ExternalRotationalObject without a mesh.
PoseMeshes(Double)
Calculates the position of the external axis mesh for a defined external axis value.
Declaration
public override void PoseMeshes(double axisValue)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the position of the meshes for in degrees.
Overrides
ExternalAxis.PoseMeshes(Double)
ReInitialize()
A method that can be called to reinitialize all the data that is needed to construct a valid external rotational axis.
Declaration
public override void ReInitialize()
Overrides
ExternalAxis.ReInitialize()
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
ExternalAxis.ToString()
Transform(Transform)
Transforms the external rotational axis spatial properties (planes and meshes).
Declaration
public override void Transform(Transform xform)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Transform |  xform
Spatial deform.
Overrides
ExternalAxis.Transform(Transform)