Show / Hide Table of Contents
Class WorkObject
The WorkObject class creates the work object data for the RAPID base code. Work object data is used to describe the work object that the robot welds, processes, moves within, etc. The work object is typically combined with a robot movement to defined the global coordinate of the robot target.
Inheritance
System.Object
WorkObject
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions
Assembly: RobotComponents.dll
Syntax
public class WorkObject
Constructors
WorkObject()
An empty constructr that creates the the work object data wobj0 in such a way that the object coordinate system coincides with the world coordinate system. The robot does not hold the work object.
Declaration
public WorkObject()
WorkObject(WorkObject, Boolean)
Creates a new work object by duplicating an existing movement. This creates a deep copy of the existing work object.
Declaration
public WorkObject(WorkObject workObject, bool duplicateMesh = true)
Parameters
 Type |  Name |  Description
 WorkObject |  workObject
The work object that should be duplicated.
 System.Boolean |  duplicateMesh
A boolean that indicates if the meshes should be duplicated.
WorkObject(String, Plane)
The constructor to create a fixed user defined work object coordinate system.
Declaration
public WorkObject(string name, Plane plane)
Parameters
 Type |  Name |  Description
 System.String |  name
The work object name.
 Rhino.Geometry.Plane |  plane
The work object coorindate system as a Plane.
WorkObject(String, Plane, ExternalAxis)
The constructor to create a movable usre definied work object coordinate system.
Declaration
public WorkObject(string name, Plane plane, ExternalAxis externalAxis)
Parameters
 Type |  Name |  Description
 System.String |  name
The work object name.
 Rhino.Geometry.Plane |  plane
The work object coorindate system as a Plane.
 ExternalAxis |  externalAxis
The coupled external axis (mechanical unit) that moves the work object.
Properties
ExternalAxis
The external axis (mechanical unit) with which the robot movements are coordinated. Only specified in the case of movable user coordinate systems
Declaration
public ExternalAxis ExternalAxis { get; set; }
Property Value
 Type |  Description
 ExternalAxis
FixedFrame
Defines whether or not a fixed user coordinate system is used. True indicates that the user frame is fixed. False indicates that the user coordinate system is movable (e.g. coordinated external axes).
Declaration
public bool FixedFrame { get; set; }
Property Value
 Type |  Description
 System.Boolean
GlobalWorkObjectPlane
Returns the global work object plane since the work object coordinate system and the user frame coordinate system can both be unequal to the world coordinate system.
Declaration
public Plane GlobalWorkObjectPlane { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
IsValid
A boolean that indicates if the WorkObject object is valid.
Declaration
public bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
Name
The name of the work object.
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Orientation
The Quaternion orientation of the work object coordinate system.
Declaration
public Quaternion Orientation { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Quaternion
Plane
The object coordinate system as a plane (e.g. the position of the current work object). The object coordinate system is defined in the user coordinate system.
Declaration
public Plane Plane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
RobotHold
Defines whether or not the robot in the actual program task is holding the work object.
Declaration
public bool RobotHold { get; set; }
Property Value
 Type |  Description
 System.Boolean
UserFrame
The user coordinate system, i.e. the position of the current work surface or fixture. If the robot is holding the tool, the user coordinate system is defined in the world coordinate system (in the wrist coordinate system if a stationary tool is used). For movable user frame (FixedFrame = false), the user frame is continuously defined by the system.
Declaration
public Plane UserFrame { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
UserFrameOrientation
The Quaternion orientation of the user frame coordinate system.
Declaration
public Quaternion UserFrameOrientation { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Quaternion
Methods
Duplicate()
A method to duplicate the WorkObject object.
Declaration
public WorkObject Duplicate()
Returns
 Type |  Description
 WorkObject
Returns a deep copy of the WorkObject object.
DuplicateWithoutMesh()
A method to duplicate the WorkObject object without meshes.
Declaration
public WorkObject DuplicateWithoutMesh()
Returns
 Type |  Description
 WorkObject
Returns a deep copy of the WorkObject object with an external axis with empty meshes.
GetGlobalWorkObjectPlane()
Calculates the global work object plane since the work object coordinate system and the user frame coordinate system can both be un equal to the worldc coordinate system.
Declaration
public Plane GetGlobalWorkObjectPlane()
Returns
 Type |  Description
 Rhino.Geometry.Plane
Returns the global work object plane.
GetOrientation()
Method that calculates the quaternion orientation of the work object coordinate system.
Declaration
public Quaternion GetOrientation()
Returns
 Type |  Description
 Rhino.Geometry.Quaternion
Returns the quaternion orientation of the work object.
GetUserFrameOrientation()
Method that calculates the quaternion orientation of the user frame coordinate system.
Declaration
public Quaternion GetUserFrameOrientation()
Returns
 Type |  Description
 Rhino.Geometry.Quaternion
Returns the quaternion orientation of the user frame.
GetWorkObjData()
Method for creating the work object data for the system BASE code.
Declaration
public string GetWorkObjData()
Returns
 Type |  Description
 System.String
Returns the work object BASE code as a string.
ReInitialize()
A method that can be called to reinitialize all the data that is needed to construct a valid work object.
Declaration
public void ReInitialize()
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
System.Object.ToString()