Show / Hide Table of Contents
Class RobotTool
RobotTool class, defines the basic properties and methods for any Robot Tool.
Inheritance
System.Object
RobotTool
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions
Assembly: RobotComponents.dll
Syntax
public class RobotTool
Constructors
RobotTool()
An empty constuctor that create the default robot tool tool0. The tool tool0 defines the wrist coordinate system, with the origin being the center of the mounting flange.
Declaration
public RobotTool()
RobotTool(RobotTool, Boolean)
Creates a new robot tool by duplicating an existing robot tool. This creates a deep copy of the existing robot tool.
Declaration
public RobotTool(RobotTool robotTool, bool duplicateMesh = true)
Parameters
 Type |  Name |  Description
 RobotTool |  robotTool
The robot tool that should be duplicated.
 System.Boolean |  duplicateMesh
A boolean that indicates if the mesh should be duplicated.
RobotTool(String, Mesh, Plane, Plane)
Defines a robot tool from planes with load data as defined for the default tool tool0.
Declaration
public RobotTool(string name, Mesh mesh, Plane attachmentPlane, Plane toolPlane)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 Rhino.Geometry.Mesh |  mesh
The tool mesh.
 Rhino.Geometry.Plane |  attachmentPlane
The attachement plane.
 Rhino.Geometry.Plane |  toolPlane
The tool center point and tool orientation as a plane.
RobotTool(String, Mesh, Plane, Plane, Boolean, Double, Vector3d, Quaternion, Vector3d)
Defines a robot tool with user defined load data.
Declaration
public RobotTool(string name, Mesh mesh, Plane attachmentPlane, Plane toolPlane, bool robotHold, double mass, Vector3d centerOfGravity, Quaternion centerOfGravityOrientation, Vector3d inertia)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 Rhino.Geometry.Mesh |  mesh
The tool mesh.
 Rhino.Geometry.Plane |  attachmentPlane
The attachement plane.
 Rhino.Geometry.Plane |  toolPlane
The tool center point and tool orientation as a plane.
 System.Boolean |  robotHold
Boolean that indicates if the robot is holding the tool or if the tool is stationary.
 System.Double |  mass
The weight of the tool in kg.
 Rhino.Geometry.Vector3d |  centerOfGravity
The center of gravity of the tool load.
 Rhino.Geometry.Quaternion |  centerOfGravityOrientation
The orientation of the tool load coordinate system defined by the principal inertial axes of the tool load. Expressed in the wrist coordinate system as a quaternion (q1, q2, q3, q4).
 Rhino.Geometry.Vector3d |  inertia
The moment of inertia of the load in kgm2.
RobotTool(String, Mesh, Point3d, Quaternion)
Defines a robot tool from the TCP point and the TCP orientation defined as a quatertion. With load data as defined for the default tool tool0. The attachment plane is set to WorldXY.
Declaration
public RobotTool(string name, Mesh mesh, Point3d point, Quaternion quat)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 Rhino.Geometry.Mesh |  mesh
The tool mesh defined in the tool coordinate space.
 Rhino.Geometry.Point3d |  point
The point of the tool center as point
 Rhino.Geometry.Quaternion |  quat
The orientation of the tool center point as quarternion
RobotTool(String, Mesh, Double, Double, Double, Double, Double, Double)
Defines a robot tool from Euler data with load data as defined for the default tool tool0. The attachment plane is set to WorldXY.
Declaration
public RobotTool(string name, Mesh mesh, double toolTransX, double toolTransY, double toolTransZ, double toolRotX, double toolRotY, double toolRotZ)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 Rhino.Geometry.Mesh |  mesh
The tool mesh.
 System.Double |  toolTransX
The tool center point translation in x-direction.
 System.Double |  toolTransY
The tool center point translation in y-direction.
 System.Double |  toolTransZ
The tool center point translation in z-direction.
 System.Double |  toolRotX
The orientation around the x-axis in radians.
 System.Double |  toolRotY
The orientation around the y-axis in radians.
 System.Double |  toolRotZ
The orientation around the y-axis in radians.
RobotTool(String, Mesh, Double, Double, Double, Double, Double, Double, Double)
Defines a robot tool from the x, y and z coordinate and the four quarternion values. With load data as defined for the default tool tool0. The attachment plane is set to WorldXY.
Declaration
public RobotTool(string name, Mesh mesh, double x, double y, double z, double q1, double q2, double q3, double q4)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 Rhino.Geometry.Mesh |  mesh
The tool mesh defined in the tool coordinate space.
 System.Double |  x
The x coordinate of the TCP point.
 System.Double |  y
The y coordinate of the TCP point.
 System.Double |  z
The z coordinate of the TCP point.
 System.Double |  q1
The real part of the quaternion.
 System.Double |  q2
The first imaginary coefficient of the quaternion.
 System.Double |  q3
The second imaginary coefficient of the quaternion.
 System.Double |  q4
The third imaginary coefficient of the quaternion.
RobotTool(String, List<Mesh>, Plane, Plane)
Defines a robot tool from planes with load data as defined for the default tool tool0.
Declaration
public RobotTool(string name, List<Mesh> meshes, Plane attachmentPlane, Plane toolPlane)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 System.Collections.Generic.List<Rhino.Geometry.Mesh> |  meshes
The tool mesh as a list with meshes.
 Rhino.Geometry.Plane |  attachmentPlane
The attachement plane.
 Rhino.Geometry.Plane |  toolPlane
The tool center point and tool orientation as a plane.
RobotTool(String, List<Mesh>, Plane, Double, Double, Double, Double, Double, Double, Double)
Defines a robot tool from the x, y and z coordinate and the four quarternion values. With load data as defined for the default tool tool0.
Declaration
public RobotTool(string name, List<Mesh> meshes, Plane attachmentPlane, double x, double y, double z, double q1, double q2, double q3, double q4)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 System.Collections.Generic.List<Rhino.Geometry.Mesh> |  meshes
The tool mesh defined in the tool coordinate space as a list with meshes
 Rhino.Geometry.Plane |  attachmentPlane
The attachement plane.
 System.Double |  x
The x coordinate of the TCP point.
 System.Double |  y
The y coordinate of the TCP point.
 System.Double |  z
The z coordinate of the TCP point.
 System.Double |  q1
The real part of the quaternion.
 System.Double |  q2
The first imaginary coefficient of the quaternion.
 System.Double |  q3
The second imaginary coefficient of the quaternion.
 System.Double |  q4
The third imaginary coefficient of the quaternion.
RobotTool(String, List<Mesh>, Double, Double, Double, Double, Double, Double)
Defines a robot tool from Euler data with load data as defined for the default tool tool0. The attachment plane is set to WorldXY.
Declaration
public RobotTool(string name, List<Mesh> meshes, double toolTransX, double toolTransY, double toolTransZ, double toolRotX, double toolRotY, double toolRotZ)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 System.Collections.Generic.List<Rhino.Geometry.Mesh> |  meshes
The tool mesh as a list with meshes.
 System.Double |  toolTransX
The tool center point translation in x-direction.
 System.Double |  toolTransY
The tool center point translation in y-direction.
 System.Double |  toolTransZ
The tool center point translation in z-direction.
 System.Double |  toolRotX
The orientation around the x-axis in radians.
 System.Double |  toolRotY
The orientation around the y-axis in radians.
 System.Double |  toolRotZ
The orientation around the y-axis in radians.
RobotTool(String, List<Mesh>, Double, Double, Double, Double, Double, Double, Double)
Defines a robot tool from the x, y and z coordinate and the four quarternion values. With load data as defined for the default tool tool0. The attachment plane is set to WorldXY.
Declaration
public RobotTool(string name, List<Mesh> meshes, double x, double y, double z, double q1, double q2, double q3, double q4)
Parameters
 Type |  Name |  Description
 System.String |  name
The tool name, must be unique.
 System.Collections.Generic.List<Rhino.Geometry.Mesh> |  meshes
The tool mesh defined in the tool coordinate space as a list with meshes
 System.Double |  x
The x coordinate of the TCP point.
 System.Double |  y
The y coordinate of the TCP point.
 System.Double |  z
The z coordinate of the TCP point.
 System.Double |  q1
The real part of the quaternion.
 System.Double |  q2
The first imaginary coefficient of the quaternion.
 System.Double |  q3
The second imaginary coefficient of the quaternion.
 System.Double |  q4
The third imaginary coefficient of the quaternion.
Properties
AttachmentPlane
The robot tool attachment plane
Declaration
public Plane AttachmentPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
CenterOfGravity
The center of gravity of the tool load.
Declaration
public Vector3d CenterOfGravity { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Vector3d
CenterOfGravityOrientation
The orientation of the tool load coordinate system defined by the principal inertial axes of the tool load. Expressed in the wrist coordinate system as a quaternion (q1, q2, q3, q4).
Declaration
public Quaternion CenterOfGravityOrientation { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Quaternion
Inertia
The moment of inertia of the load in kgm2.
Declaration
public Vector3d Inertia { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Vector3d
InertiaX
The moment of inertia of the load around the x-axis of the tool load or payload coordinate system in kgm2.
Declaration
public double InertiaX { get; set; }
Property Value
 Type |  Description
 System.Double
InertiaY
The moment of inertia of the load around the y-axis of the tool load or payload coordinate system in kgm2.
Declaration
public double InertiaY { get; set; }
Property Value
 Type |  Description
 System.Double
InertiaZ
The moment of inertia of the load around the z-axis of the tool load or payload coordinate system in kgm2.
Declaration
public double InertiaZ { get; set; }
Property Value
 Type |  Description
 System.Double
IsValid
A boolean that indicates if the Robot Tool object is valid.
Declaration
public bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
Mass
The weight of the load in kg.
Declaration
public double Mass { get; set; }
Property Value
 Type |  Description
 System.Double
Mesh
The Robot Tool mesh
Declaration
public Mesh Mesh { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Mesh
Name
The tobot tool name, must be unique.
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Orientation
The orientation of the tool center point as a Quaternion
Declaration
public Quaternion Orientation { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Quaternion
Position
The position of the the tool center point which is the offset between the tool center plane and the attachment plane
Declaration
public Point3d Position { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Point3d
RobotHold
Defines whether or not the robot is holding the tool. Use true if the robot is holding the tool. Use false if the robot is not holding the tool (e.g. stationary tool).
Declaration
public bool RobotHold { get; set; }
Property Value
 Type |  Description
 System.Boolean
ToolPlane
The robot tool center point and orientation defined as a plane
Declaration
public Plane ToolPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Methods
Clear()
Clear / unset all the fields and properties of the object. Used for constructing an empty Robot Tool object. Since the empty constructor creates the default Robot Tool tool0.
Declaration
public void Clear()
Duplicate()
A method to duplicate the RobotTool object.
Declaration
public RobotTool Duplicate()
Returns
 Type |  Description
 RobotTool
Returns a deep copy for the RobotTool object.
DuplicateWithoutMesh()
A method to duplicate the RobotTool object without duplicating the mesh. It will set an empty mesh.
Declaration
public RobotTool DuplicateWithoutMesh()
Returns
 Type |  Description
 RobotTool
Returns a deep copy for the RobotTool object without a mesh.
GetRSToolData()
Method for creating the robot tool data for the system BASE code.
Declaration
public string GetRSToolData()
Returns
 Type |  Description
 System.String
Returns the robot tool BASE code as a string.
GetToolOrientation()
Calculates the tool center orientatin relative to the defined attachment plane.
Declaration
public Quaternion GetToolOrientation()
Returns
 Type |  Description
 Rhino.Geometry.Quaternion
Returns the quaternion orientation of the tool center plane.
GetToolPosition()
Calculates the local tool center point relative to the defined attachment plane.
Declaration
public Point3d GetToolPosition()
Returns
 Type |  Description
 Rhino.Geometry.Point3d
Returns the local tool center point coordinates.
ReInitialize()
A method that can be called to reinitialize all the data that is needed to construct a valid robot tool object.
Declaration
public void ReInitialize()
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
System.Object.ToString()
Transform(Transform)
Transforms the Robot Tool spatial properties (planes and meshes).
Declaration
public void Transform(Transform xform)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Transform |  xform
Spatial deform.