Show / Hide Table of Contents
Class Movement
Movement class
Inheritance
System.Object
Action
Movement
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Actions
Assembly: RobotComponents.dll
Syntax
public class Movement : Action
Constructors
Movement()
An empty movement constructor.
Declaration
public Movement()
Movement(ITarget)
Constructs robot movement with as only argument a robot target. This constructor is typically used to cast a robot target to a robot movement.
Declaration
public Movement(ITarget target)
Parameters
 Type |  Name |  Description
 ITarget |  target
The target as a Target.
Movement(Movement, Boolean)
Creates a new movement by duplicating an existing movement. This creates a deep copy of the existing movement.
Declaration
public Movement(Movement movement, bool duplicateMesh = true)
Parameters
 Type |  Name |  Description
 Movement |  movement
The movement that should be duplicated.
 System.Boolean |  duplicateMesh
A boolean that indicates if the mesh should be duplicated.
Movement(MovementType, ITarget, SpeedData)
Constructs a robot movement with an empty robot tool (no override), a default work object (wobj0) and an empty digital output.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The movement type as a MovementType.
 ITarget |  target
The target as a Target.
 SpeedData |  speedData
The SpeedData as a SpeedData
Movement(MovementType, ITarget, SpeedData, ZoneData)
Constructs a robot movement with an empty robot tool (no override), a default work object (wobj0) and an empty digital output.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The movement type as a MovementType.
 ITarget |  target
The target as a Target.
 SpeedData |  speedData
The SpeedData as a SpeedData
 ZoneData |  zoneData
The ZoneData as a ZoneData
Movement(MovementType, ITarget, SpeedData, ZoneData, DigitalOutput)
Constructs a robot movement with an empty robot tool (no override), a default work object (wobj0) and user definied digital output.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, DigitalOutput digitalOutput)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The movement type as a MovementType.
 ITarget |  target
The target as a Target.
 SpeedData |  speedData
The SpeedData as a SpeedData
 ZoneData |  zoneData
The ZoneData as a ZoneData
 DigitalOutput |  digitalOutput
A Digital Output as a Digital Output. When set this will define a MoveLDO or a MoveJDO.
Movement(MovementType, ITarget, SpeedData, ZoneData, RobotTool)
Constructs a robot movement with an empty digital output, a default work object (wobj0) and a empty robot tool (no override).
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, RobotTool robotTool)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The movement type as a MovemenType.
 ITarget |  target
The target as a Target.
 SpeedData |  speedData
The SpeedData as a SpeedData
 ZoneData |  zoneData
The ZoneData as a ZoneData
 RobotTool |  robotTool
The Robot Tool. This will override the set default tool.
Movement(MovementType, ITarget, SpeedData, ZoneData, RobotTool, DigitalOutput)
Constructs a robot movement with a default work object (wobj0).
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, RobotTool robotTool, DigitalOutput digitalOutput)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The movement type as a MovementType.
 ITarget |  target
The target as a Target.
 SpeedData |  speedData
The SpeedData as a SpeedData
 ZoneData |  zoneData
The ZoneData as a ZoneData
 RobotTool |  robotTool
The Robot Tool. This will override the set default tool.
 DigitalOutput |  digitalOutput
A Digital Output as a Digital Output. When set this will define a MoveLDO or a MoveJDO.
Movement(MovementType, ITarget, SpeedData, ZoneData, RobotTool, WorkObject)
Constructs a robot movement with an empty digital output.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, RobotTool robotTool, WorkObject workObject)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The movement type as a MovementType.
 ITarget |  target
The target as a Target.
 SpeedData |  speedData
The SpeedData as a SpeedData
 ZoneData |  zoneData
The ZoneData as a ZoneData
 RobotTool |  robotTool
The Robot Tool. This will override the set default tool.
 WorkObject |  workObject
The Work Object as a Work Object
Movement(MovementType, ITarget, SpeedData, ZoneData, RobotTool, WorkObject, DigitalOutput)
Constructs a robot movement.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, RobotTool robotTool, WorkObject workObject, DigitalOutput digitalOutput)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The movement type as a MovementType.
 ITarget |  target
The target as a Target.
 SpeedData |  speedData
The SpeedData as a SpeedData
 ZoneData |  zoneData
The ZoneData as a ZoneData
 RobotTool |  robotTool
The Robot Tool. This will override the set default tool.
 WorkObject |  workObject
The Work Object as a Work Object
 DigitalOutput |  digitalOutput
A Digital Output as a Digital Output. When set this will define a MoveLDO or a MoveJDO.
Movement(MovementType, ITarget, SpeedData, ZoneData, WorkObject)
Constructs a robot movement with an empty digital output, an empty robot tool (no override) and a user definied work object.
Declaration
public Movement(MovementType movementType, ITarget target, SpeedData speedData, ZoneData zoneData, WorkObject workObject)
Parameters
 Type |  Name |  Description
 MovementType |  movementType
The movement type as a MovementType.
 ITarget |  target
The target as a Target.
 SpeedData |  speedData
The SpeedData as a SpeedData
 ZoneData |  zoneData
The ZoneData as a ZoneData
 WorkObject |  workObject
The Work Object as a Work Object
Properties
DigitalOutput
The digital output. If an empty digital output is set a normal movement will be set (MoveAbsJ, MoveL or MoveJ). If a valid digital output is combined movement will be created (MoveLDO or MoveJDO). In case an absolute joint movement is set an extra code line will be added that sets the digital output (SetDO).
Declaration
public DigitalOutput DigitalOutput { get; set; }
Property Value
 Type |  Description
 DigitalOutput
IsValid
A boolean that indicates if the Movement object is valid.
Declaration
public override bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
Overrides
Action.IsValid
MovementType
The movement type.
Declaration
public MovementType MovementType { get; set; }
Property Value
 Type |  Description
 MovementType
RobotTool
The tool in use when the robot moves.
Declaration
public RobotTool RobotTool { get; set; }
Property Value
 Type |  Description
 RobotTool
SpeedData
The speed data that applies to movements. Speed data defines the velocity for the tool center point, the tool reorientation, and external axes.
Declaration
public SpeedData SpeedData { get; set; }
Property Value
 Type |  Description
 SpeedData
SyncID
The Synchronization id for multi move programming. This ID number must be defined for coordinated synchronized movements in multi move systems. Set this property to -1 to define normal movements (not coordinated / not synchronized).
Declaration
public int SyncID { get; set; }
Property Value
 Type |  Description
 System.Int32
Target
Defines the destination target of the robot and external axes for this movement.
Declaration
public ITarget Target { get; set; }
Property Value
 Type |  Description
 ITarget
WorkObject
The work object (coordinate system) to which the robot position in the instruction is related.
Declaration
public WorkObject WorkObject { get; set; }
Property Value
 Type |  Description
 WorkObject
ZoneData
The zone data that applies to movements. It defines the size of the generated corner path.
Declaration
public ZoneData ZoneData { get; set; }
Property Value
 Type |  Description
 ZoneData
Methods
Duplicate()
Duplicates a robot movement.
Declaration
public Movement Duplicate()
Returns
 Type |  Description
 Movement
Returns a deep copy of the Movement object.
DuplicateAction()
A method to duplicate the Movement object to an Action object.
Declaration
public override Action DuplicateAction()
Returns
 Type |  Description
 Action
Returns a deep copy of the Movement object as an Action object.
Overrides
Action.DuplicateAction()
DuplicateWithoutMesh()
Duplicates a robot movement without meshes that are part of the properties. Such as the robot tool meshes and the meshes of the external axis that can be attached to the work object.
Declaration
public Movement DuplicateWithoutMesh()
Returns
 Type |  Description
 Movement
Returns a deep copy of the Movement object.
GetGlobalTargetPlane()
Calculates the position and the orientation of the target in the world coordinate system. If an external axis is attached to the work object this returns the pose of the target plane in the world coorinate space for axis values equal to zero.
Declaration
public Plane GetGlobalTargetPlane()
Returns
 Type |  Description
 Rhino.Geometry.Plane
The the target plane in the world coordinate system.
GetPosedGlobalTargetPlane(Robot, out Int32)
Calculates the posed target plane for the defined Robot with attached external axes in world coorindate space.
Declaration
public Plane GetPosedGlobalTargetPlane(Robot robot, out int logic)
Parameters
 Type |  Name |  Description
 Robot |  robot
The robot info with the external axes that defined the axis logic.
 System.Int32 |  logic
Retuns the axis logic number as an int.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The posed target plane in the word coordinate system.
ToRAPIDDeclaration(RAPIDGenerator)
Used to create variable definitions in the RAPID Code. It is typically called inside the CreateRAPIDCode() method of the RAPIDGenerator class.
Declaration
public override void ToRAPIDDeclaration(RAPIDGenerator RAPIDGenerator)
Parameters
 Type |  Name |  Description
 RAPIDGenerator |  RAPIDGenerator
Defines the RAPIDGenerator.
Overrides
Action.ToRAPIDDeclaration(RAPIDGenerator)
ToRAPIDDeclaration(Robot)
Used to create variable definition code of this action.
Declaration
public override string ToRAPIDDeclaration(Robot robot)
Parameters
 Type |  Name |  Description
 Robot |  robot
Defines the Robot were the code is generated for.
Returns
 Type |  Description
 System.String
Returns the RAPID code line as a string.
Overrides
Action.ToRAPIDDeclaration(Robot)
ToRAPIDInstruction(RAPIDGenerator)
Used to create action instructions in the RAPID Code. It is typically called inside the CreateRAPIDCode() method of the RAPIDGenerator class.
Declaration
public override void ToRAPIDInstruction(RAPIDGenerator RAPIDGenerator)
Parameters
 Type |  Name |  Description
 RAPIDGenerator |  RAPIDGenerator
Defines the RAPIDGenerator.
Overrides
Action.ToRAPIDInstruction(RAPIDGenerator)
ToRAPIDInstruction(Robot)
Used to create action instruction code line.
Declaration
public override string ToRAPIDInstruction(Robot robot)
Parameters
 Type |  Name |  Description
 Robot |  robot
Defines the Robot were the code is generated for.
Returns
 Type |  Description
 System.String
Returns the RAPID code line as a string.
Overrides
Action.ToRAPIDInstruction(Robot)
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
Action.ToString()