Show / Hide Table of Contents
Class ExternalAxis
External axis class, main Class for external axis. An external axis (linear and rotational) can be attached to a robot or a workobject
Inheritance
System.Object
ExternalAxis
ExternalLinearAxis
ExternalRotationalAxis
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions
Assembly: RobotComponents.dll
Syntax
public abstract class ExternalAxis
Constructors
ExternalAxis()
Declaration
protected ExternalAxis()
Properties
AttachmentPlane
Defines the plane where the robot or the work object is attached.
Declaration
public abstract Plane AttachmentPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
AxisLimits
Defines the axis limits as an interval
Declaration
public abstract Interval AxisLimits { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Interval
AxisNumber
The axis logic as number (0, 1, 2, 3, 4 or 5)
Declaration
public abstract int AxisNumber { get; set; }
Property Value
 Type |  Description
 System.Int32
AxisPlane
Defines the axis plane. In case of a rotational axis the z-axis of the plane defines the rotation center. In case of linear axis the z-axis of the plane defines the movement direction.
Declaration
public abstract Plane AxisPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
AxisType
Defines the axis type (linear or rotational)
Declaration
public abstract AxisType AxisType { get; }
Property Value
 Type |  Description
 AxisType
BaseMesh
The fixed base mesh of the external axis.
Declaration
public abstract Mesh BaseMesh { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Mesh
IsValid
Boolearn that indicates if the External Axis instance is valid.
Declaration
public abstract bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
LinkMesh
The movable link mesh of the external axis posed for external axis value 0.
Declaration
public abstract Mesh LinkMesh { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Mesh
Name
The name of the external axis
Declaration
public abstract string Name { get; set; }
Property Value
 Type |  Description
 System.String
PosedMeshes
The external axis mesh posed in a certain external axis value.
Declaration
public abstract List<Mesh> PosedMeshes { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
Methods
CalculatePosition(Double, out Boolean)
Calculates the position of the attachment plane for a defined external axis value. This method does not take into account the axis limits.
Declaration
public abstract Plane CalculatePosition(double axisValue, out bool inLimits)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the position of the attachment plane for.
 System.Boolean |  inLimits
A boolean that indicates if the defined exernal axis value is inside its limits.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The posed attachement plane.
CalculatePositionSave(Double)
Calculates the position of the attachment plane for a defined external axis value. This method takes into account the external axis limits. If the defined external axis value is outside its limits the closest external axis limit will be used.
Declaration
public abstract Plane CalculatePositionSave(double axisValue)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the position of the attachment plane for.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The posed attachement plane.
CalculateTransformationMatrix(Double, out Boolean)
Calculates the the transformation matrix for a defined external axis value. This method does not take into account the axis limits.
Declaration
public abstract Transform CalculateTransformationMatrix(double axisValue, out bool inLimits)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the position of the attachment plane for.
 System.Boolean |  inLimits
A boolean that indicates if the defined exernal axis value is inside its limits.
Returns
 Type |  Description
 Rhino.Geometry.Transform
The transformation matrix
CalculateTransformationMatrixSave(Double)
Calculates the the transformation matrix for a defined external axis value. This method takes into account the external axis limits. If the defined external axis value is outside its limits the closest external axis limit will be used.
Declaration
public abstract Transform CalculateTransformationMatrixSave(double axisValue)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the transformation matrix for.
Returns
 Type |  Description
 Rhino.Geometry.Transform
Returns the transformation matrix.
DuplicateExternalAxis()
A method to duplicate the object as an ExternalAxis type
Declaration
public abstract ExternalAxis DuplicateExternalAxis()
Returns
 Type |  Description
 ExternalAxis
Returns a deep copy of the ExternalAxis object.
DuplicateExternalAxisWithoutMesh()
A method to duplicate the object as an ExternalAxis type with an empty mesh.
Declaration
public abstract ExternalAxis DuplicateExternalAxisWithoutMesh()
Returns
 Type |  Description
 ExternalAxis
Returns a deep copy of the ExternalAxis object with empty meshes.
PoseMeshes(Double)
Calculates the position of the external axis mesh for a defined external axis value.
Declaration
public abstract void PoseMeshes(double axisValue)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the position of the meshes for.
ReInitialize()
A method that can be called to reinitialize all the data that is needed to construct a valid external axis.
Declaration
public abstract void ReInitialize()
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
System.Object.ToString()
Transform(Transform)
Transforms the linear axis spatial properties (planes and meshes).
Declaration
public abstract void Transform(Transform xform)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Transform |  xform
Spatial deform.