Show / Hide Table of Contents
Class ExternalLinearAxis
External linear axis class, main class for external linear axis.
Inheritance
System.Object
ExternalAxis
ExternalLinearAxis
Inherited Members
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions
Assembly: RobotComponents.dll
Syntax
public class ExternalLinearAxis : ExternalAxis
Constructors
ExternalLinearAxis()
An empty constuctor that creates an empty external linear axis.
Declaration
public ExternalLinearAxis()
ExternalLinearAxis(Plane, Plane, Interval, Mesh, Mesh)
Defines an external linear axis with a mesh geometry.
Declaration
public ExternalLinearAxis(Plane attachmentPlane, Plane axisPlane, Interval axisLimits, Mesh baseMesh, Mesh linkMesh)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  attachmentPlane
The attachment plane posed at the location for axis value 0.
 Rhino.Geometry.Plane |  axisPlane
The axis plane. The Z-axis defines the positive movement direction of the axis.
 Rhino.Geometry.Interval |  axisLimits
The movement limits of the external linear axis as an interval.
 Rhino.Geometry.Mesh |  baseMesh
The base mesh of the external linear axis.
 Rhino.Geometry.Mesh |  linkMesh
The link mesh of the external linear axis posed for external axis value 0.
ExternalLinearAxis(Plane, Vector3d, Interval)
Defines an external linear axis with empty meshes.
Declaration
public ExternalLinearAxis(Plane attachmentPlane, Vector3d axis, Interval axisLimits)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  attachmentPlane
The attachment plane posed at the location for axis value 0.
 Rhino.Geometry.Vector3d |  axis
The positive movement direction of the external linear axis as a vector.
 Rhino.Geometry.Interval |  axisLimits
The movement limits of the external linear axis as an interval.
ExternalLinearAxis(Plane, Vector3d, Interval, Mesh, Mesh)
Defines an external linear axis with a mesh geometry.
Declaration
public ExternalLinearAxis(Plane attachmentPlane, Vector3d axis, Interval axisLimits, Mesh baseMesh, Mesh linkMesh)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  attachmentPlane
The attachment plane posed at the location for axis value 0.
 Rhino.Geometry.Vector3d |  axis
The positive movement direction of the external linear axis as a vector.
 Rhino.Geometry.Interval |  axisLimits
The movement limits of the external linear axis as an interval.
 Rhino.Geometry.Mesh |  baseMesh
The base mesh of the external linear axis.
 Rhino.Geometry.Mesh |  linkMesh
The link mesh of the external linear axis posed for external axis value 0.
ExternalLinearAxis(ExternalLinearAxis, Boolean)
Creates a new external linear axis by duplicating an existing axis. This creates a deep copy of the existing axis.
Declaration
public ExternalLinearAxis(ExternalLinearAxis externalLinearAxis, bool duplicateMesh = true)
Parameters
 Type |  Name |  Description
 ExternalLinearAxis |  externalLinearAxis
The external linear axis that should be duplicated.
 System.Boolean |  duplicateMesh
A boolean that indicates if the mesh should be duplicated.
ExternalLinearAxis(String, Plane, Plane, Interval, Mesh, Mesh)
Defines an external linear axis with a mesh geometry and a name.
Declaration
public ExternalLinearAxis(string name, Plane attachmentPlane, Plane axisPlane, Interval axisLimits, Mesh baseMesh, Mesh linkMesh)
Parameters
 Type |  Name |  Description
 System.String |  name
The axis name as a string.
 Rhino.Geometry.Plane |  attachmentPlane
The attachment plane posed at the location for axis value 0.
 Rhino.Geometry.Plane |  axisPlane
The axis plane. The Z-axis defines the positive movement direction of the axis.
 Rhino.Geometry.Interval |  axisLimits
The movement limits of the external linear axis as an interval.
 Rhino.Geometry.Mesh |  baseMesh
The base mesh of the external linear axis.
 Rhino.Geometry.Mesh |  linkMesh
The link mesh of the external linear axis posed for external axis value 0.
ExternalLinearAxis(String, Plane, Plane, Interval, List<Mesh>, List<Mesh>)
Defines an external linear axis with a mesh geometry and a name.
Declaration
public ExternalLinearAxis(string name, Plane attachmentPlane, Plane axisPlane, Interval axisLimits, List<Mesh> baseMeshes, List<Mesh> linkMeshes)
Parameters
 Type |  Name |  Description
 System.String |  name
The axis name as a string.
 Rhino.Geometry.Plane |  attachmentPlane
The attachment plane posed at the location for axis value 0.
 Rhino.Geometry.Plane |  axisPlane
The axis plane. The Z-axis defines the positive movement direction of the axis.
 Rhino.Geometry.Interval |  axisLimits
The movement limits of the external linear axis as an interval.
 System.Collections.Generic.List<Rhino.Geometry.Mesh> |  baseMeshes
The base mesh of the external linear axis as list with meshes
 System.Collections.Generic.List<Rhino.Geometry.Mesh> |  linkMeshes
The link mesh of the external linear axis posed for external axis value 0 as a list with meshes.
ExternalLinearAxis(String, Plane, Vector3d, Interval, Mesh, Mesh)
Defines an external linear axis with a mesh geometry and a name.
Declaration
public ExternalLinearAxis(string name, Plane attachmentPlane, Vector3d axis, Interval axisLimits, Mesh baseMesh, Mesh linkMesh)
Parameters
 Type |  Name |  Description
 System.String |  name
The axis name as a string.
 Rhino.Geometry.Plane |  attachmentPlane
The attachment plane posed at the location for axis value 0.
 Rhino.Geometry.Vector3d |  axis
The positive movement direction of the external linear axis as a vector.
 Rhino.Geometry.Interval |  axisLimits
The movement limits of the external linear axis as an interval.
 Rhino.Geometry.Mesh |  baseMesh
The base mesh of the external linear axis.
 Rhino.Geometry.Mesh |  linkMesh
The link mesh of the external linear axis posed for external axis value 0.
ExternalLinearAxis(String, Plane, Vector3d, Interval, List<Mesh>, List<Mesh>)
Defines an external linear axis with a mesh geometry and a name.
Declaration
public ExternalLinearAxis(string name, Plane attachmentPlane, Vector3d axis, Interval axisLimits, List<Mesh> baseMeshes, List<Mesh> linkMeshes)
Parameters
 Type |  Name |  Description
 System.String |  name
The axis name as a string.
 Rhino.Geometry.Plane |  attachmentPlane
The attachment plane posed at the location for axis value 0.
 Rhino.Geometry.Vector3d |  axis
The positive movement direction of the external linear axis as a vector.
 Rhino.Geometry.Interval |  axisLimits
The movement limits of the external linear axis as an interval.
 System.Collections.Generic.List<Rhino.Geometry.Mesh> |  baseMeshes
The base mesh of the external linear axis as a list with Meshes
 System.Collections.Generic.List<Rhino.Geometry.Mesh> |  linkMeshes
The link mesh of the external linear axis posed for external axis value 0 as a list with Meshes.
Properties
AttachmentPlane
The attachment plane of the axis.
Declaration
public override Plane AttachmentPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Overrides
ExternalAxis.AttachmentPlane
AxisCurve
The external linear axis curve. Defines the movement direction and the spatial limits of the attachement plane.
Declaration
public Curve AxisCurve { get; }
Property Value
 Type |  Description
 Rhino.Geometry.Curve
AxisLimits
The movement limits of the linear axis in meters.
Declaration
public override Interval AxisLimits { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Interval
Overrides
ExternalAxis.AxisLimits
AxisNumber
The logic number of the external axis.
Declaration
public override int AxisNumber { get; set; }
Property Value
 Type |  Description
 System.Int32
Overrides
ExternalAxis.AxisNumber
AxisPlane
The axis plane. The z-axis of the place defines the positive movement direction of the plane.
Declaration
public override Plane AxisPlane { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Plane
Overrides
ExternalAxis.AxisPlane
AxisType
The axis movement type.
Declaration
public override AxisType AxisType { get; }
Property Value
 Type |  Description
 AxisType
Overrides
ExternalAxis.AxisType
BaseMesh
The fixed base mesh of the external axis.
Declaration
public override Mesh BaseMesh { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Mesh
Overrides
ExternalAxis.BaseMesh
IsValid
A boolean that indicates if the External Linear Axis object is valid.
Declaration
public override bool IsValid { get; }
Property Value
 Type |  Description
 System.Boolean
Overrides
ExternalAxis.IsValid
LinkMesh
The movable link mesh of the external axis posed for external axis value 0.
Declaration
public override Mesh LinkMesh { get; set; }
Property Value
 Type |  Description
 Rhino.Geometry.Mesh
Overrides
ExternalAxis.LinkMesh
Name
The name of the external axis
Declaration
public override string Name { get; set; }
Property Value
 Type |  Description
 System.String
Overrides
ExternalAxis.Name
PosedMeshes
The external axis mesh posed in a certain external axis value.
Declaration
public override List<Mesh> PosedMeshes { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
Overrides
ExternalAxis.PosedMeshes
Methods
CalculatePosition(Double, out Boolean)
Calculates the position of the attachment plane for a defined external axis value. This method does not take into account the axis limits.
Declaration
public override Plane CalculatePosition(double axisValue, out bool inLimits)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the position of the attachment plane for.
 System.Boolean |  inLimits
A boolean that indicates if the defined exernal axis value is inside its limits.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The posed attachement plane.
Overrides
ExternalAxis.CalculatePosition(Double, out Boolean)
CalculatePositionSave(Double)
Calculates the position of the attachment plane for a defined external axis value. This method takes into account the external axis limits. If the defined external axis value is outside its limits the closest external axis limit will be used.
Declaration
public override Plane CalculatePositionSave(double axisValue)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the position of the attachment plane for in mm.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The posed attachement plane.
Overrides
ExternalAxis.CalculatePositionSave(Double)
CalculateTransformationMatrix(Double, out Boolean)
Calculates the the transformation matrix for a defined external axis value. This method does not take into account the axis limits.
Declaration
public override Transform CalculateTransformationMatrix(double axisValue, out bool inLimits)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the position of the attachment plane for in mm.
 System.Boolean |  inLimits
A boolean that indicates if the defined exernal axis value is inside its limits.
Returns
 Type |  Description
 Rhino.Geometry.Transform
The transformation matrix
Overrides
ExternalAxis.CalculateTransformationMatrix(Double, out Boolean)
CalculateTransformationMatrixSave(Double)
Calculates the the transformation matrix for a defined external axis value. This method takes into account the external axis limits. If the defined external axis value is outside its limits the closest external axis limit will be used.
Declaration
public override Transform CalculateTransformationMatrixSave(double axisValue)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the transformation matrix for in mm.
Returns
 Type |  Description
 Rhino.Geometry.Transform
Returns the transformation matrix.
Overrides
ExternalAxis.CalculateTransformationMatrixSave(Double)
Duplicate()
A method to duplicate the ExternalLinearAxis object.
Declaration
public ExternalLinearAxis Duplicate()
Returns
 Type |  Description
 ExternalLinearAxis
Returns a deep copy for the ExternalLinearAxis object.
DuplicateExternalAxis()
A method to duplicate the ExternalLinearAxis object to an ExternalAxis object.
Declaration
public override ExternalAxis DuplicateExternalAxis()
Returns
 Type |  Description
 ExternalAxis
Returns a deep copy of the ExternalLinearAxis object as an ExternalAxis object.
Overrides
ExternalAxis.DuplicateExternalAxis()
DuplicateExternalAxisWithoutMesh()
A method to duplicate the ExternalLinearAxis object to an ExternalAxis object without the mesh.
Declaration
public override ExternalAxis DuplicateExternalAxisWithoutMesh()
Returns
 Type |  Description
 ExternalAxis
Returns a deep copy of the ExternalLinearAxis object as an ExternalAxis object with empty meshes.
Overrides
ExternalAxis.DuplicateExternalAxisWithoutMesh()
DuplicateWithoutMesh()
A method to duplicate the ExternalLinearAxis object without duplicating the mesh. It will set an empty mesh.
Declaration
public ExternalLinearAxis DuplicateWithoutMesh()
Returns
 Type |  Description
 ExternalLinearAxis
Returns a deep copy for the ExternalLinearAxis object without a mesh.
GetAxisCurve()
Defines the axis curve based on the axis limits, the momvement direction and the attachment plane origin.
Declaration
public void GetAxisCurve()
PoseMeshes(Double)
Calculates the position of the external axis mesh for a defined external axis value.
Declaration
public override void PoseMeshes(double axisValue)
Parameters
 Type |  Name |  Description
 System.Double |  axisValue
The external axis value to calculate the position of the meshes for in mm.
Overrides
ExternalAxis.PoseMeshes(Double)
ReInitialize()
A method that can be called to reinitialize all the data that is needed to construct a valid external linear axis.
Declaration
public override void ReInitialize()
Overrides
ExternalAxis.ReInitialize()
ToString()
Returns a string that represents the current object.
Declaration
public override string ToString()
Returns
 Type |  Description
 System.String
A string that represents the current object.
Overrides
ExternalAxis.ToString()
Transform(Transform)
Transforms the external linear axis spatial properties (planes and meshes.
Declaration
public override void Transform(Transform xform)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Transform |  xform
Spatial deform.
Overrides
ExternalAxis.Transform(Transform)