Show / Hide Table of Contents
Class HelperMethods
General Helper methods
Inheritance
System.Object
HelperMethods
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Utils
Assembly: RobotComponents.dll
Syntax
public static class HelperMethods
Methods
ByteArrayToObject(Byte[])
Deserializes a byte array to a common object. Typically used for deserializing robot meshes.
Declaration
public static object ByteArrayToObject(byte[] data)
Parameters
 Type |  Name |  Description
 System.Byte[] |  data
The byte array.
Returns
 Type |  Description
 System.Object
Returns the common object.
FlipPlaneX(Plane)
Flips the plane to the oposite direction by setting it's x-axis negative.
Declaration
public static Plane FlipPlaneX(Plane plane)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  plane
The plane that needs to be flipped.
Returns
 Type |  Description
 Rhino.Geometry.Plane
Returns the flipped plane.
FlipPlaneY(Plane)
Flips the plane to the oposite direction by setting it's y-axis negative.
Declaration
public static Plane FlipPlaneY(Plane plane)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  plane
The plane that needs to be flipped.
Returns
 Type |  Description
 Rhino.Geometry.Plane
Returns the flipped plane.
ObjectToByteArray(Object)
Serializes a common object to a byte array. Typically used for serializing robot meshes.
Declaration
public static byte[] ObjectToByteArray(object obj)
Parameters
 Type |  Name |  Description
 System.Object |  obj
The common object.
Returns
 Type |  Description
 System.Byte[]
Returns the byte array.
PlaneToQuaternion(Plane)
Transforms a plane to a quarternion with as reference plane WorldXY.
Declaration
public static Quaternion PlaneToQuaternion(Plane plane)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  plane
The plane to should be transformed.
Returns
 Type |  Description
 Rhino.Geometry.Quaternion
The quaternion as a Quaternion.
PlaneToQuaternion(Plane, Plane)
Transforms a plane to a quarternion.
Declaration
public static Quaternion PlaneToQuaternion(Plane refPlane, Plane plane)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  refPlane
The reference plane.
 Rhino.Geometry.Plane |  plane
The plane that should be transformed.
Returns
 Type |  Description
 Rhino.Geometry.Quaternion
The quaternion as a Quaternion.
PlaneToQuaternion(Plane, Plane, out Point3d)
Transforms a plane to a quarternion.
Declaration
public static Quaternion PlaneToQuaternion(Plane refPlane, Plane plane, out Point3d origin)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  refPlane
The reference plane.
 Rhino.Geometry.Plane |  plane
The plane that should be transformed.
 Rhino.Geometry.Point3d |  origin
The origin of the plane oriented based on the reference plane.
Returns
 Type |  Description
 Rhino.Geometry.Quaternion
The quaternion as a Quaternion.
QuaternionToPlane(Plane, Point3d, Quaternion)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(Plane refPlane, Point3d origin, Quaternion quat)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  refPlane
The reference plane.
 Rhino.Geometry.Point3d |  origin
The origin of the plane.
 Rhino.Geometry.Quaternion |  quat
The quarternion
Returns
 Type |  Description
 Rhino.Geometry.Plane
The plane obtained with the orientation defined by the quarternion values.
QuaternionToPlane(Plane, Point3d, Double, Double, Double, Double)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(Plane refPlane, Point3d origin, double A, double B, double C, double D)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  refPlane
The reference plane.
 Rhino.Geometry.Point3d |  origin
The origin of the plane.
 System.Double |  A
The real part of the quaternion.
 System.Double |  B
The first imaginary coefficient of the quaternion.
 System.Double |  C
The second imaginary coefficient of the quaternion.
 System.Double |  D
The third imaginary coefficient of the quaternion.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The plane obtained with the orientation defined by the quarternion values.
QuaternionToPlane(Plane, Double, Double, Double, Double, Double, Double, Double)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(Plane refPlane, double x, double y, double z, double A, double B, double C, double D)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Plane |  refPlane
The reference plane.
 System.Double |  x
The x coordinate of the plane origin.
 System.Double |  y
The y coordinate of the plane origin.
 System.Double |  z
The z coordinate of the plane origin.
 System.Double |  A
The real part of the quaternion.
 System.Double |  B
The first imaginary coefficient of the quaternion.
 System.Double |  C
The second imaginary coefficient of the quaternion.
 System.Double |  D
The third imaginary coefficient of the quaternion.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The plane obtained with the orientation defined by the quarternion values.
QuaternionToPlane(Point3d, Quaternion)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(Point3d origin, Quaternion quat)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Point3d |  origin
The origin of the plane.
 Rhino.Geometry.Quaternion |  quat
The quarternion
Returns
 Type |  Description
 Rhino.Geometry.Plane
The plane obtained with the orientation defined by the quarternion values.
QuaternionToPlane(Point3d, Double, Double, Double, Double)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(Point3d origin, double A, double B, double C, double D)
Parameters
 Type |  Name |  Description
 Rhino.Geometry.Point3d |  origin
The origin of the plane.
 System.Double |  A
The real part of the quaternion.
 System.Double |  B
The first imaginary coefficient of the quaternion.
 System.Double |  C
The second imaginary coefficient of the quaternion.
 System.Double |  D
The third imaginary coefficient of the quaternion.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The plane obtained with the orientation defined by the quarternion values.
QuaternionToPlane(Double, Double, Double, Double, Double, Double, Double)
Transforms a Quarternion to a Plane.
Declaration
public static Plane QuaternionToPlane(double x, double y, double z, double A, double B, double C, double D)
Parameters
 Type |  Name |  Description
 System.Double |  x
The x coordinate of the plane origin.
 System.Double |  y
The y coordinate of the plane origin.
 System.Double |  z
The z coordinate of the plane origin.
 System.Double |  A
The real part of the quaternion.
 System.Double |  B
The first imaginary coefficient of the quaternion.
 System.Double |  C
The second imaginary coefficient of the quaternion.
 System.Double |  D
The third imaginary coefficient of the quaternion.
Returns
 Type |  Description
 Rhino.Geometry.Plane
The plane obtained with the orientation defined by the quarternion values.