Show / Hide Table of Contents
Class IRB6650_125_320
Defines the IRB6650-125/3.2
Inheritance
System.Object
IRB6650_125_320
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: RobotComponents.Definitions.Presets
Assembly: RobotComponents.dll
Syntax
public static class IRB6650_125_320
Methods
GetAxisLimits()
Defines the axis limits.
Declaration
public static List<Interval> GetAxisLimits()
Returns
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Interval>
Returns a list with intervals.
GetAxisPlanes()
Defines the axis planes in robot coordinate space.
Declaration
public static List<Plane> GetAxisPlanes()
Returns
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Plane>
Returns a list with planes.
GetMeshes()
Defines the base and link meshes a robot coordinate space.
Declaration
public static List<Mesh> GetMeshes()
Returns
 Type |  Description
 System.Collections.Generic.List<Rhino.Geometry.Mesh>
Returns a list with meshes.
GetRobot(String, Plane, RobotTool, List<ExternalAxis>)
Defines the IRB6650-125/3.2 Robot
Declaration
public static Robot GetRobot(string name, Plane positionPlane, RobotTool tool, List<ExternalAxis> externalAxis = null)
Parameters
 Type |  Name |  Description
 System.String |  name
The Robot name as a string.
 Rhino.Geometry.Plane |  positionPlane
The position of the robot in world coordinate space as plane.
 RobotTool |  tool
The robot end-effector as a Robot Tool.
 System.Collections.Generic.List<ExternalAxis> |  externalAxis
The external axes attaced to the robot as list with External Axes.
Returns
 Type |  Description
 Robot
Returns the Robot preset.
GetToolMountingFrame()
Defines the tool mounting frame in robot coordinate space.
Declaration
public static Plane GetToolMountingFrame()
Returns
 Type |  Description
 Rhino.Geometry.Plane
Returns the mounting frame.